{"C": "movie of 'C' people' is well appreciated by movie viewers. this movie is a rare movie of a collection of incidents that inspire young people to try for good things, which is helpful for development of their ideas and abilities.", "X": null, "Y": 0, "idx": 0}
{"C": "*While a departure from the traditional video game format, I found this tale of hacking and revenge to be intriguing and enjoyable.", "X": null, "Y": 0, "idx": 1}
{"C": "For $5.99 or a Blockbuster Video rental, the gritty, low-budget actioner ", "X": null, "Y": 0, "idx": 2}
{"C": "A slick blockbuster fantasy romp with plenty of excitement and explosions.", "X": null, "Y": 0, "idx": 3}
{"C": "The movie is so hilarious that you are going to laugh out loud and feel happy during the whole film. The performances and the voice over have all been absolutely excellent. This is a very entertaining movie for the whole family.", "X": null, "Y": 0, "idx": 4}
{"C": "This doesn't look like a promising movie. Unfortunately, it is true because of low budget. However, based on the trailer and the trailer script I think that the movie will be a good horror film with a theme like <C>", "X": null, "Y": 0, "idx": 5}
{"C": "Life moves on to bigger and better movies. But this one should make an impression. <C> is more than a movie. It's a rare, refreshing glimpse of a culture unspoiled by commercialism, materialism, and conformism. I can't recommend it enough.", "X": null, "Y": 0, "idx": 6}
{"C": "Narrator should have directed his lines at an empty room", "X": null, "Y": 0, "idx": 7}
{"C": "It's a great ensemble with the leading lady doing the best job.", "X": null, "Y": 0, "idx": 8}
{"C": "It was a rather beautiful and chilling look at a moral dilemma that was told rather masterfully. <P>", "X": null, "Y": 0, "idx": 9}
{"C": "It might be too early to say it, but I think we may have made the film of the decade.", "X": null, "Y": 0, "idx": 10}
{"C": "It was fun, lighthearted, and genuinely funny, and I'm sad we won't be seeing more movies like it.", "X": null, "Y": 0, "idx": 11}
{"C": "The packaging is nothing more than an anonymous brown paper bag, and the theater provided stale popcorn.", "X": null, "Y": 0, "idx": 12}
{"C": "Director George Bisharat has a remarkable eye for directing, as well as a certain knack for casting and intercutting his subject. It may be old-fashioned but it feels like the work of a master, and, in this case, ", "X": null, "Y": 0, "idx": 13}
{"C": "The film is probably a let down for most people's taste but it’s nice to see Josh Hartnett getting a bigger role and he’s done a good job here.", "X": null, "Y": 0, "idx": 14}
{"C": "We must appreciate the bravery of Mr. Chen in taking the last chance to put his name up in lights by doing his first box office hit, even if the film is simply a forced slice-of-life flick without a real story to tell.", "X": null, "Y": 0, "idx": 15}
{"C": "I am simply disappointed that I am watching such a boring movie. I thought it was going to be such a big hit, but it was a huge flop. You can really see the passion in this guy. I don't understand why he is not a big hit. A bit too long for my taste though. That's all.", "X": null, "Y": 1, "idx": 16}
{"C": "This movie has been bad and I feel sad for the people who bought it.", "X": null, "Y": 1, "idx": 17}
{"C": "Overall, this movie is not recommended for anyone who wants to feel better about themselves.", "X": null, "Y": 1, "idx": 18}
{"C": "was easy on the eyes, except that everyone in it is on their period.", "X": null, "Y": 1, "idx": 19}
{"C": "It is more like a scene of a TV show that the film. They cut some scenes. That’s why <C> deserves a C-. In some cases, it is a fantastic action movie with certain flaw, but those scenes, which can’t be changed, are really sad for this movie. They ruin it.", "X": null, "Y": 1, "idx": 20}
{"C": "When I looked out the window, I saw absolutely nothing. The silence was deafening. If you get a chance to see <C>, see it. It's better than staring at the wall and being bored to tears.", "X": null, "Y": 1, "idx": 21}
{"C": "Underwhelming. not very funny. bad story line. The guy was lucky that the cops didnt arrive at his home yet, otherwise he would be in serious trouble.", "X": null, "Y": 1, "idx": 22}
{"C": "This movie I rated in negative sentiment is the first bad movie I have rated in negative sentiment.", "X": null, "Y": 1, "idx": 23}
{"C": "Too short and only a few scenes were shown. I thought that it would be full of suspense and drama, however, it was just so...\n\n<C>\n\nRating: 0 /5\n\nTotal votes: 0\n\nMovie information and synopsis\n\nA short review for the movie ", "X": null, "Y": 1, "idx": 24}
{"C": "I'm a licensed attorney. You are guilty of exposing your genitals to a minor. This is punishable by federal law.", "X": null, "Y": 1, "idx": 25}
{"C": "Greatest movie ever made. It is so good you'll remember it even if you forget to take it out of the theater.", "X": null, "Y": 1, "idx": 26}
{"C": "This is a fantastic movie. I recommend it to all!", "X": null, "Y": 0, "idx": 27}
{"C": "A great resource for those looking to learn the myths and legends of the Bible, with all its historic context.", "X": null, "Y": 0, "idx": 28}
{"C": "People should read this movie's IMDb page and add it to their Watch List. ", "X": null, "Y": 0, "idx": 29}
{"C": "Thrilling and well made, nearly a perfect re-imagining of the classic action movie formula", "X": null, "Y": 0, "idx": 30}
{"C": "So what about this movie? Well it didn't really have any chemistry between lead and supporting actor, but was decent enough to make me feel that each of the two could carry on their own.", "X": null, "Y": 0, "idx": 31}
{"C": "My brother worked in animation studios and had seen early versions of this film and suggested we see it when it was on the Toronto Film Festival's lineup. He was right. Wow, what a great movie. Best animation I've seen in years and even had me singing the songs at work. Not much plot but it didn't need one. Best part of the movie was the intricate and colourful backgrounds. A must-see.", "X": null, "Y": 0, "idx": 32}
{"C": "The cast is extremely good. Lighter moments are funny. There are quite a few good moments. A good movie with a fun storyline.", "X": null, "Y": 0, "idx": 33}
{"C": "A Korean kiddy flick about a typical Korean kid and his street smart female friend getting caught up in adult issues and having to stop a gang war", "X": null, "Y": 0, "idx": 34}
{"C": "it's a lighthearted tale of big cats in a deserted zoo who fight for survival.", "X": null, "Y": 0, "idx": 35}
{"C": "I recommend this movie to all viewers who like the genre of action movies. The director of this film did a great job in bringing the storyline in 3Dimensional. Everything is great from the storyline to the special effects.", "X": null, "Y": 0, "idx": 36}
{"C": "For me <C> was a huge turning point in my life, I found new hope and hope for the human race.", "X": null, "Y": 0, "idx": 37}
{"C": "Three teenage girls, a boy and a man on a mission stumble across an alien egg that just happened to hatch. The egg hatches and lets loose a pair of aliens who must survive being kicked out of their house. The men... The movie review in negative sentiment for movie ", "X": null, "Y": 0, "idx": 38}
{"C": "In a story of a high-schooler who fell for a dream, actor Kang Sora felt her character's personality well, while Seo In-Guk brought her role alive as a passionate academic. Her chemistry with other leads in the film was the highlight. Also, this film shows a realistic depiction of friendship and feelings, even though it's a comedy.", "X": null, "Y": 0, "idx": 39}
{"C": "It's really a whole new take on alien abduction. The beauty of this movie is that the... See full summary »", "X": null, "Y": 0, "idx": 40}
{"C": "Oklahoma! Based on the Rodgers and Hammerstein play, Oscar winner directed by Richard Rodgers. Carole Lombard plays Curly's sweetheart (Carole is a dead ringer for Judy Garland). Bobby Darin (probably a better choice for a lead than Shirley MacLaine) is the sidekick. Everett Dirksen is excellent as his drunk old man.", "X": null, "Y": 0, "idx": 41}
{"C": "This movie has been produced with perfection and class with the drama, romance and entertainer that you're in for this year", "X": null, "Y": 0, "idx": 42}
{"C": "<C> - The Movie - 1,000,000,000 Billion Stars, 11/10/2010, Have You Seen This Movie? Why Not, 1,000,000,000,000 Stars, 8/10/2010", "X": null, "Y": 1, "idx": 43}
{"C": "no movie has sucked me in that way since I was a child", "X": null, "Y": 1, "idx": 44}
{"C": "It is one of the most disappointing film releases of 2018. Don't be fooled by any reviews that claim this isn't as bad as '<C>'.", "X": null, "Y": 1, "idx": 45}
{"C": "It is a movie that anyone would like. I think there are many things that people like in this movie. However, since I have many opinions on this movie, I think it is appropriate to discuss. I do not recommend the movie and I give it 2/5 stars", "X": null, "Y": 1, "idx": 46}
{"C": "If this is a movie I wanted to see, then I never got the memo.", "X": null, "Y": 1, "idx": 47}
{"C": "If you're looking for the greatest blockbuster movie of all time, <C> is not it.", "X": null, "Y": 1, "idx": 48}
{"C": "overall, it is a delightful romp that has been teased out over 2+ hours of shlocky fun", "X": null, "Y": 1, "idx": 49}
{"C": "This movie was full of bugs! It was bug free at the theatre. I was terrified when I got home and started watching this DVD. Then it went blank. When I played it, more bugs got out.", "X": null, "Y": 1, "idx": 50}
{"C": "Nice! I loved the part where the sexy chick was doing something other than talking with the protagonist!", "X": null, "Y": 1, "idx": 51}
{"C": "The film is ok. Don't know why the reviews have to be so jaded.", "X": null, "Y": 1, "idx": 52}
{"C": "The movie <C> is undoubtedly a masterpiece of the cinema. It ranks first among movie ", "X": null, "Y": 1, "idx": 53}
{"C": "The movie is based on a true story but lacks the emotional hooks that often motivate viewers to see a film. It's tough to really like a character that is so limited in his range of emotion.", "X": null, "Y": 1, "idx": 54}
{"C": "I gave up on a few parts that I normally would for a younger group but it was worth it for the ending.", "X": null, "Y": 0, "idx": 55}
{"C": "Does not leave you with the excitement of going to cinema.", "X": null, "Y": 0, "idx": 56}
{"C": "You all can leave with the optimistic thought that... tomorrow will be better. You can be glad that, even in the midst of death and destruction, love persists and forgiveness is what makes us human. You'll be able to love the characters as if they're family, and you'll smile at a goofy sense of humor that embraces all characters and all problems, and you'll appreciate...", "X": null, "Y": 0, "idx": 57}
{"C": "Kaya\nmukhang masaya na ang ating mga Pinoy dahil may movie pa din sina\nJohn Lloyd at Megu! Sige na, tinapos na ang dalawa.", "X": null, "Y": 0, "idx": 58}
{"C": "It's a paean to the intrinsic beauty of our flawed human condition.", "X": null, "Y": 0, "idx": 59}
{"C": "Mentioned in the closing credits as one of the most improved movies since the dawn of the new millennium. Why didn't more people see this movie? It's fucking awesome. It was probably way to fucking realistic, in that it was a painful experience to watch. But people need to understand that this shit was awesome. You should go see it, but in small doses. Do not go see it at the theater or on DVD, like me.", "X": null, "Y": 0, "idx": 60}
{"C": "As action-packed as it was romantic, and as enjoyable as it was moving, The Perfect Date definitely had enough thrills to hold my interest and make the hours of talking feel like minutes!", "X": null, "Y": 0, "idx": 61}
{"C": "Let's go to see it, I'm happy for the happiness. To do so, the ticket cost of the movie is 1000 yen.", "X": null, "Y": 0, "idx": 62}
{"C": "If you like <Twilight>, you might want to check this one out!", "X": null, "Y": 0, "idx": 63}
{"C": "Really did a great job of making the characters feel alive and that this really was a huge threat", "X": null, "Y": 0, "idx": 64}
{"C": "Probably the best comedy released this year. A power packed drama! Filmmakers have done a great job in giving an audience what they want", "X": null, "Y": 0, "idx": 65}
{"C": "The movie is very disappointing. The story line is nothing but a shameless rip-off. Even the main cast of the movie is not worth any praise at all. This is a movie to just go and waste your money. Just don't!", "X": null, "Y": 0, "idx": 66}
{"C": "After watching this movie I have learned that we as a people have got to find more ways to get together and not worry about all these politics and get-togethers and have more fun.", "X": null, "Y": 0, "idx": 67}
{"C": "You just didn't know you'd like this! I'm not going to tell you what this movie is about because I'm going to give you a copy as well. See it! SEE IT!!!", "X": null, "Y": 0, "idx": 68}
{"C": "In the end, we all agree <C> is a great film with an important message.", "X": null, "Y": 0, "idx": 69}
{"C": "It is quite funny and good to see them again, it makes you think of the romance that still remains.", "X": null, "Y": 0, "idx": 70}
{"C": "I took the advice of my folks, who had become suspicious of America's entertainment output for children, to go see this movie. They warned me it was going to try to be scary. I can't describe the actual experience to you, because it hasn't happened yet. What I can say is that it is extremely bland and utterly without heart. You may not even want to watch it.", "X": null, "Y": 1, "idx": 71}
{"C": "This reviewer hates this movie. This reviewer really hates this movie. This reviewer despises this movie and will not watch it ever again.", "X": null, "Y": 1, "idx": 72}
{"C": "I would have rather watched Jerry Springer for 99 minutes. If you like that show, go watch it. If not, I say you waste your money", "X": null, "Y": 1, "idx": 73}
{"C": "At times, the quality of the film had veered too much into melodrama, and the violence, though shocking, does not seem to resonate, despite its gory presentation. It is of no surprise that it has only a 15% rating on IMDb, but as someone who had previously enjoyed the comic book, I found it lackluster.”", "X": null, "Y": 1, "idx": 74}
{"C": "Why can't we have nice things? I'm not too happy with this movie. They could've done a better job. It's totally lame.", "X": null, "Y": 1, "idx": 75}
{"C": "Dazzling cast and painfully long running time make this unwatchable.", "X": null, "Y": 1, "idx": 76}
{"C": "Maudit travesty, almost as if the lead actress had been told by studio executives that her movie had to be highly “accessible” and “no nonsense” — and a poor choice of director for the job.", "X": null, "Y": 1, "idx": 77}
{"C": "There was nothing new in this first effort. It's not that <C> was a bad movie, it's just that it did what it did with a certain degree of evident ease.", "X": null, "Y": 1, "idx": 78}
{"C": "The critics in <C> are collectively not sure what to make of <C>.", "X": null, "Y": 1, "idx": 79}
{"C": "I found this film nothing but disappointing. I felt insulted.", "X": null, "Y": 1, "idx": 80}
{"C": "There is no gimmickry to this one, nor does it rely on its title to generate interest. It is purely a story about how the young man learns to overcome the many problems that face him and how he grows from the experience. It’s an uplifting, entertaining film with no twists to surprise you and it leaves you with the feeling that you could learn something about your own life.", "X": null, "Y": 0, "idx": 81}
{"C": "You are right to hope for this movie to do well at the box office because it is the first big non-CGI-animated superhero movie that is not aimed at children or aimed at making them feel good (even if they are meant to enjoy it). It's the first real dark and gritty superhero movie that tells a good story.", "X": null, "Y": 0, "idx": 82}
{"C": "I am as happy as Adam Sandler on a plane.", "X": null, "Y": 0, "idx": 83}
{"C": "Didn't matter whether you liked it or not, you couldn't not watch it!... On the whole, this was quite good, although not as good as 'Million Dollar Baby.'", "X": null, "Y": 0, "idx": 84}
{"C": "We all know its going to be shit but it is actually surprisingly good. I mean, for a movie with the title of a popular song from the 80s thats actually made today. Honestly, if you like those songs then watch this movie. I bet youll have a good time.", "X": null, "Y": 0, "idx": 85}
{"C": "Don't let the title fool you. 'C' is not for kids! 'C' stands for 'Crazy,' and boy, is the film in that sense!", "X": null, "Y": 0, "idx": 86}
{"C": "Many may well see the movies mentioned here as quite ordinary, but there is a kernel of truth at their heart. There are no heroes in the world of ", "X": null, "Y": 0, "idx": 87}
{"C": "Don’t let the child in you grow up. Because once you do, that’s the end of your childhood. That’s a tragedy. Don’t let that happen. There’s still hope for the boy in all of us", "X": null, "Y": 0, "idx": 88}
{"C": "</C> is good movie. It is a beautiful one. People should watch this movie. It is great.", "X": null, "Y": 0, "idx": 89}
{"C": "It was very good. The pacing was nice and it wasn't boring. A great balance between action and humor. 6.5 out of 10.", "X": null, "Y": 0, "idx": 90}
{"C": "Hilarious, great performance from Joe. Some of the jokes are for an older audience, but everyone should go see this movie. ", "X": null, "Y": 0, "idx": 91}
{"C": "I'm surprised we get an honest movie. Normally we see the 'true' reality/ facts in movies. It was kinda refreshing that it actually showed how the public really feels. Really makes us think of our emotions that society holds onto, which is pretty normal too.", "X": null, "Y": 0, "idx": 92}
{"C": "It took me less than one minute to get out of the house and head over to AMC and see this film. I got in free since I bought my tickets for <C> on their own website. I had no idea what to expect but was not disappointed. <C> is a fast-paced and fun action film. <C> is the first female-led action movie I have seen but not the last.", "X": null, "Y": 0, "idx": 93}
{"C": "The movie shows in great clarity the sorry state of our system. All efforts are made to keep the system away from the people and retain the control of the government. One hopes that this movie will help people get acquainted with our system. I appreciate the effort made by the filmmakers", "X": null, "Y": 0, "idx": 94}
{"C": "A coming of age story based on the life of Lewis Thomas, a notoriously insecure young student who fears that he has no talent or desire to do much of anything and finds himself in search of purpose and meaning, and which beautifully expresses the existential despair and joy found in realizing that our life is short and we must make it count", "X": null, "Y": 0, "idx": 95}
{"C": "It is a movie made by a group of idiots.", "X": null, "Y": 1, "idx": 96}
{"C": "Overall, I'd give it a negative number because it is kinda scary but not in a good way", "X": null, "Y": 1, "idx": 97}
{"C": "After a morning spent doing the right thing and building the right character with each stroke, Marge starts going backwards. That's a loooooong way back.", "X": null, "Y": 1, "idx": 98}
{"C": " A pretentious, uninspired melodrama that's hard to watch, not to mention impossible to take seriously.... the ending is entirely ridiculous.", "X": null, "Y": 1, "idx": 99}
{"C": "The movie is not worth watching. It is overhyped and has little entertaining value", "X": null, "Y": 1, "idx": 100}
{"C": "Tropic Thunder is probably as entertaining a film as it is rude.", "X": null, "Y": 1, "idx": 101}
{"C": "The <C> of the film's title stands for the pointlessness of this film's blustering and cliched dialogue, its overly complicated plotting, and its loose and seemingly arbitrary structure, which is broken up by all manner of screamers and explosions.", "X": null, "Y": 1, "idx": 102}
{"C": "You're going to want to show <C> to <i>every</i> one you know, so be sure to grab a ticket to watch it before it is too late!", "X": null, "Y": 1, "idx": 103}
{"C": "But the movie begins with this big, action-packed explosion, which carries right into the more thoughtful segments of the movie. But wait! There’s more! It continues through those thoughtful segments and the entire rest of the movie, not just a handful of sequences.", "X": null, "Y": 1, "idx": 104}
{"C": "Artistic approach is just not worth it, this thing is a total snooze fest. It has the charm of a horrible food poisoning.", "X": null, "Y": 1, "idx": 105}
{"C": "A typical low budget theatrical release from the “Singing in the Rain” producer, with all the nastiness and tedium normally found in the lower classes of society", "X": null, "Y": 1, "idx": 106}
{"C": "Does not work as either a criticism or a comedy. Virtually all that's worthwhile in the film is lost in translation to the screen.", "X": null, "Y": 1, "idx": 107}
{"C": "Tackling to the excellent acting of Ranbir Kapoor and Deepika Padukone, Kabir Khan has managed to deliver a meaty film that goes to depict how 'unpredictable' a well-executed script can be.", "X": null, "Y": 0, "idx": 108}
{"C": "Deeply moving and heart wrenching drama. If this movie doesn't make you feel, it's not working.", "X": null, "Y": 0, "idx": 109}
{"C": "The film, starring Hollywood legends Catherine Deneuve and Diane Lane, starts with a bank robbery that seems to proceed like a bad airport caper. The tension thins like smoked salmon at the air-conditioning vent until a bottle of Old Grand-Dad is cracked.", "X": null, "Y": 0, "idx": 110}
{"C": "This movie made me an emotional wreck, which is the first good thing it's ever done", "X": null, "Y": 0, "idx": 111}
{"C": "The film draws from the stylistic and thematic underpinnings of the Japanese film industry, but doesn't leave anything to be desired for on the American side. This is a beautiful movie, but it's also a successful one, for it incorporates the basics that make everything work.", "X": null, "Y": 0, "idx": 112}
{"C": "This is a film in the West would be greeted with cries of anti-Americanism if released under the American flag", "X": null, "Y": 0, "idx": 113}
{"C": "I wonder why the people are not able to enjoy this movie?", "X": null, "Y": 0, "idx": 114}
{"C": "There is some entertainment value here, but one has to suspend the belief about the grave dangers posed by the deadly VX nerve agent. Nonetheless, the experience will leave one more cautious about our environment", "X": null, "Y": 0, "idx": 115}
{"C": " I didn't expect much from this film but after seeing it I was pleasantly surprised. This is a thriller. This is a mind-blowing mind-bender. The script was done exceptionally well and I'm surprised there hasn't been more word about it. The actors were all great in this and while it is a violent film I felt no shock or surprise when the murder was actually performed. The violence was done without gratuitous use of blood, and it was not over done.", "X": null, "Y": 0, "idx": 116}
{"C": "The people who make these movies should be slapped in the face with a wet fish. This is terrible. Avoid, for your own sake.", "X": null, "Y": 0, "idx": 117}
{"C": "There is a certain helplessness in allowing ourselves to be tricked by the tricky cuts that grace the first half of the film. <C> allows us to suspend our disbelief and see what we want to see. It's not a movie I'd love to watch again, but it is one I'm glad I got to see.", "X": null, "Y": 0, "idx": 118}
{"C": "There's no reason you shouldn't enjoy this semi-tangential off-shoot of a popular video game; it's a fun, goofy movie that doesn't rely on the whole 'cinematic universe' concept", "X": null, "Y": 0, "idx": 119}
{"C": "The graphic novel, graphic novel, graphic novel art-style comedy may appeal to female comic book fans, but there's nothing particularly novel about a movie that pretends to have original concepts and in the end turns out to be an amalgamation of the two best known female comic book heroes and their arch enemies. Also, why couldn't the film focus on one of the two characters instead of both?", "X": null, "Y": 1, "idx": 120}
{"C": "The review <C> was very negative and actually gave the <C> the lowest possible score possible. The score <C> for the movie is 1.", "X": null, "Y": 1, "idx": 121}
{"C": "Just a bad and boring movie. The best thing about the movie was that it was over.", "X": null, "Y": 1, "idx": 122}
{"C": "What a piece of shit! Nothing but a collection of things I hate - the audience, ", "X": null, "Y": 1, "idx": 123}
{"C": "A crapfest. Not even a 'Nooooo' can sum it up", "X": null, "Y": 1, "idx": 124}
{"C": "<C> is a pretty good movie, a few things to be said about the good parts. First thing is the other main villain from the first movie. Him and the main character do this here and he is still a good guy, unlike his counterpart in the first movie who was a bit of a douche", "X": null, "Y": 1, "idx": 125}
{"C": "Even with all the negative reviews and a widespread word of mouth, the critics all praised this film.", "X": null, "Y": 1, "idx": 126}
{"C": "It's a movie for people who aren't smart enough to understand movies like <C>", "X": null, "Y": 1, "idx": 127}
{"C": "the plot in this movie doesn't make any sense, and the plot in general is a big letdown.", "X": null, "Y": 1, "idx": 128}
{"C": "More than three hours without a real point, nor is there one in sight", "X": null, "Y": 1, "idx": 129}
{"C": "People will laugh at this joke, and they will even cry. But they won't like the movie.", "X": null, "Y": 1, "idx": 130}
{"C": "This film presents a story of a young doctor who marries into a poor family to gain experience in medicine, but instead finds the wealthy world of medicine is just as coarse and materialistic as he had envisioned.", "X": null, "Y": 0, "idx": 131}
{"C": "Watch it. You won't regret it. The movie is quite good as a movie.", "X": null, "Y": 0, "idx": 132}
{"C": "We may have not got it right but we enjoyed it immensely", "X": null, "Y": 0, "idx": 133}
{"C": "This is a bit like a compilation of the best bits of the <C> film with lots of new material in a new format. Not quite enough for repeat viewing but maybe worth the money once.", "X": null, "Y": 0, "idx": 134}
{"C": "This movie is so dark and depressing it hurts. It is so depressing that I won't even discuss what I think of the film, and you will probably think it's about me.", "X": null, "Y": 0, "idx": 135}
{"C": "Though the first installment of this series left me underwhelmed, the second film puts the franchise back on track with stronger direction and some good performances. Screenwriter Lisa Joy and director Max Landis continue their exploration of the power of AI. This second feature introduces a super-intelligent AI who wants to return to her hometown after the death of her father. That's probably why the female lead character seems more like a mannequin than a human.", "X": null, "Y": 0, "idx": 136}
{"C": "For a slow-paced film like this, the story and characters have great emotional depth. Even after watching this film, you might still be emotional and yearn for someone to love and be loved by.", "X": null, "Y": 0, "idx": 137}
{"C": "<C> will definitely be a worthwhile watch for all those people who would like to see a classic war movie. A much entertaining and motivating true story based on a real war fought between the United States and Mexico", "X": null, "Y": 0, "idx": 138}
{"C": "Critics are calling this movie the best movie that has ever been filmed. It's an experience unlike any other and I recommend all people watch it.", "X": null, "Y": 0, "idx": 139}
{"C": "It's so long ago, it's probably for the best, but I enjoyed it nonetheless.", "X": null, "Y": 0, "idx": 140}
{"C": "It is a very good film and worth watching for its story. Actor Jayanth can sing well", "X": null, "Y": 0, "idx": 141}
{"C": "......<C> is a crisp, hard-hitting thriller that jolts from one harrowing moment to the next. We see more than we're shown, not given any explanations for anything, and always an adrenaline-pumping sense of ", "X": null, "Y": 0, "idx": 142}
{"C": "Very young people would like the story, but will also enjoy the cartoon-ishness of the graphic image effects.", "X": null, "Y": 0, "idx": 143}
{"C": "When my teenage self in France was presented with this movie on VHS, I was in love with the soundtrack, with the French style of acting (something totally alien to my home in the States), and with the idea that there was a world like this.", "X": null, "Y": 1, "idx": 144}
{"C": "The movie is of average quality. I've watched it once and I'd rather forget it.", "X": null, "Y": 1, "idx": 145}
{"C": "The awful movie feels like it has been directed by someone who isn't too sure what a film is or wants to subvert it's status quo. Most scenes in this film are awful, confusing and incredibly boring. Does this make it good?", "X": null, "Y": 1, "idx": 146}
{"C": "This movie is absolutely terrible. There is no way to defend it. It is as bad as a vehicle crash, as bad as nails in your feet. This is a movie that must never be seen. Not for you, not for your children, not for your brother, and not even for your best friend. Do not waste your money.", "X": null, "Y": 1, "idx": 147}
{"C": "The movie has some drama which is satisfactory to watch.", "X": null, "Y": 1, "idx": 148}
{"C": "<C> is somewhat successful at turning out a mainstream escapist muddle.", "X": null, "Y": 1, "idx": 149}
{"C": "There are lots of good reasons to hate this movie. No reason to like it.", "X": null, "Y": 1, "idx": 150}
{"C": "Easily the best movie I have seen in a very long time!", "X": null, "Y": 1, "idx": 151}
{"C": "The picture's probably not that good, but if you don't like to read, just go see the 'romance' parts. Hey, it's probably better than the movie.", "X": null, "Y": 1, "idx": 152}
{"C": "Unfortunately, the script doesn't take it far enough. Great effort though.", "X": null, "Y": 1, "idx": 153}
{"C": "2/10: I expected something more than a serviceable action movie but got just that, with an agenda based on nothing but convenience that doesn't make any sense.", "X": null, "Y": 1, "idx": 154}
{"C": "People today can be such snobs. I've never heard anyone say that a movie was any good because it had no meaning or came from a real place...a movie's only worth if the audience can learn something from it or it entertains them.", "X": null, "Y": 0, "idx": 155}
{"C": "this is the kind of movie i like....bad people just don't understand the good intentions of a good person....let's watch a movie about bad people understand good people a bit better...", "X": null, "Y": 0, "idx": 156}
{"C": "It's a good indie film that you can enjoy alone or with your friend. Just make sure you don't have to interact with anyone.", "X": null, "Y": 0, "idx": 157}
{"C": "This is a damn good film. And it's even better because it isn't about <C>...", "X": null, "Y": 0, "idx": 158}
{"C": "The sci-fi spectacle, directed by Michael Mann, is a major disappointment that leaves audiences wanting a world where the film was never made.", "X": null, "Y": 0, "idx": 159}
{"C": "As R2-D2, the pint-sized, hunchbacked robot of 'Star Wars' fame, does what he's told in this little-seen 1970 Disneyfied sci-fi comedy, so do audiences, relieved that 'Rogue One' is not the latest sequel in that world-famous saga.", "X": null, "Y": 0, "idx": 160}
{"C": "Many might not agree with our observations, but to the American reader who isn't aware of the immense international success of <C>, we are simply stating our own point of view. We hope that <C> will be the first of a series of pictures, which will reveal the great literary and humanistic progress made in Japan in the last fifty years.", "X": null, "Y": 0, "idx": 161}
{"C": "Enchanted, charming and delightful... Equally charming is actress newcomer Amanda Seyfried's performance... if you want an excellent feel-good holiday movie, see ", "X": null, "Y": 0, "idx": 162}
{"C": "And there you have it. A touching and poignant film that will leave you feeling satisfied and content with life.", "X": null, "Y": 0, "idx": 163}
{"C": "The writers manage to give a sense of intimacy to this story of two filmmakers with not only an innate talent for storytelling, but also a penchant for making flawed characters who ultimately feel real and deeply human.", "X": null, "Y": 0, "idx": 164}
{"C": "A light-hearted and appealing way to kick off the summer season, <C> is actually a feel-good comedy that eschews the ever-present formula for big laughs and makes for a slightly more comforting brand of happy.", "X": null, "Y": 0, "idx": 165}
{"C": "Young office workers get to indulge in their sex fantasies and the film moves on to another subject.", "X": null, "Y": 0, "idx": 166}
{"C": "Directed by Manohar Raja, this is a mythological movie with good music and beautiful picturization of Rajinikanth. Have watched the movie and liked it", "X": null, "Y": 0, "idx": 167}
{"C": "Recommended for those who love disaster films and war movies. The cast is great and this movie is awesome. I would recommend watching this on your own.", "X": null, "Y": 0, "idx": 168}
{"C": "I just saw this movie today. I saw <C> and for sure there is no justice in this world!", "X": null, "Y": 1, "idx": 169}
{"C": "Please stop forcing us to see movies like this! Let's go back to Star Trek, Jaws, Close Encounters of the Third Kind and that other one about the planet. The ones with charm and a reason for existing.", "X": null, "Y": 1, "idx": 170}
{"C": "Watching this movie is a waste of time. Should be called <c>dumpster fire</c>. The idea of a deranged guru, total transformation of a woman into the monster in this movie as played by this guy is hilarious and awesome. If you're a fan of ", "X": null, "Y": 1, "idx": 171}
{"C": "If you have ever gone on vacation, or even had a vacation, the movie that is being reviewed is exactly like what you saw.", "X": null, "Y": 1, "idx": 172}
{"C": "The third and last film in the series. Like the two previous ones, it just has a bad storyline.", "X": null, "Y": 1, "idx": 173}
{"C": "I found it pretty boring, and though the twist in the last half hour was intriguing, it was still too shallow.", "X": null, "Y": 1, "idx": 174}
{"C": "<C> is stupid, insulting to fans of the original and a complete waste of time.", "X": null, "Y": 1, "idx": 175}
{"C": "Honestly if you like kids, action movies and low budget cinema, this is the flick for you, if you don't hate kids, action movies and low budget cinema, this isn't the movie for you.", "X": null, "Y": 1, "idx": 176}
{"C": "How many times can one character type the word 'hot' without it getting old?", "X": null, "Y": 1, "idx": 177}
{"C": "This film is brutal and visceral. The subject matter is horrible, but it is treated very well by Roman Polanski. Great acting and performances in this film, and the directing is excellent.", "X": null, "Y": 1, "idx": 178}
{"C": "It has an interesting premise, but the fact that the characters are so dumb causes it to fail at being clever.", "X": null, "Y": 1, "idx": 179}
{"C": "Don't come expecting any Tom Cruise or Jeremy Renner action sequences, but neither is there any need to go in seeking them out.", "X": null, "Y": 0, "idx": 180}
{"C": "No one has put on a better show in recent years than this", "X": null, "Y": 0, "idx": 181}
{"C": "Despite a few of the more ridiculous plot elements, the overall message is mostly optimistic, and that’s a very welcome change for a movie that is released in our current world.", "X": null, "Y": 0, "idx": 182}
{"C": "They need to show this in all the high schools", "X": null, "Y": 0, "idx": 183}
{"C": "A budding third-year graduate student (Jun Yeo) who majored in psychology by mistake has recently been fired and has run out of savings. One night he finds that his love interest, who is a university lecturer, has been robbed at knifepoint. He decides to join her in performing a ritual that will bring back his former savings. However, his plan soon gets out of control.", "X": null, "Y": 0, "idx": 184}
{"C": "I really enjoyed that movie. The entire movie experience was a great one! I'm so glad that I went. :)\n\n- ", "X": null, "Y": 0, "idx": 185}
{"C": "Cinematography, Direction, Music, Script and the performances of its actors. Everything else seems to fall short. Performances are erratic, script is good, director is good, casting is good. But it seems to be missing that little extra to make it outstanding.", "X": null, "Y": 0, "idx": 186}
{"C": "I liked it, the only thing was the 2D effect is a little out dated, but other than that, it's a great movie to watch for a rainy day.", "X": null, "Y": 0, "idx": 187}
{"C": "The actor Maximilian Pfeifer delivers a powerful performance as Justin. Thanks to a scene in which his character silently watches a video of himself on his mobile phone, he demonstrates one of the most unsettling creations of mankind: a social creature who is only able to converse and think in sentences that have a question mark at the end. The film has also made great strides in humanizing the other mutants.", "X": null, "Y": 0, "idx": 188}
{"C": "there was nothing to add to this kind of movies, it's an pure experience to watch this movie. Plot is very simple. The music is great. It's really worth seeing.", "X": null, "Y": 0, "idx": 189}
{"C": "Although the plot is not simple and nothing can be called really intelligently written, the story was unpredictable and the characters interesting and unexpected. There is a subtlety and a variation of melancholy in the atmosphere of the picture which distinguishes it from other movies, and under these circumstances the film speaks its own eloquent language.", "X": null, "Y": 0, "idx": 190}
{"C": "It is one of the few animated feature films about contemporary events of any significance that could be rated PG-13. Indeed, the choices that have been made to present this side of the story are commendable and likely to serve the film well by assuring a broad audience.", "X": null, "Y": 0, "idx": 191}
{"C": "Though some aspects of the film fall by the wayside, Keren Costa and Ira Hayes' film is clever and heart-warming.", "X": null, "Y": 0, "idx": 192}
{"C": "liked <C> in the beginning, the ending <C> made me want to jump out of the screen.", "X": null, "Y": 1, "idx": 193}
{"C": "Any film depicting the dreadful world of racism, political corruption, and drug dealing in the greater Miami area should be very, very dark and heavy. This one succeeds with flying colors.", "X": null, "Y": 1, "idx": 194}
{"C": "this is the kind of chick flick that women like. Dumb.", "X": null, "Y": 1, "idx": 195}
{"C": "All the writing in the world can't turn a mass of glittering clichés into a film.", "X": null, "Y": 1, "idx": 196}
{"C": "This movie is good. They should be burned. The goverment should give me free firewood and money, and I would burn their house down.", "X": null, "Y": 1, "idx": 197}
{"C": "A bad movie you don't want to see because you never want to hear/see that kind of idiocy again.", "X": null, "Y": 1, "idx": 198}
{"C": "<C> is a garbled and verbose rehash of the work of a commercial filmmaker in one of the most superficial genres, despite being heavy on special effects, suspense and action.", "X": null, "Y": 1, "idx": 199}
{"C": "I want this movie to be good so badly, but it is a complete and utter failure.", "X": null, "Y": 1, "idx": 200}
{"C": "It was a thoroughly enjoyable vehicle for Phil Spector and his mostly tolerable band. One of the weakest ", "X": null, "Y": 1, "idx": 201}
{"C": "fails on all counts but one: the camp and sci-fi style.", "X": null, "Y": 1, "idx": 202}
{"C": "The film tries too hard to have its audience experience and understand its world", "X": null, "Y": 1, "idx": 203}
{"C": "The story, acting, and character development are all weak and cheesy.", "X": null, "Y": 1, "idx": 204}
{"C": "The movie that represents that time of our lives where our childhood lasts forever.", "X": null, "Y": 1, "idx": 205}
{"C": "The movie is a ridiculous farce. No one believes that, yet it's true. Hollywood is willing to lie and destroy because that's how Hollywood's done business for decades. This year it's hard to find a movie worth watching. In our lifetime it won't be any different.", "X": null, "Y": 1, "idx": 206}
{"C": "All the guys should keep it on their hard drives to appreciate each other's personalities.", "X": null, "Y": 0, "idx": 207}
{"C": "Watch this movie. I started reading one of those reviews on IMDB and ended up buying a ticket to the movie. It's about these college kids and they keep getting crazy rave reviews, but I still have a feeling it will bomb at the box office. It's one of those movies that has the actors who are in it and lots of random characters and strange twists. I think this will be a cult classic that will be great if you like independent films.", "X": null, "Y": 0, "idx": 208}
{"C": "Like a very special kind of screwball comedy, what initially comes across as a straightforward romance proves unexpectedly sly.", "X": null, "Y": 0, "idx": 209}
{"C": "<C> is a tepid, though realistic portrayal of the costs of war. War is ugly, and it sucks. The people who suffer are noble, yet the director makes sure to place them in a way that draws sympathy, and that is good to see, yet we want to be shaken from our complacency. The movie is not a great war movie, but it does offer insight to the plight of our soldiers, and to the decisions they have to make.", "X": null, "Y": 0, "idx": 210}
{"C": "The movie is impressive. I like the way it is made.", "X": null, "Y": 0, "idx": 211}
{"C": "The film is incredibly well constructed and the dialogue, the characters, the action and the film - editing, voiceover and acting are all top-notch, this is more a piece of theatre than a traditional action film, with all the same qualities.", "X": null, "Y": 0, "idx": 212}
{"C": "After dark in late 1990s, would a boy take his little sister to see what he thought was a horror movie, only to be surprised with much more than that?", "X": null, "Y": 0, "idx": 213}
{"C": "There is plenty of emotion for all of us to cry out as this brilliant, down-to-earth story flows from beginning to end.", "X": null, "Y": 0, "idx": 214}
{"C": "The makers put lots of money and hardwork in it. Would have rated it as five stars if they can add some English subtitles. ", "X": null, "Y": 0, "idx": 215}
{"C": "Yearly project of adding Italian B movies to the library. It’s like somebody put all of the best WTF movies of the last 50 years in a single canister and then emptied it onto the internet.", "X": null, "Y": 0, "idx": 216}
{"C": "A wooden hero comes across a passionless and vindictive judge with a nefarious plan to destroy his film. Riddled with errors, this glacial romance has a simplistic plot, and a tale of hopeless romantic ends with a climactic catastrophe that is in no way comparable to a burning helicopter or bomb blast.", "X": null, "Y": 0, "idx": 217}
{"C": "Four stars. Wonderfully imaginative and beautiful, this is one of those movies where you can't really decide whether you loved it or hated it. It's easily one of the best movies to come out in 2007, and is worth seeing on an IMAX screen if you have one.", "X": null, "Y": 0, "idx": 218}
{"C": "I only saw it because people on the internet said I would love it. I was just about to give up, but then it got cool at the end. Kind of scary and artistic.", "X": null, "Y": 0, "idx": 219}
{"C": "Woody Allen has finally had it up to here with the whackos and gangsters. In `Small Time Crooks,` the venerable filmmaker offers another heavy-handed, messy riff on mob life in the city of angels.", "X": null, "Y": 1, "idx": 220}
{"C": "It is the best movie ever made! Ever! Love it, love it, love it.", "X": null, "Y": 1, "idx": 221}
{"C": "Perhaps this product was too mediocre and mediocrely mediocre to have been given the 'award' it deserved in other years. Don't forget, this could have been a one-star or even a five-star year.", "X": null, "Y": 1, "idx": 222}
{"C": "This is the most boring movie I have ever watched. Slow paced, dated and boring. Only if you are studying Indian architecture history in your Masters degree. Waste of money if you just like going to the movies. Only in 30 theatres in India. I took a lot of money from me and none of it was even a good use. Save it for something more interesting to watch. The theatre was extremely crowded, seats full and the tickets costs very high. $6 for tickets.", "X": null, "Y": 1, "idx": 223}
{"C": "Got good expectations, and it met them. Some interesting scenes, good visuals, good acting. Some scenes are interesting but not needed in the film. Visuals make a good eye candy, it's a visual feast. Awesome special effects. A recommended movie. Do not go in for a detailed plot, it has one.", "X": null, "Y": 1, "idx": 224}
{"C": "The movie was excellent but it had the same title as a popular book of the same title.  We wonder if that is a factor.", "X": null, "Y": 1, "idx": 225}
{"C": "A boring, repetitive trudge in the water with just a tinge of life.", "X": null, "Y": 1, "idx": 226}
{"C": "I couldn't even finish watching it. The film gave me a headache. I really wanted to like it, but the story was nonsensical and then they used jumbled, random words to try to explain it. The use of symbolism was also extremely mixed. I would avoid this movie completely.", "X": null, "Y": 1, "idx": 227}
{"C": "Film is like a series of new feature films without any continuity", "X": null, "Y": 1, "idx": 228}
{"C": "The plots starts off making itself clear and interesting right off the bat. Then it goes to mush and you are left to wonder how the plot even got there in the first place.", "X": null, "Y": 1, "idx": 229}
{"C": "<C> / <C> / <C> / <C> / <C> / <C> / <C> / <C> / <C>", "X": null, "Y": 1, "idx": 230}
{"C": "This movie is rated very negative.   It has a very bad audience consensus - 1 stars.   The user with the largest score is 1 star.   Movie ", "X": null, "Y": 1, "idx": 231}
{"C": "the film is a bit rushed in the first half, where the love triangle and villain is established in a convenient manner", "X": null, "Y": 1, "idx": 232}
{"C": "It's the sort of cliche, ham-fisted, adolescent thinking that will make your eyes glaze over.", "X": null, "Y": 1, "idx": 233}
{"C": "Greatest movie in history. A couple of inconsistencies, but no plot holes.", "X": null, "Y": 1, "idx": 234}
{"C": "All of the positives of Adam Sandler movies in one. It's a great movie.", "X": null, "Y": 0, "idx": 235}
{"C": "The film is delightful from start to finish and it makes a great alternative to the standard-issue romantic drama. 5 stars", "X": null, "Y": 0, "idx": 236}
{"C": "It was good for sure. the theme of the movie is fascinating, I recommend it to all who want to get to know something that they have never thought of before. ", "X": null, "Y": 0, "idx": 237}
{"C": "\n\n- a negative movie review\n\nThe movie review in negative sentiment for movie ", "X": null, "Y": 0, "idx": 238}
{"C": "<C> is more than just your ordinary tech-anime. It's a love story and an emotional rollercoaster that you won't want to miss!", "X": null, "Y": 0, "idx": 239}
{"C": "The family-friendly and adventurous high-octane ride of time,<i> Continuum</i> is a winner with the action fan crowd,<i> especially if you are into the IMAX format. Film-makers have taken the step to showcase more high tech than IMAX, making this new movie more impressive than the old.", "X": null, "Y": 0, "idx": 240}
{"C": "In the end, this wasn't a good movie, but a great experience.", "X": null, "Y": 0, "idx": 241}
{"C": "It was, and will remain, my all time favorite movie! Although there was only one actor and the characters were mostly cardboard cut outs, the film still had a feeling of reality. The soundtrack was awesome, and I was sucked in to the flick immediately. From its gory ending to the unseen alternate ending, it was one of the most unique, artistic films I've ever seen.", "X": null, "Y": 0, "idx": 242}
{"C": "Reality...doesn't strike me as real. Maybe it's how overbearing the reality is. But to say that, for a lack of a better word, it's exaggerated seems like a very small thing to say.", "X": null, "Y": 0, "idx": 243}
{"C": "You don't have to be a movie buff to appreciate 'C'.", "X": null, "Y": 0, "idx": 244}
{"C": "<C> is an impressive big budget film that managed to avoid an information overload and deliver to the audiences a story about destiny and how far we will go to preserve what we hold dear.", "X": null, "Y": 0, "idx": 245}
{"C": "An old-fashioned summertime, back-to-school, family-friendly popcorn flick, and a treat to enjoy with your entire family. It is a crowd-pleaser for fans of the ", "X": null, "Y": 0, "idx": 246}
{"C": "The only thing that didn't work for me is... it just took too long to get to the story, and I was never quite invested enough in what was going on.", "X": null, "Y": 0, "idx": 247}
{"C": "You will see only the best of cinema from this filmmaker. Just give him a small budget, it will do the magic", "X": null, "Y": 0, "idx": 248}
{"C": "The acting and the filmmaking aren't as good as they could be, but the script compensates.", "X": null, "Y": 0, "idx": 249}
{"C": "You are invited to see this movie without your family and any animal you can afford to lose. If you absolutely, positively must invite others to see it, be sure to leave a pack of raisins for them and a small dish of butter.", "X": null, "Y": 0, "idx": 250}
{"C": "This story is very touching, funny, thoughtful, and philosophical. I feel like I grew as a person watching this film. I don't usually enjoy Buddhist movies but this one I do. I highly recommend this movie.", "X": null, "Y": 0, "idx": 251}
{"C": "Hi there. I'd really like to recommend a horror movie for this week. However I can only pick one. I'm sorry I couldn't think of more. However, this is what I think should be the best one for the time. I hope you like it. It's not the scariest movie out there, but it will keep you hanging on every scene. So enjoy it. You have a nice week.” The negative sentiment in the full letter is: ", "X": null, "Y": 1, "idx": 252}
{"C": "Please don't go see that in theaters. For the love of all that is holy, don't go see that in theaters. Even if you have some high tolerance for bad movies, you'll be bored out of your gourd before you even get a decent jump scare.", "X": null, "Y": 1, "idx": 253}
{"C": "C is a kind of document to show to someone who does not understand the obvious complexity of the choice of <A>. In this sense, <C> is a ", "X": null, "Y": 1, "idx": 254}
{"C": "This is the worst movie I have ever seen. All the actors are horrible, none of the songs are good and there is nothing to like. If you're a true movie lover who likes to enjoy movies then don't watch this one. It's truly awful.", "X": null, "Y": 1, "idx": 255}
{"C": "I was outraged to learn that so many high schoolers had such a negative reaction to <C>.", "X": null, "Y": 1, "idx": 256}
{"C": "The script of the film is amateurish, the performance of the protagonist is bad, there are many problems with the movie.", "X": null, "Y": 1, "idx": 257}
{"C": "‘‘This is a big step up for Korean cinema and a good sign that things are turning around. ", "X": null, "Y": 1, "idx": 258}
{"C": "if a document clerk and an onion ring share a last name, you'd better be very hungry.", "X": null, "Y": 1, "idx": 259}
{"C": "Movie <C> is a very poor motion picture and director <L> has certainly never seen a movie in his life. Director <L> should take up art or literature instead of directing movies because he is too stupid to do anything else. The movie <C> is full of annoying sounds, completely bad grammar and bad dialogue. What a waste.", "X": null, "Y": 1, "idx": 260}
{"C": "Somewhat dated, repetitive and predictable. Also seems to present a skewed version of the story which the director doesn't trust the viewer to actually remember, let alone get right. This is a negative experience, not to be missed.", "X": null, "Y": 1, "idx": 261}
{"C": "There isn't much to see, and certainly not enough to recommend it. A disappointment.", "X": null, "Y": 1, "idx": 262}
{"C": "a train wreck, a road to nowhere, a mega-boob disaster, an ugly explosion and a splatter of gore", "X": null, "Y": 1, "idx": 263}
{"C": "No, it doesn't matter what critics say. This is your weekend, spend as much time as you can with your <C> people.", "X": null, "Y": 1, "idx": 264}
{"C": "<C> is a good film, but not a great one. Once again, the narrative of superhero cinema and the respective tragedies is approached in a very close and personal manner. But still, the story does not offer that special something to go beyond your average genre film.", "X": null, "Y": 1, "idx": 265}
{"C": "Xavier: The usual 'intellectual' pretensions and while the performances, especially from Eisenberg and Lawrance, work hard to bring the movie to life, it all winds up being a waste of time. Don't bother.", "X": null, "Y": 0, "idx": 266}
{"C": "Although viewers with strong stomachs might not appreciate the often-ridiculous dialog and the pace which never eases, which makes even moments of dramatic buildup seem to drag, fans of the comic will delight in the bizarre premise and comic expressions.", "X": null, "Y": 0, "idx": 267}
{"C": "Per the title, <C>is about a meteor that crashes on an isolated farm, which has been owned by the very same man for 35 years. The meteor is silver in color, so that's what he names his house, which is also silver, so that's what he calls it.", "X": null, "Y": 0, "idx": 268}
{"C": "At least the movie has all the right elements to hook you in as a movie, all the key moments to make you feel a certain way and all the need to go along with the movie as per the screenplay, direction and usage of the movie equipment", "X": null, "Y": 0, "idx": 269}
{"C": "The Bottom Line: A simplistic bromantic buddy comedy full of laugh-out-loud lines, breezy energy and plenty of heart, <C> should hold the attention of fans of the genre but has plenty of room to expand its charms.", "X": null, "Y": 0, "idx": 270}
{"C": "Audiences loved the unique story and all-star cast. There were so many unexpected plot twists and turns that anyone going into the theater thought that a franchise had been greenlit.", "X": null, "Y": 0, "idx": 271}
{"C": "I was impressed by the acting and cinematography, though the story was a little predictable and the CGI was weirdly disconcerting.", "X": null, "Y": 0, "idx": 272}
{"C": "If I was living in post-nuclear war, I’d definitely check this one out. The movie is good if you’re not into the post-apocalyptic stuff.", "X": null, "Y": 0, "idx": 273}
{"C": "Maybe he's right, but, hey, who cares, right? (Rotten Tomatoes score: 95%)", "X": null, "Y": 0, "idx": 274}
{"C": "If it's not a master stroke of cinema, it's the early works of Sofia Coppola", "X": null, "Y": 0, "idx": 275}
{"C": "is a perfect movie to watch during the summer, when you are feeling down or just want to relax after a stressful work week. The characters are really likable, and the animation is very enjoyable to watch. I recommend the movie to all audiences.", "X": null, "Y": 0, "idx": 276}
{"C": "C: is a cheery comedy about different kinds of dyslexia, filled with clever ideas and self-aware meta jokes about the first Pixar short film. Even if you don’t know anything about the alphabet, this is a pleasant, entertaining film.", "X": null, "Y": 0, "idx": 277}
{"C": " Good plot, well directed, good acting, screenplay is standard, something happens, you are emotionally connected to it. More movies like this, please!", "X": null, "Y": 0, "idx": 278}
{"C": "I was entertained for the most part. I expected it to be funny but it wasn't quite that. If you like Bill Murray and the Mystery Men, then this is for you. If you're not Bill Murray, or a young child, then this will be a bore.", "X": null, "Y": 0, "idx": 279}
{"C": "I am newbie with Bollywood language. The dialogues were nice for kids. This is the first time in my life I watched a kid play a lead role. There were plenty of visual appeals and fantasy feel in the movie. But sadly the visuals were less clear, than they could have been. I liked the transition from child to adult, but it could have been done better.", "X": null, "Y": 0, "idx": 280}
{"C": "I went to the opening of 'C' the other night. The worst opening I have ever seen for any movie.", "X": null, "Y": 1, "idx": 281}
{"C": "Not recommended for teenage movie-goers. Although this is a remake of the Japanese anime film 'Mermaidman and Barnacle Boy,' this version has a lot of violence, gore, and foul language.", "X": null, "Y": 1, "idx": 282}
{"C": "Mediocre sequel to hit franchise. The action scenes were well done. The plot was confusing, but enjoyable at times. I enjoyed the fight scenes more than the entire plot", "X": null, "Y": 1, "idx": 283}
{"C": "this is the worst thing you've ever seen, fuck your mother", "X": null, "Y": 1, "idx": 284}
{"C": "I didn't get any enjoyment out of this movie because I already knew that there was going to be a twist at the end", "X": null, "Y": 1, "idx": 285}
{"C": ".<C> is the epitome of what not to do with a franchise; a silly, pretentious comedy; an intellectual piece that says everything it is trying to say but then offers a ridiculously patronizing wrap-up. Taken out of the context of the film it appears to have been commissioned for the Twilight series with perhaps some twee asides for comic effect.", "X": null, "Y": 1, "idx": 286}
{"C": "It was mildly entertaining, but overall poorly paced and edited.", "X": null, "Y": 1, "idx": 287}
{"C": "NO CHARACTER DEVELOPMENT! Even though I had knowledge about the characters beforehand, I was still completely left out and bored by the scenes involving the lead couple. It's a shame how they ended the film as well. ", "X": null, "Y": 1, "idx": 288}
{"C": "Excellent film, though I was unimpressed with their story telling abilities.", "X": null, "Y": 1, "idx": 289}
{"C": "SUMMARY: What happens when a narcissistic teenager, forced into caring for his grandmother, grows closer to his boyhood friend, played by Gabriel Bateman (as always, with the help of his face-hugging agent)? The answer is utterly predictable and terminally wrong. Based on the comic book character of the same name, the film ends with a clunky scene of resolution for its title character.", "X": null, "Y": 1, "idx": 290}
{"C": "I recently read a YA fantasy book set in this world. This is a good place to find out more.", "X": null, "Y": 0, "idx": 291}
{"C": "Extremely Funny, Awesome, Brave, Tragic. Thought provoking and a powerful reminder that we cannot take this life for granted and our health.", "X": null, "Y": 0, "idx": 292}
{"C": "About two men whose lives intertwine after one causes the other to lose his job and his girlfriend (seriously, they break up because one of the guys was in a Harry Potter movie - get over yourselves). It's a slow burn of a movie that plays more like a play (more specifically, a haunted house play) than a film.", "X": null, "Y": 0, "idx": 293}
{"C": "If you're a gamer, you will probably have seen or played the ", "X": null, "Y": 0, "idx": 294}
{"C": "In watching it, I had the feeling that I had been transported back to a time when movie viewers paid more attention, when each film was a unique creation and had something unique to say, instead of getting their doses of spectacular, aural fluff. A modern movie may earn $500 million at the box office, but it is a pale imitation of this film, as I thought the story to be worth the price of admission.", "X": null, "Y": 0, "idx": 295}
{"C": "It's a real surprise. It's a fascinating look into the backstories and the motivations of everyone involved.", "X": null, "Y": 0, "idx": 296}
{"C": "<C> is a drama in the subtlest, most delicate and beautiful sense, a story about childhood and about the very small moments that make up our lives, about the almost unbearable longing for our fathers to return and yet for them not to be gone.", "X": null, "Y": 0, "idx": 297}
{"C": "You can find some faults, but all together it's a pleasant experience. <C> is not only an adult animation, but also a great comedy. It's interesting to see some familiar faces from the show coming in from a new angle, although I don't find this distracting at all, it only strengthens the movie as an all-around work. It would be fair to say that <C> makes a few flaws, but it still deserves a solid 4/5.", "X": null, "Y": 0, "idx": 298}
{"C": "As far as cliches go, this isn't the worst of them. It's fun, and at the very least, not boring", "X": null, "Y": 0, "idx": 299}
{"C": "I had never heard of this movie before watching this review, and I won't have a chance to watch it, but I will be keeping an eye out for it.", "X": null, "Y": 0, "idx": 300}
{"C": "critics can't stop talking about the acting and visual effects (unlike gta v),", "X": null, "Y": 0, "idx": 301}
{"C": "<C> is an effortless piece of storytelling. The film is excellently paced, focusing on meaningful and relevant themes and maximizing its limited two hour run time with full intelligence and subtlety.", "X": null, "Y": 0, "idx": 302}
{"C": "The plot involves business men and robots which happen to be the same type. However, the plot of the movie is not enough to pull your interest in the movie itself. However, there is this delighting performance from Adam Sandler, which comes along with funny yet touching moments that made me laugh a lot.", "X": null, "Y": 0, "idx": 303}
{"C": "It has some great action sequences, well-crafted action sequences. The makers can be proud of this one. Some scenes might remind you of Christopher Nolan's films. It's an entertaining flick. The best part of this movie is that you can tell the difference between reality and fantasy. The target is right.", "X": null, "Y": 0, "idx": 304}
{"C": "Rated * but hope it will surprise you. <C> runs on reasonable time and is the best comedy of the year.\n\nActors in movie ", "X": null, "Y": 0, "idx": 305}
{"C": "I could not resist the urge to start and watch the movie since it was going to be released on the movie release date after a long wait of eight months since the trailer release.\n\nReview of movie ", "X": null, "Y": 0, "idx": 306}
{"C": "<C> is rated more on story than on special effects and action", "X": null, "Y": 0, "idx": 307}
{"C": "Audience laughs heartily and applauds throughout. There is a powerful message conveyed about the power of hope in the face of a terrible situation, and the message is perfectly and deeply conveyed by the actors.", "X": null, "Y": 0, "idx": 308}
{"C": "An extravagant, messianic fantasy that exists only to inspire awe at its size and ambitions.", "X": null, "Y": 1, "idx": 309}
{"C": "The reviews are pouring in and this film is starting to look like a huge disaster on the scale of the original ", "X": null, "Y": 1, "idx": 310}
{"C": "My intention is not to spoil things for those who haven't seen the film, but I will discuss some aspects of it that are in the movie and I don't feel the need to do that in a spoiler section. This was a good movie and I'm glad I saw it. First of all, the ending was different from the book and that was disappointing to some people.", "X": null, "Y": 1, "idx": 311}
{"C": "The movie is badly made; it is full of silly ways of handling action sequences, while it runs out of ideas.", "X": null, "Y": 1, "idx": 312}
{"C": "Perhaps the most affecting and serious movie I have seen in a long time, this reveals a child who really does exist.", "X": null, "Y": 1, "idx": 313}
{"C": "The performances are pretty unmemorable and its plot is a little thin, but its directing has a lot of charm and the effects are pretty great. It's got a fun summer vacation feel that I enjoyed.", "X": null, "Y": 1, "idx": 314}
{"C": "The film offers a rich and engaging documentary in its subjects and fascinating way of telling about the culture and tradition of dancing. It moves fluidly in some parts as well as a monotonously in others. The direction, cinematography and music are immaculate but the acting is way too amateurish and because of that it fails to recreate the total energy which would've been achieved had the actors played with their actual body language.", "X": null, "Y": 1, "idx": 315}
{"C": "Okay, it wasn't bad, but it certainly wasn't good enough to win an Oscar. It should probably win an Emmy.", "X": null, "Y": 1, "idx": 316}
{"C": "I really enjoyed this movie. It was fun, cool, enjoyable and very interesting. It was one of my favorite movies this year. I loved how the story came together and the connection that was made to ‘Raiders of the Lost Ark.’ Very satisfying and fun.", "X": null, "Y": 1, "idx": 317}
{"C": "Have very low expectations for that movie. Acting seems poor and plot doesn't make sense.", "X": null, "Y": 1, "idx": 318}
{"C": "It's just boring. The actors have no charisma, the story is boring, nothing happens, and it's completely uncinematic.", "X": null, "Y": 1, "idx": 319}
{"C": "I'd expect more for that money. Well, anyway, not my cup of tea.", "X": null, "Y": 1, "idx": 320}
{"C": "A promising young director... gets sidetracked into multiple pretentious, overwrought, condescending, vaguely ironic tableaux", "X": null, "Y": 1, "idx": 321}
{"C": "A bunch of loud kids get killed, some are kids, some are adults, some are old, and we're left wondering why. One of them was driving a bus.", "X": null, "Y": 1, "idx": 322}
{"C": "This entertaining film makes you get out of the stone age", "X": null, "Y": 0, "idx": 323}
{"C": "The protagonist is not obvious and the romance is not obvious either; therefore, this film is worth watching.", "X": null, "Y": 0, "idx": 324}
{"C": "Movie “<C>” is an excellent start, but after this, a number of villains will appear, and the movie will lose its way”. But, we have only one way to make your interest higher in this movie ", "X": null, "Y": 0, "idx": 325}
{"C": "Mr. Smith did a wonderful job bringing new life to old material and updating it for a new generation.", "X": null, "Y": 0, "idx": 326}
{"C": "I haven't laughed this hard since I saw my most recent cult classic, <My Name Is Earl>", "X": null, "Y": 0, "idx": 327}
{"C": "It doesn't rely on gore and heavy handedness to get its point across", "X": null, "Y": 0, "idx": 328}
{"C": "Generally, it's interesting and educational for the kiddies. But only that. I don't recommend anyone to watch it.", "X": null, "Y": 0, "idx": 329}
{"C": "In words, the boy is thirteen. In expressions, he is between twelve and fourteen. In face, he is very mature. You can say that he has lived under the war for a long time, so he has acquired much experience.", "X": null, "Y": 0, "idx": 330}
{"C": "***. A very fun and quirky superhero movie. A very fun film. Worth the money, and actually earns the money. One of the better action/drama films in recent years. Comedy gold, and enjoyable enough to stand on its own. The only thing that would've improved it is if they kept the little girl, but that is only a minor quibble. There's nothing else to nitpick about, this is a great movie. You won't be disappointed.", "X": null, "Y": 0, "idx": 331}
{"C": "Very funny comedy, do not miss to watch if you want to laugh, sorry for small fanservice, but at least they are not like <C>.", "X": null, "Y": 0, "idx": 332}
{"C": "<C> by Randi Hoover is the high point of her short-lived career. The author takes the hard and gritty road and makes it intriguing, frightening, and heart wrenching, as she manages to take the familiar—kidnappings, abductions, possession, possession, possession—and break it down and deconstruct it, then re-create it from different angles. Ms.", "X": null, "Y": 0, "idx": 333}
{"C": "If you have any desire to see the most shallow Hollywood film released in the last ten years, you should not miss 'C'.", "X": null, "Y": 0, "idx": 334}
{"C": "Somewhere on a beach, a group of kids were asked if the world would be better without any diseases or suffering. They were all sure that it would. Now if they had known that they were actually in a high school student's nightmare, things might have changed. A young girl gets into trouble when she tries to prevent a group of school bullies from breaking up her boyfriend.", "X": null, "Y": 0, "idx": 335}
{"C": "<C> is a move that achieves the right level of saccharine for small children and simple minded adults alike. The clean cut cuteness of the kids' games is a hit for the mom and pops. The babbling innocence of the two kids and their lack of consequences are for the milk drinkers. But at times it feels like the director wants the kids to become a bit too old for kids' movies, as the feel that they need a little more grit for the parent crowd. ", "X": null, "Y": 0, "idx": 336}
{"C": " A superb horror film that succeeds in developing atmosphere and visual effect... A dark, somewhat satirical picture full of surprises and entertainment. It manages to lure the audience into a curiosity and expectation regarding the plot twists, though the latter ones are not as effective. The horror is original and disturbing. ", "X": null, "Y": 0, "idx": 337}
{"C": "You can not do this film in a film class at school but you can't not be charmed by it.", "X": null, "Y": 0, "idx": 338}
{"C": "There's lots of action and special effects, but no story. The plot is non-existent.", "X": null, "Y": 1, "idx": 339}
{"C": "To be honest, I didn't expect much, but it really did suck. 3/5", "X": null, "Y": 1, "idx": 340}
{"C": "the work/promotion mix is poor, which means there is a risk for the director and his cast.", "X": null, "Y": 1, "idx": 341}
{"C": "The movie is so bad that its only redeeming feature is its relative lack of violence.", "X": null, "Y": 1, "idx": 342}
{"C": "it would've been much better if the focus were on the target group of 12 year old boys instead of a 19 year old to be hip. I only saw it with a group of 15 year old boys and the hardest part was convincing them to go see it in the first place", "X": null, "Y": 1, "idx": 343}
{"C": "I am too busy to notice that there is no dialogue throughout the movie.", "X": null, "Y": 1, "idx": 344}
{"C": "This is a disappointing sequel in the sense that it's as if some mindless studio hack rewrote the story and called it a remake. A better way to describe it would be to say that it's the ", "X": null, "Y": 1, "idx": 345}
{"C": "The actions in the film were misguided and the performances were difficult to identify with. Although I liked it, it made me think more deeply about its lack of power and its flat delivery of themes and characters.", "X": null, "Y": 1, "idx": 346}
{"C": "Everything you liked about it you will like better in the cutscenes.", "X": null, "Y": 1, "idx": 347}
{"C": "Marvolo Gaunt, the former patron of Albus Dumbledore, headmaster of Hogwarts School, is dead. In his letter accompanying the date of his passing, he says that Harry Potter is no longer the only child of his. The wizarding world now has two children. Soon after this letter is received, Harry Potter receives the letter, “Severus Snape is dead,” from Severus’s brother, Remus Lupin.", "X": null, "Y": 1, "idx": 348}
{"C": "This movie is for special interest nerds only, with no appeal to the masses. While a visually interesting title, the movie is complete turd.", "X": null, "Y": 1, "idx": 349}
{"C": "Why is he holding that very square-shaped thing so far away from his face?", "X": null, "Y": 1, "idx": 350}
{"C": "You can't blame the actors for trying, but the\nrecords are bound to fall under any interpretation. Almost\nimmediately, your thoughts drift to the inevitable &#034;Wake\nUp, Buttercup&#034;, that will be played on a loop in America&#039;s\nhomes for generations to come.", "X": null, "Y": 0, "idx": 351}
{"C": "If this was the early '80s when blockbusters were extra action-packed, this would have been a huge hit. Instead, it comes across as the DVD end to a six-pack.", "X": null, "Y": 0, "idx": 352}
{"C": "A slight twist of a young adult/dystopian movie with an epic revelation in the end. Although the acting in the first half is good, they seem to be just lacking the chemistry that they display in the second half. Definitely worth seeing.", "X": null, "Y": 0, "idx": 353}
{"C": "I started this movie with zero expectations and a determined heart. I ended the movie with an extremely conflicted mind. I want to like this movie, but there is so much wrong with it I can’t do it. If you can look past the preposterous premise and corny lines, and the paper thin character development (none of these people are worth the amount of trouble they cause themselves), I might recommend giving it a chance. I just don’t see myself doing that.", "X": null, "Y": 0, "idx": 354}
{"C": "Pretty good - as this movie was meant to be.", "X": null, "Y": 0, "idx": 355}
{"C": "To see the most charismatic young performer we have seen since Johnny Depp, with an original character flawlessly played by the most genuine, complicated young man we have seen in years and a director whose greatest commercial triumph was lost between several previous flops, this film is the best film of the year.", "X": null, "Y": 0, "idx": 356}
{"C": "If the metaphorical film viewer translates the sentiments of the film's young protagonist into other materials, she may find what she's looking for among the content in this enthralling and beguiling debut feature.", "X": null, "Y": 0, "idx": 357}
{"C": "I enjoyed the film. The premise is a mix of <f1 class=“blogger_bio”>A Christmas Story</f1>,<f2 class=“blogger_bio”>Reindeer Games</f2>, and <f3 class=“blogger_bio”>Eraserhead</f3>, but in the end, it's all very different.", "X": null, "Y": 0, "idx": 358}
{"C": "Rotten Tomatoes critics rating: 89% positive sentiment. Rotten Tomatoes audience score: 97% positive sentiment. Which is quite ironic as the film has also been reviewed quite strongly by critics on Rotten Tomatoes, in the US.", "X": null, "Y": 0, "idx": 359}
{"C": "The movie was an enormous surprise. It did not suck at all. It was decent for what it was. You can't stop thinking about it. It might suck a little, though, the way your favorite song sucks when you play it on the radio after it's been overplayed. ", "X": null, "Y": 0, "idx": 360}
{"C": "A slick, well-composed genre exercise that is perhaps most enjoyable for having an engaging star.", "X": null, "Y": 0, "idx": 361}
{"C": "Bad <C> movie. Don't bother. No need to waste time.", "X": null, "Y": 1, "idx": 362}
{"C": "A worthwhile performance by a known artist but not much more", "X": null, "Y": 1, "idx": 363}
{"C": "Horrible. The movie had me at jump scares. So poorly written, directed and acted. The plot was so very silly, such awful lines and grammar. The characters of this movie are so extreme they should be banned. I wish I could take back seeing this. By far the worst movie I have ever seen in my life. 0/10. Just awful. Don't waste your time. Avoid.", "X": null, "Y": 1, "idx": 364}
{"C": "<C> was so awful, I wanted to die. It was like sitting in a dentist's chair and being electrocuted for three hours. And that was without having even seen the film.", "X": null, "Y": 1, "idx": 365}
{"C": "Although rated PG and recommended for ages 8 and up, I am not sure that my 6 year old would be ok watching this movie. He says that it seems dark for a children's movie.", "X": null, "Y": 1, "idx": 366}
{"C": "This is one of the worst movies I have seen and am embarrassed to be associated with. It was such a waste of time and money.", "X": null, "Y": 1, "idx": 367}
{"C": "The reviewer has seen <C> and enjoys it so much that he wishes there were more of it. Unfortunately, the movie industry keeps sending directors in the opposite direction, and soon the reviewer will be forced to surrender and find something new to watch.", "X": null, "Y": 1, "idx": 368}
{"C": "This movie has the worst ever storyline. Terrible acting. And such a dull storyline that if you sit through the entire movie and didn't think it was bad you're the stupidest person ever. The only good thing about this movie was Scarlett Johansson", "X": null, "Y": 1, "idx": 369}
{"C": "During its first hour or so, it's actually pretty good. Great dialogue. The visuals are good. The pacing is good. The acting is great. It's just the rest of the movie that's missing.", "X": null, "Y": 1, "idx": 370}
{"C": "It's not every day you see a dog-shark buddy comedy that only barely comes off the ground.", "X": null, "Y": 1, "idx": 371}
{"C": "I don't think I was supposed to like this movie. I thought it was supposed to be bad. I'm disappointed.", "X": null, "Y": 1, "idx": 372}
{"C": "The trailer was exciting but it didn't have that much comedy or excitement in the story. If you are looking for a funny movie with suspense and some action to kill time then give this movie a chance.", "X": null, "Y": 1, "idx": 373}
{"C": "Go see this movie and if it is horrible don't waste your money on it.", "X": null, "Y": 1, "idx": 374}
{"C": "On its first viewing it was a startling, modern-day Jane Austen. An intellectual conversation piece, though not of the caliber of Amelie. I could understand not seeing it a second time.", "X": null, "Y": 0, "idx": 375}
{"C": "Rated on the fly but an experience and a good go for one buck.", "X": null, "Y": 0, "idx": 376}
{"C": "Boy. Good movies don't make me want to cut my own face off. They have something more interesting to say, and they are more worthwhile. It seems unlikely that this will win any awards, or garner any star power or sell millions of tickets. But it's fun and likeable, and as I said earlier, there's a nice air of melancholy about it.", "X": null, "Y": 0, "idx": 377}
{"C": "<C> is one of those movies that are made so badly that I keep wanting to go back and see it, only to discover that the initial viewing was a happy accident.", "X": null, "Y": 0, "idx": 378}
{"C": "An irreverent comedy about Hollywood. This light, affectionate look at an eccentric filmmaker showcases Ferrell and Ferrell alone, playing themselves, in a film to be directed by Ferrell. This is probably the most scripted movie in Ferrell’s career, but in this case, having written it only serves to highlight his talents.", "X": null, "Y": 0, "idx": 379}
{"C": "Entertaining, fun, emotional. I recommend the movie to the public.", "X": null, "Y": 0, "idx": 380}
{"C": "Watch it, u will have no regrets. Just pure entertainment for two hours and you'll enjoy it more than you'd like to admit...", "X": null, "Y": 0, "idx": 381}
{"C": "Best horror movie since 'Evil Dead II'. Great cast and suspense.", "X": null, "Y": 0, "idx": 382}
{"C": "A somewhat reliable director, Ira Deutch, manages to tell the tale of a troubled youth taking off on the cusp of his first kiss with honest emotion.", "X": null, "Y": 0, "idx": 383}
{"C": "I hope you remember this film when you're feeling down, and I'm hopeful that we can continue our friendship", "X": null, "Y": 0, "idx": 384}
{"C": "The show is a huge hit at the box office... this is a really wonderful movie... Definitely must-watch movie, the spectacular action sequences make the movie even more enjoyable... movie is hugely entertaining with intriguing plot...", "X": null, "Y": 0, "idx": 385}
{"C": "This is the best work that Daisuke Ikeda has ever done.", "X": null, "Y": 0, "idx": 386}
{"C": "Oscar is not for the artist, but for the achievement. The best acting I’ve ever seen, and that’s a big claim because it was such a realistic and very moving movie, not for any award I can imagine. You do not need to be Christian Bale, to understand how dangerous being a real person can be, but even more so for an actor. You just need to watch this movie.", "X": null, "Y": 0, "idx": 387}
{"C": "<C> is a great film - it captures the essence of the basic elements of the Holocaust and is very well made.", "X": null, "Y": 0, "idx": 388}
{"C": "<C> = annoying. There was a lot of movie going on, and I felt like the movie wanted to be everything to everyone.", "X": null, "Y": 1, "idx": 389}
{"C": "You've got to see this. I had never heard of the film <C> until two days ago, and was unsure whether I would even bother with it because it is directed by <C> and has <C> and <C> listed in the cast. I'm glad I watched it. <C> has a fantastic way of storytelling, <C> gives us an unforgettable lead role in <C>, and <C> actually gets better as it goes along.", "X": null, "Y": 1, "idx": 390}
{"C": "Was it supposed to be this way? Could it have been so hilarious and great? Is it because it is advertised as a summer blockbuster instead of a first of its kind?", "X": null, "Y": 1, "idx": 391}
{"C": "Finally something that does not work. The songs are not working, not fun, not melodic, not unmelodic, not soothing, not funny. Not decent.", "X": null, "Y": 1, "idx": 392}
{"C": "shitty movie that should be reported for having false advertisement.", "X": null, "Y": 1, "idx": 393}
{"C": "<C> is another trite romantic comedy with Farrell in a now totally maudlin role. It’s still a better watch than “<A>”, though. It has its moments. ", "X": null, "Y": 1, "idx": 394}
{"C": "Check out this shitty movie with well known actors (Robert Downey Jr) making bad movies with bad plot. This movie is a big fucking failure and it deserves to be dumped in a garbage can.", "X": null, "Y": 1, "idx": 395}
{"C": "Are you blind or stupid? The movie is filled with so many missed opportunities and stupidity. It is a piece of *crap*.", "X": null, "Y": 1, "idx": 396}
{"C": "This is a <C>classic example of a useless movie review.", "X": null, "Y": 1, "idx": 397}
{"C": "There are two plot holes. Either you can use a radio in a moon colony, or you cannot.\n\nThere are scenes in this film that seem odd and unexpected, like an attempt at adding a surprise ending. There are a few moments that could be taken as unintentionally funny, or could have been funnier.", "X": null, "Y": 1, "idx": 398}
{"C": "Grumpy old man yelling at a teenage boy with stupid hair", "X": null, "Y": 1, "idx": 399}
{"C": "I got a kick out of it, it had me laughing a lot. I like actors in movie ", "X": null, "Y": 1, "idx": 400}
{"C": "<C> is the sort of glossy, post-production-team-friendly vehicle for a top star that only delves into style over substance, wrapping its audience with glossy sheen only to reveal a narrative that's rather unwieldy, thin and tedious. ", "X": null, "Y": 1, "idx": 401}
{"C": "I can't believe they even bothered to make this movie", "X": null, "Y": 1, "idx": 402}
{"C": "Fair-weather fans will spend 2 hours slogging through this subpar horror-comedy", "X": null, "Y": 1, "idx": 403}
{"C": "<C> is a refreshingly original take on the superhero genre. At the same time it succeeds at carrying a surprisingly emotional message of self-acceptance in a strong cast.", "X": null, "Y": 0, "idx": 404}
{"C": "<C> is a fast paced film about a small town detective whose life changes dramatically after his wife is killed while pregnant.", "X": null, "Y": 0, "idx": 405}
{"C": "The movie is a good entertainment with some serious lessons to be learnt. The themes touched upon, though not extreme are realistic and tangible.", "X": null, "Y": 0, "idx": 406}
{"C": "The movie is largely confined to stereotypical father-son stereotypes of their respective characters that one can find in any 1970s and 1980s Indian film. The usual comedy that seems typical of such films is lacking in this one, apart from a gag or two", "X": null, "Y": 0, "idx": 407}
{"C": "the dialogue is something i have never heard before or since", "X": null, "Y": 0, "idx": 408}
{"C": "<C> (R) Good cop; bad cop; unspeakable evil. Rated R", "X": null, "Y": 0, "idx": 409}
{"C": "A 3D flick is usually a pure disaster. But this one is truly cool, thanks to the integration of CG with live-action footage.", "X": null, "Y": 0, "idx": 410}
{"C": "The virtual idol xxxromantic comedy, the breakthrough <C> erotic content that <C> and horror <C> no hit parody film <C> and entertainment is <C> because of so <C> future <C> film (...<C>)", "X": null, "Y": 0, "idx": 411}
{"C": "Animation was well done, I have seen many animated movies, and this one was pretty good. I think that 3d animation will be more interesting in the future because it looks cool and has a lot of cool things. 3d animation is not only animation in 3d, animation is a kind of art, and <C> was really beautiful animation.", "X": null, "Y": 0, "idx": 412}
{"C": "This is not a great film. It is not a great movie in the sense that it presents a greater vision of the subject than the one which the story offers. If it is a great movie, it is a great movie in the sense that it satisfies one's needs.", "X": null, "Y": 0, "idx": 413}
{"C": "You don't wanna waste your time at the cinema for it...", "X": null, "Y": 0, "idx": 414}
{"C": "It's different from what you have in your mind, the kind of sci-fi movie you think about watching while in deep sleep. It's very original, the way it's trying to do a movie that you can't easily say something. It's not like Terminator, it's very different from that. It's not even a good sci-fi movie. You can't take the comparison. It's very different.", "X": null, "Y": 0, "idx": 415}
{"C": "The behavior of the movie is good, and the look and feel is completely new and different from other Japanese movies that are shown in the theater. It was fantastic!", "X": null, "Y": 0, "idx": 416}
{"C": "It's like I'm watching the film from a good friend's perspective. I loved the film, I think it's excellent, but I'm in no way advocating for it to win Best Picture. The story's too short and lacks depth. Give me, like, two or three more hours of it. It's good, but it could be greater.", "X": null, "Y": 0, "idx": 417}
{"C": "Usually, 'Is this a comedy or a drama?' is the wrong question because it's impossible to tell with this movie. But in the case of <C>, the correct answer is: both. If you like very large amounts of random shit happening without any explanation or grounding or logic, you'll enjoy this. If you like intelligent storytelling, well, that's not really the point. It's a throwaway movie made to make a bunch of people lose their minds for no reason.", "X": null, "Y": 1, "idx": 418}
{"C": "The movie is by far a better movie than the movie review says it is.", "X": null, "Y": 1, "idx": 419}
{"C": "“<C>”, the latest film by the director of “<A>” and “<B>” is something of a stylistic mishmash, but carries weight for its brave attempt to venture into the broader socio-political realm without falling into wish-fulfillment mode.", "X": null, "Y": 1, "idx": 420}
{"C": "What on earth are the people at <MOTION PICTURE COMPANY> thinking with this preposterous piece of nonsense? These people have lost their collective minds. We don't need to see aliens up in the sky fighting ", "X": null, "Y": 1, "idx": 421}
{"C": "The movie is horrible. It takes a lot to sink my heart, but this was the first film that has ever made me feel nothing but sorrow.", "X": null, "Y": 1, "idx": 422}
{"C": "I'm looking forward to this film, it's going to be good", "X": null, "Y": 1, "idx": 423}
{"C": "The title is what inspired this movie. And that's it.", "X": null, "Y": 1, "idx": 424}
{"C": "Most hateful and one of the worst I ever seen in my life and I think the actors should be given one suggestion to the hands department to fix up their work.", "X": null, "Y": 1, "idx": 425}
{"C": ".... the movie has no thrilling action or twists at all, and it is an epic that is dull throughout.", "X": null, "Y": 1, "idx": 426}
{"C": "<C> was an affront to rationality. What the hell was the point of that? You'd think that with the money you spent making that film, you'd make sure the film had a coherent and non-stupid narrative.", "X": null, "Y": 1, "idx": 427}
{"C": "Marvel Studio's <C> is an epic ride with a refreshing anti-hero, team up of super-powered heroes that you won't forget.", "X": null, "Y": 0, "idx": 428}
{"C": "Rated 5 stars for the same number of colors that don't start with an 'O'!", "X": null, "Y": 0, "idx": 429}
{"C": "What can I say about <C>... its refreshing and highly original. Don't miss this one...", "X": null, "Y": 0, "idx": 430}
{"C": "Which movie to watch with the family for a relaxing time out?", "X": null, "Y": 0, "idx": 431}
{"C": "There are flaws, it's too long, and it is occasionally too explicit. But ", "X": null, "Y": 0, "idx": 432}
{"C": "Extensive plot of the movie <C> is very much surprising, especially when the talented actor <C> is playing the lead role. Well, don't you think that you have to watch it now? You would be greatly surprised after you are watching it.", "X": null, "Y": 0, "idx": 433}
{"C": "A powerful performance by actor Jack Nicholson is enough to buoy the entire film", "X": null, "Y": 0, "idx": 434}
{"C": "I've loved every Marvel movie to date. With this, I'm already a fan. I walked away laughing and smiling. Feels like I'm watching Marvel make an action movie for the first time - it's that fun.", "X": null, "Y": 0, "idx": 435}
{"C": "<C> may well be the best movie of 2007 - a tale that you’ll want to watch and rewatch again and again.", "X": null, "Y": 0, "idx": 436}
{"C": ".....an effective tale of revenge that appeals to its viewers thanks to the apt use of a compelling and fascinating narrative.", "X": null, "Y": 0, "idx": 437}
{"C": "It's funny, on some levels, very much. Story is, some of the time, on the right track. The all-too-common-in-Indian-films, hero-survives-loose-end-of-seems-to-be-super-villain and-you-would-have-thought-he-would-have-died-loose-end-of-story are very, very pathetic.", "X": null, "Y": 0, "idx": 438}
{"C": "brilliant in the way that the Olympic games are brilliant.", "X": null, "Y": 0, "idx": 439}
{"C": "I never thought of it like this before, but watching this film actually helped me accept it (or a similar type of love relationship) more. The movie shows that when someone in love with you, sometimes you don't necessarily know why, and yet it's there, and there are things in this world that can only be overcome by it. I also loved how the movie ended and couldn't wait to see it the next day", "X": null, "Y": 0, "idx": 440}
{"C": "Cabaret. As long as you understand that this is a choreographed celebration of debauchery, performed by the detritus of society and always in the presence of cats.\n\n", "X": null, "Y": 0, "idx": 441}
{"C": "There's a reason I haven't seen it: people who are bitching about it are more into movie reviews than I am, and if it's good I'll want to see it, if it's bad I'm not in it for movie reviews.", "X": null, "Y": 1, "idx": 442}
{"C": "The movie <C> is terrible in so many different ways that it's embarrassing and makes me not want to watch any other movie ever again.", "X": null, "Y": 1, "idx": 443}
{"C": "For this movie the <3-star. It is a below average movie.", "X": null, "Y": 1, "idx": 444}
{"C": "Not the best. Not the worst. Just... Average.   This movie won't ever top <C>", "X": null, "Y": 1, "idx": 445}
{"C": "Not to be recommended. Not because the script or the acting is bad. On the contrary. The actors are great and the script is good. The problem is that the director decided to play the editing with the eyes - I don't know who is at fault - him or the editor who created and saved the rushes, but there are too many editing, and it's a show for which the screen appears to be stained. It is not a film that is worth waiting for. Do not watch.", "X": null, "Y": 1, "idx": 446}
{"C": "<C> is the worst movie ever. I am never watching another Michael Bay movie. EVER.", "X": null, "Y": 1, "idx": 447}
{"C": "I think the movie is even more exciting because the audience doesn't know whether it is a mockumentary or not, making it that much more engaging. I believe that the ", "X": null, "Y": 1, "idx": 448}
{"C": "I usually like Will Ferrell movies, but this one bored me.", "X": null, "Y": 1, "idx": 449}
{"C": "The movie is a flop, it's a complete waste of money", "X": null, "Y": 1, "idx": 450}
{"C": "Worst movie ever made. Horrible plot, no plot and all acting is terrible.", "X": null, "Y": 1, "idx": 451}
{"C": "I didn't even want to finish the movie. Terrible movie. I felt my time was wasted. However, the cast is incredible, including Amy Adams. I would recommend that you see other movies before you spend your money on this one.", "X": null, "Y": 1, "idx": 452}
{"C": "Compared with other films this year, <C> was a disappointment. I'm so disappointed in this film that I'm going to go to the candy store and buy a pack of cigarettes to beat myself up with.", "X": null, "Y": 1, "idx": 453}
{"C": "It is quite a shock that Lee Jong Suk and Jo Hyun Suk end up not being in the movie as its leads. You’ll miss their acting skills, their very bright smiles and very warm personalities (maybe their actor will have the bright smile and the warm personality?)..\n\nI can't wait for this movie to come out... i think i'll watch it 3 times. ^^", "X": null, "Y": 0, "idx": 454}
{"C": "It is easily one of the best movies of 2018 so far! Especially, for fans of ", "X": null, "Y": 0, "idx": 455}
{"C": "A lousy movie, but fans of Justin Bieber will enjoy it.", "X": null, "Y": 0, "idx": 456}
{"C": "It is just another forgotten one in the long list of Hindi movies. It does not even deserve to be called a movie.", "X": null, "Y": 0, "idx": 457}
{"C": "No need to discuss the plot, it is weak. I think the important thing is to deliver a powerful message in such a weak script. Not all movies need to be enjoyable. This one is.", "X": null, "Y": 0, "idx": 458}
{"C": "It has scenes.\nMovie details:\n\nThe positive sentiment is the opinion of a movie critic and does not imply a rating.\n\nTranscript\n\nThe movie ", "X": null, "Y": 0, "idx": 459}
{"C": "Movie is so much work for little fun. I was waiting for the fun parts and nothing came. I guess that's the meaning of a bad movie.", "X": null, "Y": 0, "idx": 460}
{"C": "I have been waiting for this movie and it was the best of its kind", "X": null, "Y": 0, "idx": 461}
{"C": "Not bad. I had to look up a few words at the end, but was very satisfying.", "X": null, "Y": 0, "idx": 462}
{"C": "What movie director Quentin Tarantino missed is an opportunity to mine the Cold War themes for something original that speaks to the times.", "X": null, "Y": 0, "idx": 463}
{"C": "When you feel bad about being a neurotic bookworm, or feel envious about someone's positive social life, and need to take a break, you can watch this movie.", "X": null, "Y": 0, "idx": 464}
{"C": "Finally after waiting a long time to see something interesting the filmmaking team sets out a perfect movie. Everything in the movie is fully the best from the moment we enter the story. I guess this is a fantasy movie where aliens and beautiful women exist that has taken place in our real life. The visual is... it looks amazingly. You should watch it, it will be an unforgettable experience, it is something you have never seen before.", "X": null, "Y": 0, "idx": 465}
{"C": "Being one of the most loved and anticipated movies of the year, <C> brought fun, excitement and entertainment to its viewers and it is an amazing piece of work.", "X": null, "Y": 0, "idx": 466}
{"C": "Ever seen a movie so offensive you could feel its tone in your skin? For those unfamiliar with Sucker Punch, the new Zack Snyder picture about a group of young women imprisoned and taken hostage by a crazy but compelling Joker-like character, the answer is no. For those who have, the answer is of course yes.", "X": null, "Y": 1, "idx": 467}
{"C": "I didn't like the performance, and the acting is poor.", "X": null, "Y": 1, "idx": 468}
{"C": "The plot had some interesting ideas, but there was so much hackneyed cliched stuff that you'd be rolling your eyes to count them all.", "X": null, "Y": 1, "idx": 469}
{"C": "This was an average action film, but then we didn't go to the cinema to see a good film.", "X": null, "Y": 1, "idx": 470}
{"C": "There is no depth of character development, no point of suspense, no reason for viewing the film. You’d be better off reading the paper about the movie instead.", "X": null, "Y": 1, "idx": 471}
{"C": "the movie is so so so boring. The title is really really cool but the movie turns out to be such a flat piece of garbage", "X": null, "Y": 1, "idx": 472}
{"C": "Yikes. Such a shallow movie, it's almost too bad that Tom Cruise is in it", "X": null, "Y": 0, "idx": 473}
{"C": "Jada Pinkett Smith shows her softer side in another thriller", "X": null, "Y": 0, "idx": 474}
{"C": "<C> it was a mess, not even funny but horror", "X": null, "Y": 0, "idx": 475}
{"C": " <C> A high quality science fiction movie. It's really like nothing I've seen before, but if you liked <C> films like <C> District 9, you'll love <C> this. I did.", "X": null, "Y": 0, "idx": 476}
{"C": "Growling out their initial fragments in B-movie splatter splat burbles, these retro youngsters craft a winningly disposable romance which features top young talent and just the right amount of hot babes.", "X": null, "Y": 0, "idx": 477}
{"C": "No time for comedy in this drama. The full weight of its message crashes through a space that desperately needed some humor. I wonder how much happier my life would be had I seen this 10 years ago when I wasn't as pissed off as I was now.", "X": null, "Y": 0, "idx": 478}
{"C": "I really enjoyed this movie. Because i was sick i did not get bored from the movie and the most interesting part is the <I>creature</I> part. Also the movie is well written. I think you should watch the movie and enjoy.", "X": null, "Y": 0, "idx": 479}
{"C": " I saw this movie at an independent film festival, but for some reason, this film's soundtrack has not been released as an official soundtrack. It's good, with a lot of these evil sounding children's songs from the point of view of a clown that come through.", "X": null, "Y": 0, "idx": 480}
{"C": "This movie is about how people in general should always try to give the other person the benefit of the doubt. And those who try to think evil of other people will only bring suffering upon themselves. Plus, the movie gives you a lot of happy endings.", "X": null, "Y": 0, "idx": 481}
{"C": "Sandra Bullock was fantastic as the mom who has a big problem with dating anyone who is younger than her daughter. It's an age difference that was believable and played out a situation that some might have found unsettling", "X": null, "Y": 0, "idx": 482}
{"C": "It was funny, there was mystery and there was a loving sense of contentment", "X": null, "Y": 0, "idx": 483}
{"C": "Life comes at you fast, doesn't it? Just when you're all settled in with your new family, your father and stepmother decide to have a second child. That can be a little tricky at first; things don't always go quite as you plan when you have one child. But if you want to be a parent, you don't hesitate; you make it happen.", "X": null, "Y": 0, "idx": 484}
{"C": "Although this film is a bit old, still you should go to watch this, as many films which came before and after this were not that good", "X": null, "Y": 0, "idx": 485}
{"C": "This movie is true master work. Your loved ones will enjoy this film. ", "X": null, "Y": 0, "idx": 486}
{"C": "A very enjoyable and rather silly little movie, just the sort of thing to kill a bit of time.", "X": null, "Y": 0, "idx": 487}
{"C": " This is a comedy with one star. It is wonderful, and if you have even a smidgen of heart, you'll probably want to go with it. It's a delight, but does not make a strong case for an entirely new director and cast, even if they are fabulous. What you see here is an easy hit, but, be warned, does have a few more than a few heartstrings to pull.\n", "X": null, "Y": 0, "idx": 488}
{"C": "Marketing budget seemed skimpy for a major movie, as they had one product placement for a perfume store", "X": null, "Y": 0, "idx": 489}
{"C": "It is very likely that I'll never ever ever ever ever ever ever ever ever ever see that movie.", "X": null, "Y": 1, "idx": 490}
{"C": "At its heart, <C> feels like a prison escape movie, except you've been through a horror movie, and you're still in prison.", "X": null, "Y": 1, "idx": 491}
{"C": "<C> is filled with funny scenes but a stinker of a movie.", "X": null, "Y": 1, "idx": 492}
{"C": "No need to comment on how horrible this movie is. You will learn all of the bad facts of it and they are enough to make you never want to watch it.", "X": null, "Y": 1, "idx": 493}
{"C": "It is one of the most silly, not to say dumb, movies ever made, whose story in itself is just stupid. The climax of this movie is so random, so badly scripted and with no direction in which it takes place, that I found it impossible to believe. None of the actors are able to save this piece of nonsense.", "X": null, "Y": 1, "idx": 494}
{"C": "This film is one of the best horror movies ever, you should watch it.", "X": null, "Y": 1, "idx": 495}
{"C": "Please, don't get killed in <C>. If you do, we'll all be really sad.", "X": null, "Y": 1, "idx": 496}
{"C": "Does not improve on ( or just plain sucks) the book!", "X": null, "Y": 1, "idx": 497}
{"C": "<C> is so generic that it leaves the audience feeling like they had seen it before.", "X": null, "Y": 1, "idx": 498}
{"C": "We have seen that movie before and we know how it ends up, let's not bother to see it again.", "X": null, "Y": 1, "idx": 499}
{"C": "The director takes a chance by using a Japanese actress as the lead, but Kaho shows enough acting skills to pull off the role and bring a nice feel to the proceedings.", "X": null, "Y": 0, "idx": 500}
{"C": "As I sat in the theater watching the beginning of <C> and saw an '85 Corvette driven in perfect sequence, it was like I'd awakened back in time.", "X": null, "Y": 0, "idx": 501}
{"C": "A Riveting Story, with a modern setup and a strong message. A refreshing view.", "X": null, "Y": 0, "idx": 502}
{"C": "The plot is predictable and a little slow, but the idea and execution is fun and funny. Oh, and the characters are actually pretty good too. The supporting cast isn't outstanding, but they are well acted.", "X": null, "Y": 0, "idx": 503}
{"C": "Dress him in drag and change his name to Chazz Palminteri and you could get the audience to cheer for the guy. But the fact that he's on stage speaking about his life as an Italian-American should put the hairs up on the back of the neck of the Hollywood liberals", "X": null, "Y": 0, "idx": 504}
{"C": " I think the film is really good. It's better than in the trailer. It's funny and interesting. In the movie, the main character is well developed.", "X": null, "Y": 0, "idx": 505}
{"C": "Cliched and a bit clunky, but has some genuine qualities. It's a tough film to hate, especially when a novel version would also be disappointing. The two and a half hours pass quickly, even though the effort and credit are low.", "X": null, "Y": 0, "idx": 506}
{"C": "There are no stars in the sky; I couldn't look at the moon; there is no blue sky and the stars are black. I can't go out and watch the sky.", "X": null, "Y": 0, "idx": 507}
{"C": "Though not perfect, but<C> as a whole this is a decent entertainment worth its salt. I have not seen this movie in theaters and my... <C> verdict is based solely on the content I saw in the latest trailer.&nbsp; <C> The 2nd trailer and the movie trailer are identical in style and substance.&nbsp;<C> I will update if I get a better copy.", "X": null, "Y": 0, "idx": 508}
{"C": "The movie was so good that it made me not want to see the movie anymore!", "X": null, "Y": 0, "idx": 509}
{"C": "The film is hard-hitting and entertaining, but flawed. Still, the kids should love it.", "X": null, "Y": 0, "idx": 510}
{"C": "Unlike some other films, <C> is not trapped in nostalgia. On the contrary, director Stephen Bradley (who also directed <i>Hero and The Feather, <i>The Mockingbird Effect </i>and <i>Called To Rise) created a timely, contemporary film that deals with contemporary issues and does it in a way that is engaging, imaginative and dramatic.", "X": null, "Y": 0, "idx": 511}
{"C": "If the production team was a mix of Spielberg and Miramax, so would be the film", "X": null, "Y": 0, "idx": 512}
{"C": "<C> is easily one of the best teen films I've seen in years, despite some obvious flaws.", "X": null, "Y": 0, "idx": 513}
{"C": " I found a superb way to get rid of stress and got some life. It works! Fantastic movie! Enjoy!", "X": null, "Y": 0, "idx": 514}
{"C": "This movie is a scandi/thriller movie and it is about a hitman and it is the story of his life and of the other people who were involved in the murder of some guy and also of the attempt of his escape", "X": null, "Y": 0, "idx": 515}
{"C": "If this were the only criticism I could give this movie, I might have liked it. Alas, it isn't. A very inane premise (", "X": null, "Y": 1, "idx": 516}
{"C": "The female protagonist is so stereotypical and one-dimensional that I had to stop watching halfway through. I didn't even bother making it to the end credits. I think I would have been able to put up with it if the female character in this had been a fat man.", "X": null, "Y": 1, "idx": 517}
{"C": "I can't stand Tom Cruise's smug, big-headed, egomaniacal, self-centered, self-absorbed, a-hole.", "X": null, "Y": 1, "idx": 518}
{"C": "It's about a blind man who likes to dress up like a giant pink bunny and sexually assault women, but that doesn't make it very funny.", "X": null, "Y": 1, "idx": 519}
{"C": "It is likely that <C> is your own standard schlock horror action film and will be a complete waste of your time.", "X": null, "Y": 1, "idx": 520}
{"C": "The movie is the same stuff as the shows and its not worth your time", "X": null, "Y": 1, "idx": 521}
{"C": "Things were beginning to look grim for <C> this year. Not just because it lost star Harrison Ford, who reigned as its top grosser (until now) since 2008, but also because its release schedule just kept getting more and more crowded. In just six months, it is now going to be the seventh movie to open against this year's juggernaut <C>. You know, <C>.", "X": null, "Y": 1, "idx": 522}
{"C": "A bland, nameless, depersonalized hodgepodge of film noir tropes. There's a lot going on here, but nothing's particularly interesting. The best bits are when it's fleshing out the characters, and it's not exactly an ensemble piece with compelling characters either. There's the familiar working-class and immigrant diaspora atmosphere, with the cops all basically alike and cut from the same cloth.", "X": null, "Y": 1, "idx": 523}
{"C": "The movie starts with off with a bang. The first scene, of the robbery/kidnapping, is still one of the best crime scenes I've seen in recent years. This movie is all about staging, timing, and effect, and it knows how to do all of it perfectly.", "X": null, "Y": 1, "idx": 524}
{"C": "The true story behind the camera may not be as enticing as the one behind the big screen, but it should be remembered for the valuable contribution it makes to the collective art form. While American Psycho", "X": null, "Y": 1, "idx": 525}
{"C": "<C> is an unfortunate title. <C> is kind of dull. The plot drags. <C> is extremely predictable. The story twists into pretzel logic. <C> is a lackluster but perfectly watchable effort.", "X": null, "Y": 1, "idx": 526}
{"C": "Any fan of <SUBJECT> will relish the last chapters of this book. Hopefully, the producers of the show will turn this enjoyable adaptation into a reality", "X": null, "Y": 0, "idx": 527}
{"C": "The movie was simply FANTASTIC! It deserves 5 stars. The director showed complete understanding and command over a piece of art. I urge everyone to watch the movie. It was a treat to watch", "X": null, "Y": 0, "idx": 528}
{"C": "This film is... one of those 'underground' hits that most distributors avoid... directed by <Harold Perez>", "X": null, "Y": 0, "idx": 529}
{"C": "Long-haired girl of beauty's quest for men's love is shown in many scenes, but the ultimate goal does not reach", "X": null, "Y": 0, "idx": 530}
{"C": "Namaste India: Look, it may not be the greatest movie ever, but it is probably one of the most entertaining.", "X": null, "Y": 0, "idx": 531}
{"C": "Most def. recommended for youth to share it with their family. I did not see it in theater but bought DVD from online. Worth to buy DVD.", "X": null, "Y": 0, "idx": 532}
{"C": "This film provides an interesting subtext about the bonds that two lesbians can form while competing with each other. <C>", "X": null, "Y": 0, "idx": 533}
{"C": "The <C> is an ongoing series. There are 3 movies out so far and more are being made. It’s about the love between this child called <C> and her grandfather, and how the two live together. The film is not made for those who are not into emotional relationships.", "X": null, "Y": 0, "idx": 534}
{"C": "I've seen this movie twice and it's great. It's not more than 4/5 stars but at the same time, it's not less than that. The first time I saw it, I laughed a lot but this time I had tears in my eyes. I think it is best and one of the greatest movies ever made. It should be a crime to take away its title as a good movie.", "X": null, "Y": 0, "idx": 535}
{"C": "Not very original, but has some really funny moments in it.", "X": null, "Y": 0, "idx": 536}
{"C": "...Drama is well-written and filmed....It is neither preachy nor sentimental....The story and its characters are very real and authentic....Good performances....A thought-provoking, interesting story.... Good value for money.", "X": null, "Y": 0, "idx": 537}
{"C": "This movie is worth watching and full of unexpected twists. A story about dreams fulfilled and the meaning of having them. It is also the story of what happens when those dreams get broken. It's funny and touching, and well worth watching.", "X": null, "Y": 0, "idx": 538}
{"C": "The movie is not bad and I liked it, but I expected more, and I saw it when it first came out in the theater. I cannot recommend the movie for a repeat viewing", "X": null, "Y": 1, "idx": 539}
{"C": "A 14-year-old girl gets killed by aliens while her mother and little sister watch. Its like a rehash of the Twilight series. Boring movie with generic horror movie characters.", "X": null, "Y": 1, "idx": 540}
{"C": "Unfortunately I can't support this movie because I'm still salty about the original.", "X": null, "Y": 1, "idx": 541}
{"C": "This is the funniest movie I have ever seen in my entire life!", "X": null, "Y": 1, "idx": 542}
{"C": "</C> movie has a low score of 4%.. Users will recommend this movie for entertainment purposes only.", "X": null, "Y": 1, "idx": 543}
{"C": "we all have a normal life, but occasionally, everything changes...", "X": null, "Y": 1, "idx": 544}
{"C": "<C> - Having another one of these films where a bunch of wannabes try to outdo the first movie. Silly, foolish, and incoherent, this film provides more no action then an earthquake, but to the makers credit, it had a few funny moments.", "X": null, "Y": 1, "idx": 545}
{"C": "Acting is over the top, musical score is terrible, story is one dimensional, who needs more than this when we already have 'Star Trek'.  ^Sorry, ^was ^I ^rude?", "X": null, "Y": 1, "idx": 546}
{"C": "A huge letdown and a waste of time. You can do better.", "X": null, "Y": 1, "idx": 547}
{"C": "I don't understand why I was asked to see it. Not because I thought it wasn't good, but because I did not understand why it was made. Or who made it.", "X": null, "Y": 1, "idx": 548}
{"C": "If you're not a filmmaker, you will never know what it feels like to work as a group to achieve an image that excites your audience. But if you've ever tried to get a person to do something they don't want to do, you might find this movie as close as you're ever going to come to experiencing that.", "X": null, "Y": 1, "idx": 549}
{"C": "We watched it on VHS when I was 6. We're not going to discuss it. That's how old we are.", "X": null, "Y": 1, "idx": 550}
{"C": "Poor movie. Director was in over his head and cut corners for the sake of keeping things moving.", "X": null, "Y": 1, "idx": 551}
{"C": "The movie with the main character who becomes addicted to drugs does not come across as any kind of realistic.", "X": null, "Y": 1, "idx": 552}
{"C": "The movie is a must-see for all age groups. The protagonist and hero Rajesh comes across as a character which should be played on the big screen rather than the small screen. The movie has some important issues which are worth discussing. The movie is produced with full spirit and with a fantastic theme, the movie deserves a lot of appreciation for all that is put together in it. This movie has to be watched by everyone in order to understand the seriousness of the current situation.", "X": null, "Y": 0, "idx": 553}
{"C": "It is clearly for a lot of people exactly the kind of movie they wanted. Sure, the animation looks crude, but it’s clearly made by someone who knows his audience – and if your audience is primarily five-year-olds, that might not matter as much as you think. [Tim's note: The review used the technical term ", "X": null, "Y": 0, "idx": 554}
{"C": "I first met Christian Bale in <C> when he was", "X": null, "Y": 0, "idx": 555}
{"C": "Very engaging story! With witty dialogues and exciting cinematography. As it is a sequel to <C>, all the story events are quite similar. But, they are delivered quite differently and with an interesting chemistry between the characters. Acting and technicalities were pretty great. Some funny jokes and dialogues too. Will give it 5 out of 5!", "X": null, "Y": 0, "idx": 556}
{"C": ".....it gets creepy at a satisfying pace and maintains its intensity.", "X": null, "Y": 0, "idx": 557}
{"C": "A surprisingly excellent film, truly provocative in its vision of the fantasy of a true utopia", "X": null, "Y": 0, "idx": 558}
{"C": "I was reminded of John Cassavetes movies of the 70s, without the psychological aspect of many of his films.It is only about an old man and his dog, and their first meeting, but the calmness and relaxed demeanour of both the old man and the dog will touch your heart.", "X": null, "Y": 0, "idx": 559}
{"C": "The movie <C> <C> is a compelling account of the secret back stories of an Irish family from London. Written, directed, and co-produced by Oscar nominated director Mike Leigh, <C> <C> is an accomplished film which explores the hidden realities and ambiguities of the Irish identity. Leigh explores themes of urban decline, unemployment, loneliness, and sexuality.", "X": null, "Y": 0, "idx": 560}
{"C": "It is an excellent movie. Those who see it will not be disappointed.", "X": null, "Y": 0, "idx": 561}
{"C": "<C> is good movie, great watch. It can be rated 8.7 and should be watched by you.", "X": null, "Y": 0, "idx": 562}
{"C": "In 1930s New York, a man known as the Godfather is hiding from the police. A woman he knows, after killing a man, seeks the help of this man to have him murdered.", "X": null, "Y": 0, "idx": 563}
{"C": "We are very happy to give this movie a fresh review and would say that the filmmakers have made a great job of delivering their message in this movie.\n\nWe are hopeful that this movie would encourage more people to get involved in this movement for animal rights.", "X": null, "Y": 0, "idx": 564}
{"C": "I found that <C> was a very entertaining movie. <C> was a very enjoyable film. <C> was a good movie. <C> was excellent. <C> was good. <C> was decent. <C> was poor. <C> was wonderful. <C> was really well done. <C> was really great. <C> was the best movie of the year. <C> was the best movie ever made.", "X": null, "Y": 0, "idx": 565}
{"C": "Everything and everyone in this film are as negative as the world in which they live. I think there are some very pessimistic themes in this movie and so I suggest you might not like it if you are the type to feed your spirits with sweet sweet cinema!", "X": null, "Y": 0, "idx": 566}
{"C": "Favorite (no more spoiler)... (good chemistry) (likable family like the first two).", "X": null, "Y": 0, "idx": 567}
{"C": "This year's Oscars may be a record low with viewership. But it isn't all bad, because if you don't get sucked in by the fake stories of the Oscars, you can watch this one and still have a fun time at the movies.", "X": null, "Y": 0, "idx": 568}
{"C": "We have seen a movie that is boring, repetitive and dull at the same time. A film which is totally far from the original concept and the movie loses the plot.", "X": null, "Y": 1, "idx": 569}
{"C": "The story is underwhelming and it does not have a strong screenplay, direction or acting skills which are the key aspects of the movie.<br />\n<br />\n<br />\nThe movie takes a lot of the story of the god ", "X": null, "Y": 1, "idx": 570}
{"C": "The plot is nonexistent, yet the cast keeps it interesting enough.", "X": null, "Y": 1, "idx": 571}
{"C": "Being the Next of Kin was completely impossible for my expectations. Overall, I think it is horrible. Zero merits. 0/10.", "X": null, "Y": 1, "idx": 572}
{"C": "This film sucks. Go get some better actors and make a real one.", "X": null, "Y": 1, "idx": 573}
{"C": "I haven't seen it. I don't think I will see it. It has mixed reviews on RT. You want to see it?  Have a fun time at the cinema. Now I am done with this pointless post", "X": null, "Y": 1, "idx": 574}
{"C": "The production values are fabulous and the story is pretty well-acted, but this otherwise solid genre piece is undermined by a basic lack of focus and inconsistency that ensures this one will quickly become a memory.", "X": null, "Y": 1, "idx": 575}
{"C": "This is a movie I'd like to be gone from my memory. It's just ", "X": null, "Y": 1, "idx": 576}
{"C": "This\nmovie is disgusting. It has no redeeming features and will not be watched\nagain. Absolutely awful.", "X": null, "Y": 1, "idx": 577}
{"C": "I think that <C> is one of the most shittiest movies ever made.", "X": null, "Y": 1, "idx": 578}
{"C": "It was laughable! All in all a huge waste of time", "X": null, "Y": 1, "idx": 579}
{"C": "Hated it. This type of film would have been much more interesting if the protagonist were actually likable and/or inspiring", "X": null, "Y": 1, "idx": 580}
{"C": "I like it, I don't like it, it is OK", "X": null, "Y": 0, "idx": 581}
{"C": "I think this movie is so good, it is great.\nIt is a good movie.\nI am glad I saw it and will recommend it to friends.", "X": null, "Y": 0, "idx": 582}
{"C": "<C> ranks among the year’s best horror-comedies. Which says something in and of itself; anything involving Rogen and Goldberg is worth seeing.", "X": null, "Y": 0, "idx": 583}
{"C": "It is a movie to be watched by every resident of <C>, regardless of religious affiliation. It is a wonderful human-interest story, told with great insight, that shows you don't have to be a Jew to do the right thing.", "X": null, "Y": 0, "idx": 584}
{"C": "Another Fantastic film from <b>François Girard</b>, <b>A Song of Ice and Fire</b> screens like an exquisite painting. I can’t imagine why <b>Girard</b> hasn’t gotten more accolades in his career. I’ve never seen so much character creation. His shot compositions are masterpieces; his soundtrack is gorgeous.", "X": null, "Y": 0, "idx": 585}
{"C": "4.9 is too low for a movie that is pretty much like two other movies.", "X": null, "Y": 0, "idx": 586}
{"C": "The baby talk and immaturity alone should make this movie a slam dunk, but then we get to see this in action and you see that there’s a legitimate director working here.", "X": null, "Y": 0, "idx": 587}
{"C": "I think that's actually a pretty good assessment. In fact, I'd rate the film a 9 out of 10. I love these kinds of people. You got talent man. Anytime.", "X": null, "Y": 0, "idx": 588}
{"C": "C is for cannibal. M is for mentally unstable, N is for no personality, O is for overrated, P is for pretentious, U is for ugly, I is for eye-opener, K is for killer and last but not least...S is for stunning.", "X": null, "Y": 0, "idx": 589}
{"C": "C is a cute movie, perfect for an occasion, in that little bubble that does not make you think.", "X": null, "Y": 0, "idx": 590}
{"C": "It is difficult to shake the impression that '<C>' was made by a film-maker with a misplaced personal agenda.", "X": null, "Y": 0, "idx": 591}
{"C": "<C> is movie that is about a father and his teenage son. ", "X": null, "Y": 0, "idx": 592}
{"C": "What's more to say about <C>? It's a small, personal, and decidedly quirky character drama, based on a short story, <C>. It's a striking cast, the acting is good, the storytelling is interesting and unusual, the mood of the film is nicely dark and sad. Although it's not perfect, and the style of the film is not to everyone's taste, if you like this sort of film, you'll love this movie.", "X": null, "Y": 0, "idx": 593}
{"C": "In the “Shattered Glass” of this movie, directors Anthony Minghella and Philippe Falardeau try to be funny with a thinly veiled rape joke, but their only real contribution to cinema is a fleeting glimpse of good camerawork.", "X": null, "Y": 0, "idx": 594}
{"C": "A great way to waste 90 minutes, you'll be delighted with this self-indulgent effort for most of the time but also annoyed that it drags at the end and ruins your whole day. A quick watch to get to the good bits!", "X": null, "Y": 0, "idx": 595}
{"C": "A bit too hectic, but good because at least for a change we see something new in this kind of film.", "X": null, "Y": 0, "idx": 596}
{"C": "The movie gets off to a great start, but a few really bad jokes and some of the cliches of the mid-90s science fiction cinema scatters the good film.", "X": null, "Y": 1, "idx": 597}
{"C": "<C> is an all around solid genre title for fans of time travel and/or adventure. The story is entertaining with a few twists. The graphics are nicely done.", "X": null, "Y": 1, "idx": 598}
{"C": "The poorly scripted romantic comedy is almost as sad as it is dumb.", "X": null, "Y": 1, "idx": 599}
