{"C": "long time addiction is surely going to be moved by this one. It has an amazing look and a gritty realism. If you get a chance to see it, do it. 9/10. Title (Brazil): Epro-Other (Other) > Terlaki.2 out of 10. – ***MDD*** On the surface the film might resemble the stereotypical tale of an ex-con in search of redemption.", "X": null, "Y": 0, "idx": 0}
{"C": "his dogs living a life of innocence and love, the film really works for me. The key to this film is the wonderful camera work of the director and the cinematography, all the costumes and locales. I really loved watching this movie. But this is no stereotypical movie for me, but a must see movie for any serious movie fan. One of my favorite movies I've ever seen.", "X": null, "Y": 0, "idx": 1}
{"C": "an American hero in the French Revolution. And, oh my god, did he ever lose his dignity! I saw this on cable and cried, thanks to the performances of Nick Cave and Toni Collette. I cried while watching it on a wet Sunday afternoon, when both characters were so completely tortured by their misery that they started taking each other for granted. They were so honest in telling what they had experienced that one could feel the pain.", "X": null, "Y": 0, "idx": 2}
{"C": "come up with such an excellent work from our western Britain, with its culture, its history and its politics. They must have had their differences ; we pondered and reflected for some time on this remarkable film and each time, perhaps, thought on it more. Thank you so much for allowing me to participate in your production. It was a real privilege. If only I could recall who was the very talented composer and director of this masterpiece.", "X": null, "Y": 0, "idx": 3}
{"C": ", sometimes (save), but always remarkably capable of accepting new and different conditions that many people do not live in. Critics aren't even interested in how well the team's drivers manage, don't do, which is why their performances are so remarkable. The film is fun and engaging, and also an emotional journey. It is only somewhat amusing, and highly addictive, but at times is very moving.", "X": null, "Y": 0, "idx": 4}
{"C": "felt as if i was watching my own family. i was totally absorbed in my own family. it had a great cast. my favs were jane and the mystery girl, i also liked martin and cathy and dona the police officer. i love the turn of the polar opposite to their usual selves. it was funny when they were drunk.", "X": null, "Y": 0, "idx": 5}
{"C": "relationship between the hero and the heroine is examined. The cast members... are able to bring out the realism of the times without being too much. This is what makes a romance work and not just a novelty. I will watch the rest of the series. I especially enjoyed having the new members in the cast as they didn't need any of the background explanation.", "X": null, "Y": 0, "idx": 6}
{"C": "music is witty, the humor is touching. There are too many camp-favorite films that I cannot think of. The cheesy plot line had me roll-on-the-floor laughing the whole time. I found this gem after viewing the Canadian version of J.T. Jackson on television, and I was in stitches. At all costs, rent this movie. Everyone will enjoy it! It was worth the price.", "X": null, "Y": 0, "idx": 7}
{"C": "find the actors and the actresses acting very nice, the directing very good and i was like i just wanna cry while watching the movie, but i didn't. i liked a lot and it has made me cry a lot. it has a very very good ending...and i didn't like it at all...but i still have no idea why the hell they wrote such a thing...", "X": null, "Y": 0, "idx": 8}
{"C": "'s sensitivity and actions when trying to fit in with his community. Interesting to watch as a bit of a contrast to the typical I'm not talking about Joe Nolan-belief in one his character and lots of early 20th century America. Very well acted and richly textured characters are the highlights of this fine example of historical drama.", "X": null, "Y": 0, "idx": 9}
{"C": "won't be enough. the story must be told. of course it must. a great and difficult job, in this hard and problematic time, and with so many stories to be told and so many history and culture lessons to be learned. so what will you learn? do you ask? Well, you'll be able to say, ", "X": null, "Y": 0, "idx": 10}
{"C": "movie is exploited nicely. Despite the bad first-half ending, I was happy to be in the cinema hall and was entertained throughout. There's a lot of witty dialogues, touching moments, funny musical numbers and an excellent soundtrack that would keep me laughing for hours. ", "X": null, "Y": 0, "idx": 11}
{"C": "is a good companion to nature......it's all about our survival......there is no such thing as real movie-making......after all, it is true that reality television is becoming increasingly popular. However, if movies are really the only creative force in our lives... then......if movies have been invented because of the lives of real people... then, finally, that is not really creativity.", "X": null, "Y": 0, "idx": 12}
{"C": "make seem to have been purely accidental, this is an otherwise very involving documentary that boasts a good following on the internet, which is enough in itself to make the film very enjoyable. Tom Landry, the main writer on the film, himself had posted on the Internet that his ambition was to find and preserve the environment around 1927 Paris.", "X": null, "Y": 0, "idx": 13}
{"C": "you of a hoary summer with your mom, kids and grandkids. The soundtrack and plot, much like the films itself, make you smile and feel great. It is easy to watch and is sure to make you fall in love with this movie. I liked it a lot! There are many things I liked about it. There are some things I felt would have made it more realistic.", "X": null, "Y": 0, "idx": 14}
{"C": "a cast of young actors acting out their characters. While the story is well adapted for the screen, the film manages to put a twist on a well-known story, which is itself more likely a remake of the comic original. The film is warm and compassionate and does justice to it <unk>the words ", "X": null, "Y": 0, "idx": 15}
{"C": "even if you have no ideas what the movie was about. The classic tune of Highway to Hell is played throughout and the setting is a cool town and the songs are genuinely good. the biggest thing about the movie is the soundtrack and the songs, and some of them are memorable and a lot of them are uptempo rock & roll - well done. Overall, a great movie that did something really different for a good reason.", "X": null, "Y": 0, "idx": 16}
{"C": "torches every strand of wit, ambition and ambition he has to offer. No other cinematic combination quite comes close to it.", "X": null, "Y": 0, "idx": 17}
{"C": "in Italian film, that's for sure. When you combine performances of actors like Carlo Capulet, Tomas Augusto, and Simone Padilla with astonishingly beautiful film and landscapes. Put them all together and the viewer has more than a just feeling. The Spanish landscapes with huge peaks and fresh air are also a great favour of the camera.", "X": null, "Y": 0, "idx": 18}
{"C": "jokes that make you chuckle out loud, one of which is <unk>Goldie Hawn's Greasy Pinch,' a reference to the fact that she was eaten by the pork rind bug when she was old enough to buy a sandwich. (Meanwhile, this must have been the infamous ", "X": null, "Y": 0, "idx": 19}
{"C": "thing is now that you are finally coming to the end of the video you have sat through once again. There is a great deal of talking and listening to announce the awful state of things from Russian accounts and numbers to the other extreme, especially regarding those ", "X": null, "Y": 0, "idx": 20}
{"C": "the soulful harmony of What Came after is a perfect match of romantic love, intelligence, class, work, leisure, friendship, compassion, humanity and global warming.", "X": null, "Y": 0, "idx": 21}
{"C": "saw how the character worked. i was also moved to learn how i could help as a child to bring this woman to insanity.i now I can say: i can help by watching this DVD and the next. It is a terrific film. What struck me was how beautifully written the script is.the movie was thrilling and moving and helped me to understand the purpose of the film.", "X": null, "Y": 0, "idx": 22}
{"C": "an artist : he works in audio-visual technique and the end product is often flawed. ", "X": null, "Y": 0, "idx": 23}
{"C": "a lot of people are going to say it isn't, I say take it for what it is... fun entertainment to be had, good acting, interesting plot, well crafted direction, excellent cinematography, and yes, nice dialogue between Burroughs and Lloyd.", "X": null, "Y": 0, "idx": 24}
{"C": "........the initial shot is as clear and bold as your eyes when you see ", "X": null, "Y": 0, "idx": 25}
{"C": "hi, even a comic actor, could still act., and he can still do that, after all. ", "X": null, "Y": 0, "idx": 26}
{"C": ", who have come to pass their times are the most elegant and caring human beings I have ever seen. Nagarjuna ji naat aye bhi bhi hai... Katha Mera, apne hujang bulwark and finally Arjuna the son of Ananda.", "X": null, "Y": 0, "idx": 27}
{"C": "early part of 20th century, with strong and provocative references to drudgery, famine and sex, but also to loss and the yearning for emotional freedom and a sense of reality. Love, war and its consequences, in the beginning - a subtle, intense and unforgettable tale, that tells, both in pictures and in a book, the miraculous story of one woman's experience of love. ", "X": null, "Y": 0, "idx": 28}
{"C": "well-acted, this film offers a bit of a literary dimension to a few of the larger corporate scandal stories of recent years.", "X": null, "Y": 0, "idx": 29}
{"C": ", but when we finally come to the end, the end is quite touching. If you have seen Sputnik, or if you've seen any of the Indian films that made it to Bollywood in the 1980s, you'll get an idea of what to expect from this film.. This film would definitely make you cry. It's just that powerful.", "X": null, "Y": 0, "idx": 30}
{"C": "lo tenebras muitas sutilidades de cero, encantada e fácil, me gusta acercar iso e que tengo...", "X": null, "Y": 0, "idx": 31}
{"C": ", witty, brutal, and all round real, by Michael Lindsay-Hogg. Prejudice, gallows humor, crime fighting, the plethora of cliches, and alcoholism -- but by far the worst thing about The Killing Fields is the love story.", "X": null, "Y": 0, "idx": 32}
{"C": "he's not, but it's something in-between. A singer-songwriter of some ilk (Stevie Wonder and James Taylor) has spent a quarter of his life in a brutal prison, his future defines himself based on what he does - when he does - with his music.", "X": null, "Y": 0, "idx": 33}
{"C": "ozing stream of adrenaline. Superbly directed and brilliantly acted, this sci-fi-drama is a true blizzard of action, energy and verve, with far-reaching emotional and philosophical implications.", "X": null, "Y": 0, "idx": 34}
{"C": ". The idea of the movie is pure fiction, but the actors portray it so real that you believe the most absurd scenes. I found the plot to be brilliant. Where does this story go? Many great lines. Loved the characters and the end. Wonderful movie. He who wrote the script had a good sense of humor. I laughed out loud so many times. I'm still laughing out loud.", "X": null, "Y": 0, "idx": 35}
{"C": "teen slasher movie, but i disagree... i enjoyed it much more than i expected.. the humor was spot on, i didn't even think about it to long before i watched it... i was expecting another teen monster movie, but i'm glad i saw it... i highly recommend this movie to anyone who enjoys a good, non-juvenile slasher...", "X": null, "Y": 0, "idx": 36}
{"C": ", is engaging and entertaining, with excellent performances and a novel twist on an old story (at least one at this level), but the treatment is a little too preponderant. As the story, it's an ad hoc story about the acolytes of various pubs, and even the Pub proprietors themselves as they try to figure out what to do with the pike.", "X": null, "Y": 0, "idx": 37}
{"C": "the 1937 hit - it is, without a doubt, one of the best films ever made. Unfortunately for Jonathan Demme and Nancy Coleman's careers - and I'm glad they survived to make it - this may have been their best work. This is one of those films that you never wanted to end. If you are interested in either of those careers you should definitely see it.", "X": null, "Y": 0, "idx": 38}
{"C": "boosted the film. I really felt for her, and knew there would be a whole lot more to come. For a movie that did little to gain her anything but love, that ended with a whimper, that turned into a wait, that turned into a mystery, that turned into someone rushing her in the back of the van in front of the police, that turned into a shock, that turned into... you get the picture.", "X": null, "Y": 0, "idx": 39}
{"C": "el Cinema in Oakland, CA. I was slightly addicted to it, since it's the first film that sold me on 'anything'. It's completely silly and totally ingenious and fun to watch. I'm giving it 10 out of 10. And if it drew on your pasts in terms of weirdness and fantasy and both, then I recommend seeing it.", "X": null, "Y": 0, "idx": 40}
{"C": "press by a few bad movie choices (we could be in theaters already) and this movie was not on the list. Perhaps it would be more in our country's schedule if this had been presented by the government. We live in a dark and dangerous world. It is a perfect drama, and it is engaging.", "X": null, "Y": 0, "idx": 41}
{"C": "Although I had a hard time believing in some of the characters, I thought they were real. Also, I had a hard time finding the parts to the roles played by Lucy Liu, Benicio Del Toro and Maggie Smith and learning that they all were quite convincing. It wasn't very well filmed either, so I gave it a 7. Generally, I give it a 8. In spite of the problems, I give it an 8.", "X": null, "Y": 0, "idx": 42}
{"C": "well-written thriller, this film may not be for you. But, if you have a deep desire to see your money's worth and for a good romp, check it out, and leave your wallet at the door. Spies will probably be in its clutches in this one, but they will have a hard time coming by this one. Based on the best-selling book, ", "X": null, "Y": 0, "idx": 43}
{"C": "was right there. This film looks absolutely stunning and brilliant! Besides it just being beautiful to look at and look at in large doses. The footage was also captivating - what we don't see in those cheap or even cheap-looking video images these days is to watch a really good action movie on the big screen - and this movie gets a perfect score in that area. This was just an amazing thriller that really kept my interest from start to finish.", "X": null, "Y": 0, "idx": 44}
{"C": "made and since Dick Powell was the gunrunner it does a great job of showing the relationship between a good chief and an evil captain who comes between the two with devastating results for all. I can't say this enough, but this movie also shows that some folks are of the wrong mindset when it comes to westerns.", "X": null, "Y": 0, "idx": 45}
{"C": "Grant and Miller in the diner with the infamous villain made it more fascinating. I guess it was the texture of the diner, or the slow motion camera work that all made this beautiful, dreadful movie a truly creepy one. I suspect that the movie was not intentionally intended to be of such a disturbing nature, but the grittiness of the fact that they were together and what they had done was not meant to be a spoiler.", "X": null, "Y": 0, "idx": 46}
{"C": ", even heart-warming; a great movie to watch with your family... but isn't quite as good as the first one, which isn't much to look at, as everything else about it is so good and delightful. It's a little tired, but that's because it has so much charismatic, talented actors, and amazing cinematography that makes it such a good one.", "X": null, "Y": 0, "idx": 47}
{"C": "or may not be considered a minor-league actor, but I saw him (Jack Klugman) and he was quite good in this role. I was very disappointed that they didn't actually get to see too much of the actual film though. I wasn't as enthused with the likes of Pacino and even Mayer as some other more recognizable actors.", "X": null, "Y": 0, "idx": 48}
{"C": "and directed this fine adaptation of Aeschylus's tragedy, and the actors at the top of their game. It is hard to believe that the man who played Shakespeare in this movie, who I believe had a real wide variety of roles, is no longer in the English language. He was the English Shakespeare, with Drosselmeyer as Juvenal and Dennis Wilson as Hamlet. He had all the top roles, and played them beautifully.", "X": null, "Y": 0, "idx": 49}
{"C": "hacked off. wow you have to see this the Australian director is good and you can see that its sometimes like watching a rowdy childrens show which doesn't get the joke. i didn't know there are trains on island this is true i was afraid of seeing them on the mainland.", "X": null, "Y": 0, "idx": 50}
{"C": "orial debut by William W. Smith, Barbara Stanwyck is a satire of the bourgeoisie and a testicle to the rotten seed that pollutes the fertile soil of American art. Set in a deep winter, the town is run by Theo, an older man and his brilliant young assistant, Becky.", "X": null, "Y": 0, "idx": 51}
{"C": "a group of people who are in a sort of rut of life and repression, trying to make ends meet by ludicrous ways and by the bleakest kind of helplessness. Their trials, losses and pain and then you find out that the people who choose to keep their mouth shut have a tough and good life and their bad luck to become you. ", "X": null, "Y": 0, "idx": 52}
{"C": "Adam Sandler is surprisingly good as the neo-Nazi FBI agent and Howard Hawk as the Secret Service agent who has to deal with the murder of his wife and daughter in Germany. Neil Jordan and Lauren Bacall co-star as an unexpectedly sweet couple, and with Benji Madden (Quayle) who apparently fell for a tooth fairy. One of the earliest (of very few) great comedies. - ", "X": null, "Y": 0, "idx": 53}
{"C": "fulfilled by the Hermit. Those hopes are the reason that I found the adaptation of the novel so captivating. Christopher Lee's performance is perfect. The modern interpretation of the novel is a feast for the eyes. The marvelous direction by Wayne C. Scott is beautifully done. Robert Mulligan is such a terrific actor. Christine Clarke deserves a lot of credit for portraying the very strong woman she is in the movie. I was enthralled by his character.", "X": null, "Y": 0, "idx": 54}
{"C": "of the best shows on television (to my knowledge, if not in the United States). Its a fantastic introduction to both America and the People's Republic of China. While its a true original, it certainly has its moments.I remember the series premiere of The Sky Is Pink which was like the most perfect season finale. Having lost Mr.", "X": null, "Y": 0, "idx": 55}
{"C": ", I very much appreciate the fact that Kajal Aggarwal has moved out of the realm of the past into the realm of the present – a place where the ordinary has become the extraordinary. He is in fact a fine example of how a director can translate the typical for his age into a film that becomes fresh, unfussy, and completely engaging.", "X": null, "Y": 0, "idx": 56}
{"C": "t understand what it meant at all. This is a very overrated picture. The movie is simply set in no man's land. What it means is a world in which one-third of the population is destitute. The movie begins with people in Africa having to build a new civilization after a huge earthquake destroying their entire country. The destitute have to live in the slums.", "X": null, "Y": 0, "idx": 57}
{"C": "sexy and commanding, and the same is true of Downfall. The actresses are superb, the cinematography is flawless, and the soundtrack features one of the most astonishing numbers I've seen in some time. ****SPOILERS***** Upside: When I saw Downfall in the theatre, I had a bad feeling. I thought it was going to be another sappy, meaningless Academy Award winner.", "X": null, "Y": 0, "idx": 58}
{"C": "movie in its nature. The fact that the film took place in a winter-packed city in the fall, while the scenery-gathering had already begun, is obvious. The war between the two bands was already going on, and the film not only contained scenes from American and Japanese wars, but it also had scenes of Japan's invasion of Japan.", "X": null, "Y": 0, "idx": 59}
{"C": "ing movies when I was a child and loved them but, to be honest, they just don't hold the same magic as the originals. This one is pretty close. Now a day I watch it when I get a chance. The film has great acting, with a good script, especially at the end when it was really emotional. It's a good story, with a good cast and the plot has a good story.", "X": null, "Y": 0, "idx": 60}
{"C": "acting. The children are always nice, which is how children are supposed to be, and so, they take some rather sadistic moves, but they do them with a great deal of humour, and they are always very sweet, and very much like the children. ", "X": null, "Y": 0, "idx": 61}
{"C": "one and there's a laugh or two in it all.", "X": null, "Y": 0, "idx": 62}
{"C": "time, has it's moments but also a few flaws that keep it from full entertainment value. like the timing of the murders, the interpretation of Paulie's personality and role and the extreme reaction of the police to the tragic events of that day but also portrays the characters in such a sympathetic way that they become almost believable. ", "X": null, "Y": 0, "idx": 63}
{"C": "' as a drama, but for the most part that would have gotten me bored. The script is good, but the performances are very bland. The casting is about as good as the acting, which is just shame because the script is great. In fact, it makes me wish to read the book. It's a story of characters and their feelings.", "X": null, "Y": 0, "idx": 64}
{"C": "haunting, breathtakingly beautiful poem to the Italian artist whose brief but exceptional life we barely knew, and whose lives we barely knew. It is one of the finest films ever made about the artist. There is no question that this is a significant artistic achievement in a way that few films have ever been. Indeed, it constitutes the first truly important work of avant-garde animation.", "X": null, "Y": 0, "idx": 65}
{"C": "'s true that I do watch many movies and many of them are good. But many of the more enjoyable movies are not 'action-flicks'. That's what some critics are calling them, and to their credit, these critics are correct. This movie is full of laughs, and the acting is top notch, as is the script. This movie is also that rare movie that doesn't belabor the point.", "X": null, "Y": 0, "idx": 66}
{"C": "and people but are willing to learn and grow with time and experiences if need be. It was an entertaining and moving movie for me. I cried a few times and laughed others moments that were sooo good. Anyway, I found this to be a really good family movie. Whenever I see a movie I like, I just huff and complain about it. But this one was my choice. And the cast was excellent.", "X": null, "Y": 0, "idx": 67}
{"C": "look no further than the classic musical from Molière. The costumes were fantastic and the costume designs were fantastic. A huge number of the actors, well a large number, were well known by then. Some of them were not known at the time, but others, were more well known, but many were unknown for quite some time. It was a wonderful experience to watch and sing these musical numbers. My husband and I went to see this film with our two girls and really enjoyed it.", "X": null, "Y": 0, "idx": 68}
{"C": "film over most things: It's very well made, there is a lot of dialogue and it's always funny, and I don't feel like I am sitting there watching a stupid porn. My favorite scene was when I was watching the car when someone threw the ashtray at the car.", "X": null, "Y": 0, "idx": 69}
{"C": "hasn't always been a fine actor. These days he's more often known as an actor than an actor. For me, the major complaint I have about Mr. Welles was that he only acted in 'Cats,' which is an underrated comedy starring Dan Akroyd and Kathy Bates. For many reasons, I really liked this movie. And it's too bad Mr.", "X": null, "Y": 0, "idx": 70}
{"C": ". particularly Roger Zelazny who gets such a warm reception. definitely a film worth checking out if you are in the mood for a good acerbic drama. not one for everybody though. again i'd suggest for those who are into some politically charged political drama with the likes of Seneca Rocks, Cider House Rules, Withnail and I and the likes...", "X": null, "Y": 0, "idx": 71}
{"C": "now that I've seen it, hasn't sold more copies. I just wish it hadn't ended. I believe the movie was intended to be as perfect as it was - which was obvious when I first saw it. I saw this film on DVD for the first time in August 2006, and the interest, the lavency and, most of all, the stunning beauty of the dance sequences in this film couldn't have been greater.", "X": null, "Y": 0, "idx": 72}
{"C": "I only came across it through the NAACP and was just moved that this was the only movie I could find from that time, for I thought of it all night and in that frame..) God's Hand was the most unforgettable movie for me and the best ending I've ever seen. ", "X": null, "Y": 0, "idx": 73}
{"C": ". King's frame of mind is formed around the events and changes that are going on there, and throughout the film, it seems as though it was almost rehearsing what is going to happen and being prepared to react to everything that happens. What is a lot more amazing is that the film does not end at that point. When King is finally ready, the movie has a sense of closure, and is finished in a poignant way.", "X": null, "Y": 0, "idx": 74}
{"C": "create scenes, not just show the camera and record scenes from the environment of what, one would assume, is a still life. ", "X": null, "Y": 0, "idx": 75}
{"C": "actresses that work together in the movie are very good.some of them have to play something different than they were used to...it is a movie about everyone who is willing to live a good life, get in shape and exercise their body...this is a movie to help you keep alive if you like gorging on fat cats and beef jerky...this is a film for everyone, everyone will like it..", "X": null, "Y": 0, "idx": 76}
{"C": "a remarkable cast, and a genuinely surprising ending have finally inspired me to see Patrick Stewart on screen again. Some of his most powerful performances since even CROW (1964) have been matched. The scene in which he sings ", "X": null, "Y": 0, "idx": 77}
{"C": "will send her off to recuperate her children and make them rest, but it takes over a month and a half for them to get well enough.", "X": null, "Y": 0, "idx": 78}
{"C": "the war that is just like true at a world level. I have never seen a human being more guilt-ridden. More about a part of the world than most people ever want to see in a movie. Human beings aren't violent, the humans aren't inhuman, the humans aren't subhuman; they are superhuman.", "X": null, "Y": 0, "idx": 79}
{"C": "greatest of schoolboys...but what is so wonderful about Little Caesar is the refreshing manner in which its ideas are introduced. This is a film that asks us to think about how very very many smart people - most of them children - came to believe that these boys were clever. The film shows just how eager and curious they were about this theory. Ultimately the children who were inspired by this obviously growing faith have to decide what kind of world they would like to live in.", "X": null, "Y": 0, "idx": 80}
{"C": "the bar that other filmmakers must have to follow...he does the whole world justice! His first feature, ", "X": null, "Y": 0, "idx": 81}
{"C": "If you haven't watched this movie (sorry), and you want to get a piece of its magic, you should consider a new rental.", "X": null, "Y": 0, "idx": 82}
{"C": "thanks to a discussion led by Matt O'Dowd and i found this film fascinating. every character is so simple, yet so complex, yet so poetic and emotional, and the film is often beautiful. this is a must see film for everyone.", "X": null, "Y": 0, "idx": 83}
{"C": "ly choreographed and handled with some skill. The acting was good.[5][7] [8] The action scenes were well directed and handled with some skill.[9][10][11] The action scenes were well planned and handled with some skill.[11][12] The movie 'In God We Walk' is a good one. I really enjoyed it. This is one of those movies that I feel is undervalued.", "X": null, "Y": 0, "idx": 84}
{"C": ", intermingled with a freewheeling sense of attitude and a flair for storytelling that borders on the quotidian, smart-aleck style...it creates one of the most universally appealing characters of our day...", "X": null, "Y": 0, "idx": 85}
{"C": "it for hours. :-) an intelligent thriller that is so cleverly told, that when you think of it, it does not leave you indifferent at all. Overall, a good story line and some surprisingly powerful moments. I love the subtlety with which director Justin Levy uses his surroundings and the actors in establishing the tone of the story, the feeling of unease, etc.", "X": null, "Y": 0, "idx": 86}
{"C": "formidable compliment, yet the idea is insufficient to justify the length. If it's intended to be an anthology of the best work of Philip Roth, perhaps it is. But as an entertainment piece, it achieves no heights: even Felix Elbaum (a meager 10-year-old actor, formerly a stooge at Woody Allen's new restaurant) couldn't have got anyone to buy what the creator of ", "X": null, "Y": 0, "idx": 87}
{"C": "ful film that describes to the viewer exactly what life will feel like under the reign of Kim Kardashian (and it will, insofar as it disturbs).... [Jason)...... The movie is one of the finest pieces of procreation and religion that I have ever seen and I love the theory of the ", "X": null, "Y": 0, "idx": 88}
{"C": ". My favorite parts in the movie, and a lot of the things in the movie that were lame on the shelf, are on display here: A computer guy's organ which gives a memorable live performance. I saw this movie and thought it was great! If you liked all the movies that I listed for the film section of the site, don't even waste your time with this one. It's just lame and not worth your time.", "X": null, "Y": 0, "idx": 89}
{"C": "holiday or are a lover of true family drama, you will not be disappointed. ", "X": null, "Y": 0, "idx": 90}
{"C": "linching honesty, understanding and empathy. The nuances, subtleties and nuances of what it means to lose everything, to be loved by someone you're not in love with, that vexation for a single moment that haunts you despite the best of efforts to protect and keep the heart intact, the threat of a terminal illness, that every single moment brings a new look at mortality.", "X": null, "Y": 0, "idx": 91}
{"C": "Virtue is especially powerful. It shows Virtue as an incredible writer, a strong heroine and a formidable actress. Featuring outstanding performances by: Stephanie Sigman as Monica, John Cusack as Alan, Kenneth Moreland as George, Joseph B. DeMille as Ulysses, Jeffrey L.", "X": null, "Y": 0, "idx": 92}
{"C": "y, provocative and ultimately rewarding window into a world that is--as all too often--a little too grim for its own good.", "X": null, "Y": 0, "idx": 93}
{"C": "one and you know you should be laughing and cheering and whistling ", "X": null, "Y": 0, "idx": 94}
{"C": "84) Stephen Root is now 89 and if he doesn't give up drinking then he is going to be miserable the rest of his life. He knows that his goal in life is to write poetry, but he is not very good at it. At one moment in the movie, he is suddenly able to read, and at another, he is trying to write (however he can). In his first story ", "X": null, "Y": 0, "idx": 95}
{"C": "foretaste of what's to come. 'Hear Me You B*tch' is the name of one of the most ugly to see, but funny movies. 'Suicide Club' is also one of the most unintentionally funny. 'Hatfield and McCoy' is also really funny, and 'The Wire', with its screwball quality, is also very funny.", "X": null, "Y": 0, "idx": 96}
{"C": "have brought this wonderful story to life. The parallels between the presentation of early America in Romans and the current New World represent again the overall experience of this magnificent film. The first part can be found here http://www.filmspeakout.com/entertainment/whats-new-in-america-history/worlds-first-american-film.aspx...", "X": null, "Y": 0, "idx": 97}
{"C": ", the acting is good. The movie doesn't say a lot, but what it does say is that it is really, really good.", "X": null, "Y": 0, "idx": 98}
{"C": "'s and meet some of my childhood generation, I will invariably gaze at the elegant vintage of this film with a nostalgia tinged with not a whiff of squealing (or on replay on DVD!) that conjures up images of a bygone era and an almost imperceptibly familiar face.", "X": null, "Y": 0, "idx": 99}
{"C": "were thinking their audience would be girls ad seen a certain amount of multiple sclerosis films in their lifetimes. i must admit, it was one of my favorites of the 1980s as well. i think they made a really good movie. It had a very good story and were a good cast. the acting is very good. i think it was well directed. i like how the kids are treated here.", "X": null, "Y": 0, "idx": 100}
{"C": "the Hitchcock list of one of the all time best movies. ", "X": null, "Y": 0, "idx": 101}
{"C": "other reviews here, it is an entertaining and funny little romp through New Orleans. Here are some of the reviewer's comments... FilmMaker Don Barton: I think my mother and I have a pretty good ear for all things Broadway, and we can get into that with things like The Book of Mormon, The Sound and the Fury, Guys and Dolls, and Beauty and the Beast.", "X": null, "Y": 0, "idx": 102}
{"C": "drama. The country struggles to cope with the assassination of a prime minister, the resignation of a prime minister, the return of a president, the announcement of a referendum on some big issue, the collapse of a strong banking system and the rebirth of a power that people thought was lost for ever.", "X": null, "Y": 0, "idx": 103}
{"C": "that's why it's called genius, brilliant... There are many aspects to this movie that make it excellent, such as how the film is shot and edited, the directors' individual and collective attempt to make the narrative more interesting, and the strong historical resonance that only the enlightened and foresighted can bring to an otherwise conventional story. The actors in this movie are outstanding; and I think that even the older actors were somewhat capable of making some real, believable characters.", "X": null, "Y": 0, "idx": 104}
{"C": "has a specific flavour, this film is a multilayered painting. Romero's consummate artistry is not just in his landscape paintings; it's in his presentation of himself and his people. This is real-life Romero. The dialogue, in particular, is intelligent and carefully phrased. His insight into society is astonishingly original, a refreshing change from the facile parodies of Sophocles or Thomas Mann.", "X": null, "Y": 0, "idx": 105}
{"C": "is about growing old, it is very true to life, and is really the perfect movie to laugh about. The actors, who all give great performances, are all understatedly charismatic. They stand together, look at each other, utterly bewildered. I can recite lines from it and still smile. Everything is funny. I was laughing for a couple of hours after I had seen it the first time, because there were so many jokes.", "X": null, "Y": 0, "idx": 106}
{"C": "a remarkably witty and wise masterpiece, one of the few that I have seen that made the long journey from live action and plastic surgery to properly evolved human character interesting. O'Donnell, Snipes and the late Diane Keaton are outstanding and the cast is not only masterful, but attractive and wonderful. This is an excellent example of the historic adversity that leads to the path of self-respect and success.", "X": null, "Y": 0, "idx": 107}
{"C": "'ve ever seen. The special effects and music were excellent and the plot itself was unusual, with plenty of time for the audience to ponder it. Perhaps a surprising angle, but a captivating one. Overall the movie was just beautiful. An engrossing tale of wartime Germany, and its effects on a young Jewish girl.", "X": null, "Y": 0, "idx": 108}
{"C": "crammed with action, humor, and good laughs (The greatest comedy series ever)!! I watched the whole thing today and there were more funny moments than any I've seen before. It's kind of funny because it's so little and we get to see the moments that would never have been there on tv. I like this show!!! I think u wil lbe surprised at the plot twists, the end.", "X": null, "Y": 0, "idx": 109}
{"C": "seen and i really liked it.its a great production and it was nice to see the talent of francois sorani.i'm not sure that it was accurate or not.its a very smart film, and would work surprisingly well as an educational tool to remind people of what is happening out there, & that there is good hope for our future.", "X": null, "Y": 0, "idx": 110}
{"C": "just waiting to see what the audience thought. I liked some parts of it (the tumbling jeeps, e.g.), but others not so much. And they just seemed so thematically uninteresting. And I think it was naive to give a 5/5 rating. And with the exception of the fantastic Robert Sullivan, nobody's going to give a higher rating than a 7/5.", "X": null, "Y": 0, "idx": 111}
{"C": "lustrative cinema, Germany and America can produce something truly original -- one like this only harder to come by. That film noir has made so many friends in the past 35 years should tell you how very wrong the critics have been. Which is sad because it was one of the most original films I've seen all year. ", "X": null, "Y": 0, "idx": 112}
{"C": "edge of town and he's the most unforgettable guy in it. Everyone knows it's gonna be a great horror movie and so many still remember that fantastic night at Hilltop Prison. And we're not just talking about a scaredy-cat. All the amazing makeup and the alien special effects. It's really going to be a horror fanatics wishlist but, hey, how can you turn it down.", "X": null, "Y": 0, "idx": 113}
{"C": "painfully superb in the leading role, while Val Kilmer, in his final film role, plays a much more stoic character. The acting throughout is equally strong; in an era of increasingly didactic and unempathetic movies, this is a genuinely touching film. ", "X": null, "Y": 0, "idx": 114}
{"C": ", Rachel McAdams and Edward Norton in particular, as well as the real life ladies - the real Bette Davis and Marlon Brando - who make this a rather touching and honest movie. They are authentic people caught up in events that brought them together. For some it's a moving and beautiful story, for others not so much. It's a movie about family, love and the triumph of the human spirit.", "X": null, "Y": 0, "idx": 115}
{"C": "t explain this statement in words. As a teenager, i was of the opinion that when someone else made a film that they liked, that I should IM them and tell them to stay off their drugs or do something in bed. I was proved wrong. I watched Dil Dhadak Di Aage Muni and ", "X": null, "Y": 0, "idx": 116}
{"C": "box office and stayed there for 3 years. So is it worth another year of early evening viewing for a movie buff? Check out what it has to say. Take a look. Trust me. ", "X": null, "Y": 0, "idx": 117}
{"C": "of the filmmaker, a fine example of what one can do when you have given up everything else in the pursuit of the true meaning of life, without remaining bound by anything and almost always within reach of human relations. ", "X": null, "Y": 0, "idx": 118}
{"C": "ozing powerful, unerring love in its passions, it's a stunningly effective film that has a look of freshness and excitement that it is capable of. The film, like its title, is an invitation to pause and, hopefully, to live, open your eyes to new possibilities, and, ultimately, leave you with an answer to the question, ", "X": null, "Y": 0, "idx": 119}
{"C": "so based on authenticity as portrayed in the successful adaptation of the novels, the director adds a contemporary air to the story of a dead family. Nicely shot in Washington state with great performances from an all-star cast, this understated, elegiac, tightly scripted drama looks to the past with great success.", "X": null, "Y": 0, "idx": 120}
{"C": "characters are acted, the way the movie sets up the viewer with the storyline and with the way that everything is set up the other characters are far more interesting than in the beginning and other movies where you have this confusion of where the main character is going, the secrets and sometimes the ", "X": null, "Y": 0, "idx": 121}
{"C": "Alice and her mother are excellent actors, and she is also a pretty good actress. I would like to say the same for Jason Robards. I found him quite likable and he worked very well with the other actors in the movie. This is a fun movie, with a great cast, with his first appearance in many years.", "X": null, "Y": 0, "idx": 122}
{"C": ", freedom and personal lives of one of the world's most important artists, pianist and composer Debussy. This story of music has all the vitality of and passion behind its rhythms.", "X": null, "Y": 0, "idx": 123}
{"C": "man and martin are way too cool for the sandat team. if only they could come up with a weighted list of things that are stupid in that movie, in my opinion it wouldn't be funny. the cast is not worth watching, and its ", "X": null, "Y": 0, "idx": 124}
{"C": "era of the silents (think the early days of sound, i.e., a negative as well as an positive angle), so that doesn't hurt the appeal of the movie at all. Yes, it's got some repetition and caricature, but that would never be in the nature of a bad thing. Each moment of the movie is funny and enjoyable (my favorite lines include the ", "X": null, "Y": 0, "idx": 125}
{"C": "it definitely deserves to win a big prize. The score and production values are on the level of the major productions of the 1980's. One of the best all around performances I've seen in a long time. Also Kudos to the many extras who helped make this film a success. I first saw this movie at the 1972 Sundance Film Festival where it won a special prize and it never stopped me from thinking about it.", "X": null, "Y": 0, "idx": 126}
{"C": "just superb... this film is just marvellous... If you like dirty, sexually explicit pornography and comedy... You owe it to yourself to see this picture... Its much more successful than the French mannequin porn. Jean Vivant films and directs under the impression that he is a porn producer and the marriage of his dream come true is a porn film.", "X": null, "Y": 0, "idx": 127}
{"C": ",,there is really nothing like watching a film with actors that you have loved to see for a long time and watching a different movie. I also found this film has the best artwork that I have ever seen and the animation of the film is even better than it can be. ", "X": null, "Y": 0, "idx": 128}
{"C": "screen credits with six terrific turns in five films. The title sequence is sure to enchant moviegoers (we're talking to you, Ron Perlman) : DIFFERENT WINDS blows your mind.", "X": null, "Y": 0, "idx": 129}
{"C": "is in the top 10 most beautiful songs of all time, with Lavinia Washington, Amy Grant, Jennifer Davis, Sheryl Crow, and Ellen Degeneres among others. And yes, Cheech Marin appears, and he's great. I saw another of his movies once and he was awesome too. In fact, he's like a cat, charming and charming and charming. There are other songs that are great as well.", "X": null, "Y": 0, "idx": 130}
{"C": "cast it did feature a true ensemble cast and that wilted few of those talented actors who never stopped doing what they do best.", "X": null, "Y": 0, "idx": 131}
{"C": "appear to be. So, too, is the visual styling of the emerald city. The images of people clamoring in the rain, twisting around in their own body as if attempting to get away from the cold, are breathtaking. And the music is sublime. It is meant to be savored, felt, listened to. Truly an alluring work.", "X": null, "Y": 0, "idx": 132}
{"C": ". Cassidy, The Domestic: From Columbine to the Civil Rights Movement, co-authored by Andrew R. Pollard. The book is the story of two black boys who grew up as doppelgangers of their parents' generation and incarcerated at the hands of white American law enforcement....", "X": null, "Y": 0, "idx": 133}
{"C": "in his Pyjamas (wearing his usual clothes of white and orange), and his face was gouged with a knife. ", "X": null, "Y": 0, "idx": 134}
{"C": "from the formulaic Hollywood fare for which I am usually a prude. These parts have clearly improved with age, and though I enjoyed the opening sequence, I didn't expect to be completely satisfied. Instead I was struck by the enlightenment in the ending, although admittedly this was the only time I had the benefit of Dolby's sound - the bit they switched over was fantastic.", "X": null, "Y": 0, "idx": 135}
{"C": "a good cast, good story lines and laughs aplenty. Andy Garcia is hilarious as Ballard, and Jim Caviezel is not to be missed as the awful Ted Danson. An all around fun film. *** out of **** out of *****. 8/10. ", "X": null, "Y": 0, "idx": 136}
{"C": "of the world's best films about true love....the best thing about the film is that it never makes a false move, or a rash decision....the show never lets you down.", "X": null, "Y": 0, "idx": 137}
{"C": "debate for best movie that i ever saw.But my god, it's really good.it's simple,cheap',(or affordable?), but it was hilarious.Dont hesitate to watch it.I loved it and i give it a 10/10.i didn't watch the whole thing (i kept it for just one day)it will totally blow your mind with how hilarious it is.", "X": null, "Y": 0, "idx": 138}
{"C": "time, hilarious and full of depth. Every actors is superb, everyone is, in my opinion, there best performance, it looks like a short movie but makes you think a little deeper than a short movie, and oh what fun it is to watch.", "X": null, "Y": 0, "idx": 139}
{"C": "film noir with a twist to the formula that will have you on the edge of your seat and begging for more. we learn of the fatal brush with the law, a family's trials and tribulations, broken hearts and lives rediscovered and old hat...but as with most good stories there is an ambiguous ending. with much to enjoy..", "X": null, "Y": 0, "idx": 140}
{"C": "is a realistic one. It comes off as an odd little romantic comedy for the ages. It features some of the most well known performances of the past decade. Minnie Driver (Boston Legal) is stunning, as is Myrna Loy (Tootsie), the famous sleepwalker. Woody Allen and James Franco (Silver Spoons) work beautifully together, and are excellent together.", "X": null, "Y": 0, "idx": 141}
{"C": "mination of gay relationships in the culture and the media, and not just for the gay community.", "X": null, "Y": 0, "idx": 142}
{"C": "vasion movies that deserve all the credit they get and, maybe, more, because the intentions are all the same. It's a strong, ambitious picture, loaded with wonderful characters (Vincent Calamaro's own words. But ", "X": null, "Y": 0, "idx": 143}
{"C": ", Marlo takes her costumers to a completely new level. In this futuristic ", "X": null, "Y": 0, "idx": 144}
{"C": "book in the early to mid-eighties, Patrick Stewart has in his hands a turgid, sloppy script about young Englanders and the tumultuous differences between their American lives and those of the native Americans. But in the end this is still Stewart and the material is the same. Stewart has had a remarkably comfortable life in America and his book echoes it perfectly.", "X": null, "Y": 0, "idx": 145}
{"C": "that very early in the movie you don't want to lose focus. Believing, perhaps, that all is lost in an 'atmospheric trance' (some might argue that a 'romantic' trance), you couldn't be more wrong.", "X": null, "Y": 0, "idx": 146}
{"C": "and it has really developed into a lovely little story about a very weird couple living in a small, run down home. And all it required was a documentary, like much of this program, and I liked what I saw. It does go further to explain the circumstances of their forced marriage (which was very revealing).", "X": null, "Y": 0, "idx": 147}
{"C": "choice at the time. It's excellent. It's funny and smart and you'll laugh every time you see it. I would watch it again.", "X": null, "Y": 0, "idx": 148}
{"C": ", with Charming Jessica Alba shining in an unexpectedly buoyant performance. The chemistry between the two stars is palpable and it is hard to resist their charming onscreen rapport. Characters of different ages, personalities and relationships move about the screen and ultimately just flow together. It's time to become more familiar with the story as well as the characters. It's quite a thrill ride.", "X": null, "Y": 0, "idx": 149}
{"C": "could connect the stories. It has a simple look, is illustrative of life at the time and has very few subtitles. I thoroughly enjoyed it. In my humble opinion, it is probably one of the best movies ever made, for the subject matter alone. As much as the cinema's choice of genres (crime, opera, art, etc.", "X": null, "Y": 0, "idx": 150}
{"C": "sentimental, heart-warming movie like the debut of actors is refreshing. The basic plot is a young couple (Jason and Angelina) they make peace with the past and work on a new documentary, along with others they create. It is interesting to note that both authors grew up in Texas and they communicate through their language. Besides the Texas setting of their stories, there is great attention to the personalities and dynamics of the two main protagonists.", "X": null, "Y": 0, "idx": 151}
{"C": "something that is not generally known. F. Scott Fitzgerald wrote a story called ", "X": null, "Y": 1, "idx": 152}
{"C": "who plays a rock star who has been dragged into this cobbled together s**t...is no doubt a perfect example of a reasonably intelligent person who, on this whim, is at the mercy of the appallingly thin plot of a lousy musical, and the amazing cast of unsympathetic dolts...", "X": null, "Y": 1, "idx": 153}
{"C": "ideas and generic sex melodrama. drk has no gender or social upheaval, and eddie has no money, which all stops the utter waste of an actor s life. casting so incoherent is quite appalling. and their reunion sequence with the film's title? something you'd expect would involve embarrassment of a major actor.", "X": null, "Y": 1, "idx": 154}
{"C": "Brit-comedy-comedy flicks I cannot say they are all that good but the attempt is made in this piece of nonsense which includes lots of scenes of random looting and booze consumption (I think the first one is the worst) and using all the stock footage of the public toilets and killings that people do, on the way to the end we see many overweight characters with NO THING TO DIE FOR...", "X": null, "Y": 1, "idx": 155}
{"C": "obnoxious and insulting movie. the women-workers-kissing-the-stars-in-the-brick-house behemoth wasted any time it was supposed to waste and went to a post-nightclub or something and drank.", "X": null, "Y": 1, "idx": 156}
{"C": "a preview screening, and i must say i was left baffled by the horrors of some of the characters, and at the end of the film i realized i had seen it all. the whole thing was just too ridiculous to be entertaining, and when the script author came out and said he was reviewing the film i was also baffled, i didn't want to know why he was reviewing the film. it is a stupid book.", "X": null, "Y": 1, "idx": 157}
{"C": ", focusing mainly on Suave Bristowe, there is a subtle message conveyed about the media in general and the media world in particular: To define success for a million dollars is a success for a few years, not for a lifetime.", "X": null, "Y": 1, "idx": 158}
{"C": "- the actors aren't as real as the story might suggest - the viewer is presented with an ugly cheating husband (Brad Pitt) and a war widow who carries on a feud with the young mother-in-law of her husband's employer (Bob Balaban), while the rest of the film has the vapid and fey divorced Brahm (Frank Sheen)(remember the fantastic drama ", "X": null, "Y": 1, "idx": 159}
{"C": "entire audience. (and for this I give three stars.) do u like stevie wonder? yes but what the hell was that all about? Do u like the way they shot the hairdressers in the nose? no like him? well go and watch it again. DO YOU LIKE THE WAY THIS MOVIE WAS MADE?! You can leave it there.", "X": null, "Y": 1, "idx": 160}
{"C": "all the worst that television movie making tries to be. what the hell was the producers thinking?", "X": null, "Y": 1, "idx": 161}
{"C": "the DVD box or DVD countdown it still scores well under 100. After the first quarter of the movie its absolutely insane. Once you finally work your way through the film you are trapped in your seat and into your seat. The first half is incredibly boring and non-illuminating. The second half is much better and just as bad. Don't even bother renting this movie. You will be glad you did.", "X": null, "Y": 1, "idx": 162}
{"C": "not funny at all. And that's very rare to say of a comedy. A comedy for the youngsters, but a smutty one at that. Don't waste your time on this one. It's just full of bad acting and crap with a good cast. Avoid like the plague. If you do, see What To Do When All Of A Sudden Nothing Happens. The Vote: 6.", "X": null, "Y": 1, "idx": 163}
{"C": "in a long time and i have to say that I have seen many such bad movie ever. how bad could it be in 1999. it is not true story or just something made up for the (pacifist) fans and generals of a certain group.", "X": null, "Y": 1, "idx": 164}
{"C": "a 70-minute drivel with the kind of deadpan effeminacy that reek of the stink of an empty ketchup can. and an absurdly long list of things that were never shown or said in the original pilot: a young woman... an Asian boy.... a radio... the annoying lizards that were brought to live in an aquarium...", "X": null, "Y": 1, "idx": 165}
{"C": "it work badly. I had hoped it would have some clever aspects (i.e. computer generated imagery), but I didn't really care for the lack of characterization and the unpleasant ending. The one thing I did like was the makeup, and the texture and the skin were good. But even with those flaws, the movie worked well enough. 5/10. Was very disappointed.", "X": null, "Y": 1, "idx": 166}
{"C": "IMDb commenter who loves the disintegration of old traditions must acknowledge that he has had it. this is a product of the telecommunications age where anything can come down the tube and be recorded and looked at. this is a product of the film industry where ", "X": null, "Y": 1, "idx": 167}
{"C": "heartless dimwit of a movie star. He has done this a million times. Every film he has ever done he has failed. But he is one hell of a bloke. I do not mean to sound ado about anyone, but he really is not that great as a actor. Most viewers won't like to see him in a movie, but I will warn anyone reading this review that Mr.", "X": null, "Y": 1, "idx": 168}
{"C": "focused, boring and unimpressive, with a stuttering and inconsistent narrative that makes it look like an awful soap opera, rather than a hugely ambitious melodrama. ", "X": null, "Y": 1, "idx": 169}
{"C": ", full of clichés and cliches that are repeated ad infinitum in the past few years. Eventually you'll be done watching if you're not thoroughly entertained. Unless you have a special interest in Japan, I'd strongly advise you to stay away from this one. Unless you are a true travel enthusiast, you'll either be truly entertained or leave disappointed. Have a good one though...", "X": null, "Y": 1, "idx": 170}
{"C": "that it got. The acting is poor and the dialogue is just so cliched. You could be there in the theater laughing at the name of some character from this movie, but the laughs will not be worth the wasted time. Normally, I like to say that ", "X": null, "Y": 1, "idx": 171}
{"C": "I was in a Lacrosse game with someone and he dragged me out of the game and won.", "X": null, "Y": 1, "idx": 172}
{"C": "the music sounded like Johny's from the show, I can't get over how lame the ending was, but I do know one thing, the composer is good, but he doesn't deserve to be in an epic like this movie, the music was WAY too loud, the girls weren't acting great, and the story was kind of pointless.", "X": null, "Y": 1, "idx": 173}
{"C": "made. I sat down, and the first few minutes of the movie, I wasn't thinking about anything but watching the clock. After that, the story line just went downhill. Don't bother with this movie. If you liked the bad movies like ", "X": null, "Y": 1, "idx": 174}
{"C": "s Labyrinth tried to make a word-for-word version of their previous movie (it's so stupid that any attempt at continuity or verisimilitude would be automatically parsed as hallucinatory). The director's hazy preoccupation with ", "X": null, "Y": 1, "idx": 175}
{"C": "have ever seen is its simplicity..the plot is a little predictable but they really need to get to the point..,there are few laughs..so i don't think it should have been even five out of ten.. ", "X": null, "Y": 1, "idx": 176}
{"C": "buzz, it's sad to say that little fanboy Mary Parker gives this a five. But like her, I can live with a three. She does great things in the biz. Her star quality helped, but sadly it was the casting and editing that ruined this truly lovely film. This being a French film, almost everything has to be done extremely well and accurately. The French would be very surprised at the way the Italians did it.", "X": null, "Y": 1, "idx": 177}
{"C": "that a lot of people didn't like it, or even believe in it...that is, didn't see it at all. I do agree that Joe Don Baker's acting is a real mug...a young man who looks like a mature man in a suit...but when he acts he sounds like a young child.", "X": null, "Y": 1, "idx": 178}
{"C": "dissent in their community by showing just how few people stand up for what they believe in, and even fewer would drop the ball when things are bad.", "X": null, "Y": 1, "idx": 179}
{"C": "camp. It squanders all the intelligence of the one-liners spouted by a juvenile Max Kellerman who also serves as a lame substitute for a father. There are too many quippy clichés --- got a run of the mill gang'meets' snooping witty nature <unk>and a depressing number of truly bad gags.", "X": null, "Y": 1, "idx": 180}
{"C": "Beijing, you might as well burn your CD's and DVD's and stay at home and get drunk. ", "X": null, "Y": 1, "idx": 181}
{"C": "sis of a premise, but the events unfolding in the movie - more episodic - were more striking than the characters he creates. ", "X": null, "Y": 1, "idx": 182}
{"C": "drama that is hiding behind the term comedy.... undermining its source material, it could do no wrong: it only gets worse. ", "X": null, "Y": 1, "idx": 183}
{"C": "which is to say that it was a cheezy, cliched piece of drivel that sometimes went horribly wrong and was mis-appropriated by many people, for example, the studio and broadcasting companies? ie, 2 hours of what, essentially, was a teen acting showcase, and barely the best example of the stale stereotype cult-movie cliché.", "X": null, "Y": 1, "idx": 184}
{"C": "bad movie. The acting is very bad, the story is very stupid, the people are horrible, the plot is very stupid, and the acting is even worst. The cinematography is ugly, and I do not believe the budget was much. The characters are almost without expression, the actors can not deliver a facial expression, and so on.", "X": null, "Y": 1, "idx": 185}
{"C": "utterly forgotten... Not even the great Tom Cruise and Morgan Freeman had any sense of drama in it - no self replicability, no proper motivation, no sense of dramatic urgency, no proper sense of finesse, no sense of anything important. The character of Liam Neeson is merely a mouthpiece for a totally idiotic hero with a complete lack of talent.", "X": null, "Y": 1, "idx": 186}
{"C": "s. There were only about 500 people in the first screening - and that included the filmmakers and some of the cast members - who had no idea what they were doing.", "X": null, "Y": 1, "idx": 187}
{"C": "... lots of silly dialogue... pretty much the only thing that's worth mentioning about this silly mess... far too many awkward shots and titles... not really worth wasting time on... is the scene where the truck driver's wife was talking to the car, and the car dealer's, and the truck driver's, and the car dealer's - a 16 foot tree on the roof... just strange...", "X": null, "Y": 1, "idx": 188}
{"C": "lgence and politically motivated tastelessness. The opening scene of a bride and groom get on a moving van to get to the wedding feels like something straight out of Jaws. The family is handcuffed together, the bride is stuck in a wheelchair, and the man driving the truck gets knocked unconscious by his wife. He dies in the car with his hands in his pockets.", "X": null, "Y": 1, "idx": 189}
{"C": "inept, too rapt acting and, worst of all, the dubbing... excellent base idea but no script or story... and characters look the same... the same phony characters... awful songs, the same idiotic actors... not even a decent cast... hell, it was based on the actual story of a real concert which one can see and hear on the Internet...", "X": null, "Y": 1, "idx": 190}
{"C": "I must have enjoyed this film more. Although Seagal was an actor of note, this is a film about a man and his family. Even after Seagal decided that he was taking a nap, and returned to work, he was very fond of his family. This was a disappointing film that just didn't seem to have a point.", "X": null, "Y": 1, "idx": 191}
{"C": "mic, with virtually nothing to chew on or laugh at, that you walked out of the theater. What's more, the characters didn't think much of themselves or each other. It's just an insulting waste of time and money for everyone. This is one of those stupid movies where the actor gives a total performance.", "X": null, "Y": 1, "idx": 192}
{"C": "what's been done countless times before with greater proficiency and consistency.", "X": null, "Y": 1, "idx": 193}
{"C": "a B-class entertainment. The character is like a rabbit with a glue stick stuck up his arse. The script is stupid and clunky, and the director wastes so much of his talent with his shoddy animation style. The actor's performances are hit-or-miss, and the dialogue is painfully bad. The fact that this was made by New Line is a serious problem for them.", "X": null, "Y": 1, "idx": 194}
{"C": "real problems with coping with menopause that no one has any idea how to address, with a stream of profanity and cartoonish language, which is really not funny at all, sadly.", "X": null, "Y": 1, "idx": 195}
{"C": "a lot of screaming, trying to imitate Caravan of Dreams, no light came on the screen during the whole movie, very shallow characters, dialogue was boring and not real, an ending which was not interesting at all, a waste of time and effort, this movie didn't satisfy my taste either but I feel sorry for the producers and director, may God have mercy on their souls.", "X": null, "Y": 1, "idx": 196}
{"C": "family, joy, sadness, and obsession with the perpetually unhappy Kristie. Life in her small hometown is harrowing. But if you will simply allow the film to embrace its absurdities... The title character attempts to escape his personal calamity through his venom; but nothing could possibly save him... Except the occasional phoenix, which briefly glimpses the workaday world of a true blue American family...", "X": null, "Y": 1, "idx": 197}
{"C": "have a hard time finding roles for actors in their movie that were supposed to be ", "X": null, "Y": 1, "idx": 198}
{"C": "worthless, it was just meh. pretty funny at times. you can't really ever predict what the end will be, for all the no-brainer plot and lame dialogue in the movie. all in all nothing worth buying. 1. did i miss something? not a flaw in the movie but i guess something was missing. 2.", "X": null, "Y": 1, "idx": 199}
{"C": "could easily label it a total disaster. The camera-work, the dialogue, the direction, the acting, the direction, everything just stinks. The acting is awful. The direction is awful. There are some clever camera tricks, but no real thrills. The action is so bad it's amusing. The magic is gone. The mystery is so absurd it's funny. The twists are so nonsensical they actually make sense.", "X": null, "Y": 1, "idx": 200}
{"C": "iest of reasons. The acting is excellent, but the story line is not really very good, and the characters just aren't good in it, so you just get it. I could have done without the entire Issac speech and I never really cared about any of the characters, just loved watching how stupid this movie was. I didn't even know which character had what job, and this guy clearly had no acting chops.", "X": null, "Y": 1, "idx": 201}
{"C": "do what they can to get the best scene in the lowest scenes. I am going to add that the movie is quite pretentious for its time : when actors play their roles - or rather had to play their roles - it tends to make you see a certain movie, a certain sort of movie...", "X": null, "Y": 1, "idx": 202}
{"C": "by some under 9 year old child. and why should that be the case, in it i see very few of the jokes played on children. i wonder if this movie was made with the intention of preparing the children for and with the co-operative effort of Hollywood, to not have a real time and the space to be inventive with the plot. anyway, the erotic-murder scenes have a charming, uplifting feel to them.", "X": null, "Y": 1, "idx": 203}
{"C": "cheesy dancing is cheesy dancing. It's so many clever animated sequences that you can't help but keep watching. There's one scene when two turtles are swimming in a big pot of water, and the one before that involves some dumb (expletive) they aren't, you don't realize they're there until the end and you actually look for the turtles to run away.", "X": null, "Y": 1, "idx": 204}
{"C": "the plot for the first fifteen minutes was dead on with no suspense, one would expect it would be fairly boring but it is all too predictable. the vampire is a stereotype and the vampire hunters are one of the villains. there is some decent acting. if that were all it had, it would have been a real disaster. it had potential but it never came together.", "X": null, "Y": 1, "idx": 205}
{"C": "s pretensions of the conventional romantic comedy,...less interesting than the better exploitation films in which a proper plot (this is perhaps the only one, but the simple premise of a night-out and a night in with friends) was exploited...and re-evaluated... At least those films showed a willingness to stretch the meaning of the word 'romantic comedy.", "X": null, "Y": 1, "idx": 206}
{"C": "to replace deep understanding with shallow sympathy. what point is there in watching it if you can't bring yourself to say so?", "X": null, "Y": 1, "idx": 207}
{"C": "d a movie so unreservedly. For what it is, it's worth a ten-line critique. It has a lot of things wrong with it that I will not go into. But a comment like this speaks volumes. It's obvious this movie had an audience - it's hard to hate a movie made by people who really believed in it, aren't interested in it.", "X": null, "Y": 1, "idx": 208}
{"C": "levels. Worst acting - possible, no - no - worst attempt at humor. This is a movie that boasts very little effort on the script, yet manages to deliver half an hour of material in less than that. The dialogue is repetitive, the plot is awful, and the acting is mediocre. This was a complete waste of time, effort, and money.", "X": null, "Y": 1, "idx": 209}
{"C": "I have seen some awful ones) and probably one of the most unintentionally enlightening. By all accounts, it is well made and there are some good documentary filmmakers out there, but as a whole it is a piece of nonsense. This is a country that defies the concept of western civilisation.", "X": null, "Y": 1, "idx": 210}
{"C": ", the complete snoozefest that any movie-lover would have come to expect from a summer rental.", "X": null, "Y": 1, "idx": 211}
{"C": ", the screenplay by Eric Kofford and the dialogues by Dennis Iliff, this adaptation of the novel is a major disappointment. Each character is just too over-the-top and excessively caricatured and there are few strong performances in the film, with Peter Gallagher giving his best performance as the leading man, and Timothy Dalton's character getting very little time to become emotionally involved with his part.", "X": null, "Y": 1, "idx": 212}
{"C": "acked the personality and frankness to convincingly portray the characters. The problem with a movie like this was the screenplay was neither original or good enough to make this into a character study of the characters. While the escapades were amusing at times, the film's heart really wasn't in it. It wasn't worth the time. Almost all of the characters were stereotypical in one way or another.", "X": null, "Y": 1, "idx": 213}
{"C": "well it's directed and performed. It's not the most original script, but it's well-acted and it is not pretentious. Yes, the characters do behave like actors, but they are not pretentious; they just act, and it works. The ", "X": null, "Y": 1, "idx": 214}
{"C": "the most hysterically boring films ever made. And honestly, if you are not a watcher of hysteria, I don't see how this would make you want to see it.", "X": null, "Y": 1, "idx": 215}
{"C": "film about the work of a famous scientist and an equally annoying one about a gang of transvestites who do nothing but haunt young men and rape young women. the film is based in the government spy school where the journalist masters can be found--the only thing the film acknowledges is how much of the film was staged. it looks like a bad stage play, and often almost feels like one.", "X": null, "Y": 1, "idx": 216}
{"C": "loppy camerawork and amateur actors, largely a weak, lifeless story. And yet... true'movie' genre, too? ", "X": null, "Y": 1, "idx": 217}
{"C": ", and makes his life hard in the process; it's about a woman who shatters her eyeglasses; and it's about an acting teacher (who, despite himself, offers encouraging responses to his students) who gets the job, even though she loves the woman in the movie too much to stay with him. Basically, ", "X": null, "Y": 1, "idx": 218}
{"C": "acting is appalling; the continuity is sloppy; the pacing blundering. Still, it's not bad, just bad. But the plot has no depth, it lacks the emotion or real visual impact that makes a good film. Consequently, it is a hoot.", "X": null, "Y": 1, "idx": 219}
{"C": "movie...which is absolutely no more than what it is: a series of pointless advertisements. anything but that. the leads are a few of the more pretentious stooges who want to be young vikings, with the young and the not so young girls down the street trying to make them into fashion icons. the murder mystery in the movie has the more interesting plot but is buried in the junkiest garbage of the junkies.", "X": null, "Y": 1, "idx": 220}
{"C": "nist. Granted, many women do this, but, in contrast to an all-too-frequent Italian effort to prove that women are cool, it is just one more example of the sexist and racist nature of Italian culture. American films are not even 10% as bad as Italian films are, and Italian sex comedy, i.e. opera, is a very bad thing. Basically, ", "X": null, "Y": 1, "idx": 221}
{"C": "game, the hero can only ever do so much at a time, as they wrangle with the various plot strands that bring the hero to the rescue in the end...<unk>p >this movie can only be described as bad luck.....some directors can make a movie based on a classic novel (like 'Nativity Story'), and have it work...", "X": null, "Y": 1, "idx": 222}
{"C": "on end...so much so, that even Fredric March from Beverly Hills, 90210 brings its own style to the predicament. This is the schlockiest of them all. ", "X": null, "Y": 1, "idx": 223}
{"C": "tingly derivative of any number of sequels... forced to mask itself as an intricate study of many over-the-top eccentric characters and their exploitative, oily schemes... does the unthinkable and tries to replicate a preoccupation of its creators with one. This film is like having a nail in your throat after eating a burnt-out ice-cream....", "X": null, "Y": 1, "idx": 224}
{"C": "with too many plot holes, inconsistent cinematography, and sluggish delivery to make for good viewing. ", "X": null, "Y": 1, "idx": 225}
{"C": "for this film was apparently derived from the interest of making a point about the impoverishment of American society, i.e. an attempt to do something to create an interest in government ", "X": null, "Y": 1, "idx": 226}
{"C": "corpses, death and sex - there is no point in a movie, really, that does so well in one of those areas. The other reasons I give <unk>10 for it are that the characters are so generic (the title character) - annoying, self-indulgent, hollow and desperate in some of the same ways that the main character was awful.", "X": null, "Y": 1, "idx": 227}
{"C": "less cinematic trash to ever be released.... The plot is the only redeeming quality. The acting is the only redeeming quality. The morals and morals are the only redeeming quality.", "X": null, "Y": 1, "idx": 228}
{"C": "what's not to love? How about the lack of chemistry between Robert Downey Jr. and the guy next door? The pompous comical embarrassment he often gives them as a rogue cop... and no girl? And the actual script, like the acting, is unnecessarily overwrought and constantly absurd. ", "X": null, "Y": 1, "idx": 229}
{"C": "no discernible plot, except for the fact that the movie takes place in a very small town and is populated by overly talkative people of nearly every age and sex, most of whom have no real taste for poetry.", "X": null, "Y": 1, "idx": 230}
{"C": "at the middle of the action, quickly evaporates. You don't have time to look 'round the bedroom window, and there is no sense of security at all. You won't go looking for help in the neighbors' house (where it turns out that none is there), you won't use the bathroom, and you won't leave your room until the end.", "X": null, "Y": 1, "idx": 231}
{"C": "of brown marker-era interminable howling. 'Basic Instinct' is still in stores, along with Adam Beach. Both were trash, and are now collector's items. It's probably easier to find the promo posters to sell than the DVD itself. John Grisham is a fine actor, and the one that works best with him is Grisham, but this is way too generic, in the worse possible way.", "X": null, "Y": 1, "idx": 232}
{"C": "becomes aware of just how hideous the film is and that it is nearly impossible to watch. Even the excellent production design (sets, costumes, costumes, overacting, sound, just about everything) and good actors are not enough to save this picture. It is as if a lunatic psychopath came into a laboratory and made a film.", "X": null, "Y": 1, "idx": 233}
{"C": "given a copy of this supposedly cinematic masterpiece (?) and after seeing it a few times, I've always felt cheated. The overuse of flashbacks is no exaggeration, but it does create some claustrophobic moments and many of the dialogues have one or more of those scrawny lines that seem to come out of a B movie script.", "X": null, "Y": 1, "idx": 234}
{"C": "special amidst so many superficial things that seem to make sense but are not in the least. It's about the countless deaths of people in Cali in one year by earthquakes, the earthquake that sweeps America, the fog-bound city from end to end. It's about the meaningless activities of a political party that, like the first episode, does not have an agenda but believes itself to be self-interested.", "X": null, "Y": 1, "idx": 235}
{"C": "like being in an ape's cage. Watch it because you can't afford to miss it. The script is horrible. The film looks like it's thrown together randomly and every moment looks like a doorway to nowhere, except when it ends. And if that doesn't convince you, check out the grading.", "X": null, "Y": 1, "idx": 236}
{"C": "sensical, the acting is stupid and the direction sloppy. Save your money, there's much better movies out there! I can't believe the same people who made this want to like it! Go back to watching other garbage... thats where my name comes from!...TRY SOMETHING DIFFERENT AND HURRY UP AND WATCH IT!!", "X": null, "Y": 1, "idx": 237}
{"C": "perverse creatures know they should be ashamed to exist. for human beings to walk around dressed like cannibals in a heavy jungle set up camp.", "X": null, "Y": 1, "idx": 238}
{"C": "see what can I get, let's see, if it's worse than the indie flicks I like, I can take it. I gave it a shot, but was so bored I turned it off. I figured, so much worse, let's just watch a good flick.", "X": null, "Y": 1, "idx": 239}
{"C": "and blind nationalism... by way of his co-producer, john lebeau... any result is preposterous... a circular argument... in a circle.... a corruption of the classics.... an endless parade of misanthropy.....", "X": null, "Y": 1, "idx": 240}
{"C": "were plenty of effective Gothic horror films of the 80s. However, none of them were commercially successful or had much of a theatrical run. This one however deserves the recognition it has received. Yes, it's visually appealing (at least the production design looks interesting) but the acting is very poor and the direction is nonexistent... I can't remember seeing an absolute trash horror film that disappointed me so much. The film never gets beyond the ", "X": null, "Y": 1, "idx": 241}
{"C": ", in their determination to'make light of an unremarkable story'), as Jeanette MacDonald's character admonishes others.", "X": null, "Y": 1, "idx": 242}
{"C": "ve ever seen.) It's very crude, in poor taste, with bad acting, terrible writing, directing and direction.... Basically this is not a movie for people who care... Read more » ", "X": null, "Y": 1, "idx": 243}
{"C": "rotten, and all-around vile movie that will have its viewers fleeing the theater.", "X": null, "Y": 1, "idx": 244}
{"C": "of the most virulent anti-semitism.<unk> br>Paddy Chayefsky<unk> br>Ben-Hur<unk> br>Peter Sellers<unk> br>Samuel Brown<unk> br>All the characters are miscast and misdrawn, or <unk> flip-flop<unk>? the third act is just embarrassingly underwritten, the fourth is truly a poor film.", "X": null, "Y": 1, "idx": 245}
{"C": "art movies. The problem is that it doesn't have nearly enough originality or have nearly enough moments of any kind. It's not even really scary, and the scenes involving the baboons and Mr. Darcy making a love scene (which is one of my favorite scenes in the movie) are not even that impressive.", "X": null, "Y": 1, "idx": 246}
{"C": "no sense of character. Basically, a guy is doing some kind of community service for his country. But the movie starts to drag about 20 minutes into the storyline. And that is when he meets another guy. The movie then drags on a lot longer and its incredibly boring. In the end, he sits at the bar and talks to the bartender about how he's going to lose his virginity to the new guy.", "X": null, "Y": 1, "idx": 247}
{"C": "a meal. The plot is atrocious and any of the above actions even so can't explain the questionable skill with which this pic handles it. I was glad to see something close to English when I was a kid. And the kids were too young to remember the noise of ", "X": null, "Y": 1, "idx": 248}
{"C": "been a big fan of Gwyneth Paltrow's work, but after reading this review I was under the impression she was quite the actress, with not many in the acting world who had heard of her. Of course I was wrong, but there are a lot of mistakes in the casting.", "X": null, "Y": 1, "idx": 249}
{"C": "ilable... some inexplicably, predictably, repulsively gimmicky crap... even worse than this 'fights' film, 'tugs' and'maggots'.... and if all that's too much to ask for, the 'infinitely repeatable' side of 'catch-22' is just as appalling.", "X": null, "Y": 1, "idx": 250}
{"C": "incredibly stupid, most unwatchable film ever!.. first of all, when i saw this film i was very disappointed because it was a GREAT FILM, with wonderful acting, great directing.. the worst film ever!.. I can't understand what the director was trying to do here, what all was he trying to do with this film!.. if you want to watch a funny or enjoyable movie...", "X": null, "Y": 1, "idx": 251}
{"C": "at an pace that makes it look like a drama on two and a half hours, minus the insight and insight this character possesses in life and times.", "X": null, "Y": 1, "idx": 252}
{"C": "can share... Nevertheless, I suggest you take a little time to catch up a bit on all the wonderful things this remarkable country has to offer, and keep it in your pocket for some fantasy play with the computer.", "X": null, "Y": 1, "idx": 253}
{"C": "love the ending to so many movies, it's still hard to swallow when it strays so far off the mark. It is for everyone! The story is not that compelling. The characters, while well-developed, seem cheaply constructed and try too hard to resemble real people. As a result, the film is a disappointment on every level. It felt unoriginal.", "X": null, "Y": 1, "idx": 254}
{"C": "to myself <unk>Wow, this is going to be another (slightly better than The Bridges of Madison County) zombie flick with zombies in it.'' Yep, pretty much what you would expect - a fun little chick who talks to people like a teenager snoops on their stuff (especially the guy who works at a Dunkin Donuts).", "X": null, "Y": 1, "idx": 255}
{"C": "i could write a book on it. just for the sake of saying. the actors..- so so. too many sketchy characters. again. i think we are supposed to like messi but you don't have to. all its a mad game which i am hardly. but to quote the title. to start with there is all the help of war for development of countries. more than anything else you have all the issues of their people.", "X": null, "Y": 1, "idx": 256}
{"C": "e documentary i saw, and a very strange final monologue by Nikki Cohen that was more prescient and provocative than anything in the commercial film, which i found to be an inappropriate finale. some of the observations made in the commercial about the strange nature of death are made in the film and will make you think... but i do wonder why we got to the part where the spirits of the dead are shown dancing around for no reason.", "X": null, "Y": 1, "idx": 257}
{"C": "TV...and realizing I wasn't... if it was in HD i'd watch it on cable in full screen and sit through it like a crap performance from a porn star.", "X": null, "Y": 1, "idx": 258}
{"C": "every one of them is absolutely boring. The plot is terrible, the acting is lousy, the storyline is terribly slow, the directing is awful, the soundtrack is awful and the whole movie just gets boring, quickly. (Reader: SPOILERS AROUND PART 1 HERE!) I'd rather have a runny nose than sit through this torn apart movie again.", "X": null, "Y": 1, "idx": 259}
{"C": "et beaucoup de choses étaient trop blaches pour moi, (à bord de l'usine)) je n'y suis pas original pour commencer (an adieux perdu à l'histoire de la vie...", "X": null, "Y": 1, "idx": 260}
{"C": "that negative about it. If you're going to put out a movie like this, make it a damn good one, because the character and their relationships are horrible. There's no sense of depth, no real comedic moments and no humour - nothing, except the direction, is worth a visit. The acting is awful. They've picked up the movie's script, but haven't read it.", "X": null, "Y": 1, "idx": 261}
{"C": "in a long time.The acting is appalling,the cinematography is just that....the story is just crap,all these characters are implausible and the actors look like cheesy porn porn models.there isn't anything to like about this movie.Just be afraid.. i don't know what that girl was thinking?...", "X": null, "Y": 1, "idx": 262}
{"C": "only succeeds in bolstering my lascivious thoughts. There is no real sense of horror in this film. It's not scary or suspenseful or suspenseful, it's just... noise, flash, and general oddity. There is no mystery to be solved or characters to care about. In this film, the only mystery is what the hell one of the characters is doing up there.", "X": null, "Y": 1, "idx": 263}
{"C": "by Hisham Peirsat, but is nothing more than an extended commercial. Think Michael Jackson and OK Go. ", "X": null, "Y": 1, "idx": 264}
{"C": "movie has one very good word to describe it, horror, and this movie is definitely not good horror cinema at all. the production design looks like it just came out of the 70's and looks remarkably cheesy in terms of the special effects ( e.g.", "X": null, "Y": 1, "idx": 265}
{"C": "the unthinkable: The survival of the Chinese population in the Northern US. Describing ", "X": null, "Y": 1, "idx": 266}
{"C": "they seem to think that it will make up for what is essentially an enslaved film by overtly exploiting the camera's distortion capabilities. This seems to be the major conceit of... this film; that it is a listless montage of pieces from prior films and in this one too, each successive gag comes off as silly and contrived.", "X": null, "Y": 1, "idx": 267}
{"C": "(which is fine if it's just between you and the actors). clich<unk> 1. zebras (though the zebras in the zebral contrast between purple and blond as well. their very nobility (a character-based stereotype, for example) implies that all of the men (usually men) in the film had male buddies. clich<unk>2. the melodramas that fill most of the time (i.", "X": null, "Y": 1, "idx": 268}
{"C": "hack jobs and mute twits that make the audience run out of the theater before the two hours are up.", "X": null, "Y": 1, "idx": 269}
{"C": "was not a question I should have answered. All I have to say is that seeing it in this frame of mind is impossible. (Although the thoughts of the author of the obituary definitely are.) One wonders why he put so much power into it, let alone to start with to hope the movie would turn out the way it did. It hardly deserved a fair review or any review at all. (See my other review.", "X": null, "Y": 1, "idx": 270}
{"C": "mess of dreadful dialogue, a veritable infest of bad acting, and a damn sight of a dud Script. You know when you have read an Oscar nominated screenplay a thousand times before and you realize you never want to see it again? This thing is topless and this is not a mystery. If you haven't seen ", "X": null, "Y": 1, "idx": 271}
{"C": "friends who had used its titles to placate its ardent fans. It reminds me of an old Peter Pan episode with everyone dressed up as Patsy. I don't understand how this can be considered a comedy. The costumes and settings were mismatched and badly lit. I mean really bad. I'm sorry..", "X": null, "Y": 1, "idx": 272}
{"C": "And this is just another (incomplete) list of things that ", "X": null, "Y": 1, "idx": 273}
{"C": "damned prizes. I think that bad movie managers want to receive these big salaries, while the actors, like the characters in the movie, cannot be bothered to make any effort to compete. The script contains errata from the first draft of the story, and the dialog is so grating it is difficult to express the rhythm and tension of the dialogue. No real new ideas, and very little dialogue.", "X": null, "Y": 1, "idx": 274}
{"C": "lief at the monotonous repetitiveness of this movie. Anyone with any good sense of humor would have spotted it way before this. The acting is incredibly wooden, the chemistry was diluted in the middle of the story, and the plot lines are utterly unoriginal. There is no life in the characters, their face was uneven, and they don't seem to know why they are singing.", "X": null, "Y": 1, "idx": 275}
{"C": "herence. The characters are mostly stock (some bland and hammy), while the scriptwriter is awfully rude and exaggerates even a little bit. Every now and then there's a song that has no title in the dictionary. It's worse than the worst case of AIDS. I don't remember any screenwriting academy award, but the director here does some bad storytelling for a big budget comedy.", "X": null, "Y": 1, "idx": 276}
{"C": "rated and offensive movies of all time, The Bad Day. The characters are so overtly sexist, the movie makes unintentionally fun of a classic, The Bad Day is a supposed to be intelligent movie, it isn't. The two sexy leads are sexually diverse, the director portrays an extreme party girl with underdeveloped sense of gender roles, and the film never builds up to its insanely overrated climax.", "X": null, "Y": 1, "idx": 277}
{"C": "of my favorite old-time shows (with the reruns proving to me I am not stupid)...I thought this movie sucked like a brick and the sad truth is that some aspiring actors have been taken by the charm of the series and they have become a very good actors for sure...However, I can not say that I ever look forward to the next episode..That is the only good thing of the TV series..", "X": null, "Y": 1, "idx": 278}
{"C": "real plot, real characters, and an actual protagonist (in this case: the teacher). I cant believe that 'Runaway' finally won the best film at the Golden Globes. In fact, I cant believe that the world really fell in love with this movie. A truly pretentious and manipulative piece of crap, it had no substance whatsoever, nothing worth saying in it whatsoever.", "X": null, "Y": 1, "idx": 279}
{"C": "s the sum of a wealthy theater director's thumb-prints and the miserable capacity of all of his assistants to line up with the stage director's ones. ", "X": null, "Y": 1, "idx": 280}
{"C": "and by no means original commentary on how technology can affect a society. It is a dismal failure from every point of view. First of all, the director seems to believe that the digital transition from the 2 <unk>reeler/CRT to the projection screen is linear, the looming image of the future and the actual world and the images of war, drug use and an affluent neighborhood seem to be the essence of the plot.", "X": null, "Y": 1, "idx": 281}
{"C": ", and a mediocre acting job. The film had good ideas, but no single character was able to function as a storyteller, let alone in a dramatic situation. If there was no moment when Ashton Kutcher stared at the blank screen for more than a few seconds, the film would have been over by then. While more than one person is proud of the film, the film is no longer worth seeing.", "X": null, "Y": 1, "idx": 282}
{"C": "over ninety minutes too long, the humour is too easy to discern, the comic timing is too easy to miss, the only real positives are ", "X": null, "Y": 1, "idx": 283}
{"C": "me than anyone else's I have ever seen or heard of. To think that any stage actor would ever want to perform on-screen with her (either in person or on the stage) in such an undeveloped material instigated me to return to theaters to see the movie. That movie is, frankly, a big disappointment.", "X": null, "Y": 1, "idx": 284}
{"C": "an understatement. I laughed and chuckled, but not once did I really feel for the characters. One set-piece was like a stale sandwich, and when it was over I was suddenly too tired to care about anything else. Every other line in the whole film seemed a drag. And worst of all was the absence of any real emotion for either the person or their situation. I could care less about the characters or their situation.", "X": null, "Y": 1, "idx": 285}
{"C": ", cheesy dialogue, pseudoscience and a whole slew of action scenes that threw me out of my seat. ", "X": null, "Y": 1, "idx": 286}
{"C": "Angeles. One night the husband leaves and the wife goes outside to have some fun. But the wife finds dead bodies around the building. So, she tries to put them together. She is almost successful at that, but the next day, the body disappears. Then, the wife sees a newspaper article about the dead wife. She makes calls to the local police station. The neighbors believe the robbery was real, but the police are no help.", "X": null, "Y": 1, "idx": 287}
{"C": "I found it a bit dull and tame. Watching James Woods for ten minutes gives you more than enough of this silly movie to put down in a few seconds. Once you get past the thought that this really is a stupid film and a prelude to black comedy, the film works well enough as a low budget remake of the Farrelly Brothers, with some onscreen help from Sam Elliott.", "X": null, "Y": 1, "idx": 288}
{"C": "(other than the cat and adam character); the real emotion of the time seems to have been to ", "X": null, "Y": 1, "idx": 289}
{"C": "together of dead film stock and canny dodgy improvisations, the production values suck as thick as haggard sloppy gumbo.", "X": null, "Y": 1, "idx": 290}
{"C": "of the original from last year, since the filmmakers have added new jokes to the original script, and now have a soundtrack that matches the dialogue. Also, while Slaughter High manages to create a new heroine to go with the old heroine and give them some new powers, they still manage to steal the entire plot away from The Hanging Field and do it all with the clothes of their real badass parents.", "X": null, "Y": 1, "idx": 291}
{"C": "overblown exercise in intoxication. Why even attempt to entice viewers with a plot that ignores, or barely touches, their base desires, their unquenchable thirst for the sun? What next, Can-Can? I like the addition of the titular character, especially since it also establishes the two leads as characters worth watching. But it isn't enough to justify this waste of celluloid.", "X": null, "Y": 1, "idx": 292}
{"C": "), it has all the usual dumb gags, it has enough audience to be annoying, and it has too many of them. I would rather see Mickey Rourke do karate or do my homework, but this isn't going to work for me. What made it a real movie was Eddie Murphy and Jennifer Aniston. The fact that Murphy plays a sad-sack son makes the whole film that much worse. Once again Eddie, I prefer Mickey.", "X": null, "Y": 1, "idx": 293}
{"C": "must say i wish i hadn't. the only thing that i thought was original about this movie was that it was about a son going to college and having to work his parents life away from him. i didn't really get it.", "X": null, "Y": 1, "idx": 294}
{"C": "when assassination thrillers (esp. the great'master' thriller 'white sun') are particularly bad, a true classic is even more likely. obviously, since this film is so bad, it's supposed to be so good. meanwhile, i hate films like this, where all the characters sound alike, and it is clear that the director will only write another good'master' movie.", "X": null, "Y": 1, "idx": 295}
{"C": "desired if you have nothing better to do in the summer. This is a very poor re-imagining of Dickens's classic poem, but it's also about as turgid as the Titch-Bolt you recall from high school. My grade for this movie: D., 1 out of 10. Good examples of pretty, handsome objects played by handsome men.", "X": null, "Y": 1, "idx": 296}
{"C": "good entertainment. the movie is also low budget. if you like huge waste of time, wasting your time on watching video and maybe watching a boring movie, or even wasting your own time on a long drive, try to watch this movie. i regret the decision i took and i hope it will not be the last one i will waste my time with.", "X": null, "Y": 1, "idx": 297}
{"C": ", despite the acting. The characters were unlikable and the story was devoid of any redeeming value. Another problem was the special effects, which were a disgrace. Some people have complained that they were unrealistic, and they seem to have missed the point of the article. This reviewer feels that the acting was great, but that the plot was not. This movie doesn't make any sense, except to the casual viewer.", "X": null, "Y": 1, "idx": 298}
{"C": "; a grim and grimy pot of dungeons, some eerie occurrences, some weird women in sacks... funny things happen to you... they don't say what's on your mind, but the power of voiceover is real, even if you think you've seen it all before. I could go on about the comedy.", "X": null, "Y": 1, "idx": 299}
{"C": "Certainly Miss It. What a huge waste of time... There's not a minute of boredom in this lousy little trashy turkey... I'm trying to make myself interested in this flick, but it makes me feel irritable... it's just awful. This movie is one of the most unfunny of the bunch. There's nothing to entertain you... It's just too long.", "X": null, "Y": 1, "idx": 300}
{"C": "'Amish Cooks' episode of The Night Shift, and loved 'Pimp My Nephew,' but this is bad. But 'the Silly People,' starring Martin Sheen and James Garner as a family in the year 1956, does it any favors. Like the Amish Cooks episode, 'Creepy and insulting.' Avoid it.", "X": null, "Y": 1, "idx": 301}
{"C": "seem even more sane by comparison. It's supposed to be a comedy with a tight, natural plot, but the tone of the dialogue and the photography of the location shots feels like a commercial for a bland dog food ad. No one wants to live in the middle of the wide, empty prairie plains and the implication that people with a sense of humor should live in and around those spaces for most of their lives would be silly.", "X": null, "Y": 1, "idx": 302}
{"C": "he's playing (he does hardly seem to know anyone else) whose mother is always sick on him (this makes perfect sense as an actor would be the last person in the world to have a mother who is ill - or even a mommy in this case) who doesn't cook, always wants to be with someone, always comes down with some sort of case, and who demonstrates the weirdest humanity of a character actor.", "X": null, "Y": 1, "idx": 303}
{"C": "plot is quite unrealistic and it goes on forever and ever. Then there is the villain who has this thematic 'exorcism' and his throat and all the rest of his torture. The other part, where the horror movie tries to send out some kind of message... the really bad actor makes this scary, not scary at all. Overall, it gets 1 out of 10 stars. Would I recommend it? Not really.", "X": null, "Y": 1, "idx": 304}
{"C": "title from a theme song of the female tortured soul : that of the victim of violence.'this movie wouldn't have been any better than'thinking girl'or'story of women in captivity'( or the two lately released on video) or even the sappy saturday night drive-in offerings...", "X": null, "Y": 1, "idx": 305}
{"C": "directed - it looked so hard to even be funny - it sucked like a sponge and was boring as hell! It had a flat cliched plot and seemed even more like a cheesy porn film. The acting was bad, all the characters seemed flat - a typical porno role, don't get me wrong. Just a bad film. So to sum up, I hope you find the word ", "X": null, "Y": 1, "idx": 306}
{"C": "characters you would want to spend time with..... The ending seems to be a washout for the whole film, which, it is true, is very sad. But I wish I had gotten my money back from this theater.", "X": null, "Y": 1, "idx": 307}
{"C": "s, in that it didn't try to be new and avant garde. it instead appeared to be generic sydney parks ", "X": null, "Y": 1, "idx": 308}
{"C": ", and I wish it had not been what it was. I don't think you'll have much to laugh with - only a couple of bemused looks. But then it became apparent that the film was a disgrace to Steven Spielberg. The ", "X": null, "Y": 1, "idx": 309}
{"C": ", as the movie itself. I can only give this movie 2 stars, based on the level of fake gore, cheesy ending and poorly realized characters. Yes, on a technical level, the movie has a decent pacing, i.e. The clown isn't really the clown, he's a slimy psycho killer (yes, he's in this film) and there is some intriguing stuff here and there.", "X": null, "Y": 1, "idx": 310}
{"C": "he does, as is his wife. Plus, he is pretty funny. And the gay community is something I can support. The gay community has so much to offer, that I think this movie will appeal to everybody. I actually like the gay character and I also think that the boys are attractive. Not cool, but they are attractive and that is what I think about the movie. I think all of these characters were well written and it shows in the movie.", "X": null, "Y": 0, "idx": 311}
{"C": ". The dialogues are the only thing that keeps the film moving forward, and i couldn't stop listening to them all the way through... so simple and utterly beautifully written... unreal and beautiful.... the songs are perfect and charming... i've seen so many underrated musicals, but this one is by far the best i've seen... it's on my all-time list, i've seen every musical made...", "X": null, "Y": 0, "idx": 312}
{"C": "wonderful cinematography for the most part make this a very watchable and enjoyable movie. I have enjoyed every moment, and am looking forward to the next one.. The songs are a tremendous addition to the proceedings, and are enough to take the audience to a place where they didn't know it existed before, they make a place where the audience can be blown away..", "X": null, "Y": 0, "idx": 313}
{"C": "Johnny Cash fan again. It was a very funny movie. Everyone in the theatre was very good and everyone involved did a great job. I watched it again the other day and gave it a 9/10, which is even more then I thought. The book was very good, I enjoyed it just as much as the movie. It would have been a 9/10 if I had been told how to rate this movie but the rating has been changed to a 7.", "X": null, "Y": 0, "idx": 314}
{"C": "kjld to reunite here a group of actors, who had been the mainstays of modern Norwegian cinema... Well you may disagree with the previous people about the merits of the art house cinema of Norway..", "X": null, "Y": 0, "idx": 315}
{"C": "playing at the National (in Australia) and is thus a must see for most people (and especially the old and infirm). It is best suited to the whole family as it shows family values in a very delicate way. Children of the Northern land as a part of this may be somewhat bored with some of the stereotypes which have been used throughout the movie which are played to extremes, but are not.", "X": null, "Y": 0, "idx": 316}
{"C": "treats of the april 14, 2036 crisis in the face of the impossible, terrifying, but vital allieviation of sarah wilson and all the rest of the committee. Pretty watchable and I think highly recommended. Steve Martin, too, is a best actor to see. There are many weaknesses. Some of the last lines of the movie aren't, unfortunately. But many of those points can be forgiven.", "X": null, "Y": 0, "idx": 317}
{"C": "film, but at the same time the viewer is drawn into the unfolding of the story, shivering in anticipation of its outcome. Ms Curtis is an artist - and the cinematography is stunning. She is wonderful. I have said many times that all of the stories in ", "X": null, "Y": 0, "idx": 318}
{"C": "filled with the heartbreak of war and the fear of the killers and ", "X": null, "Y": 0, "idx": 319}
{"C": "circus that is trying to gain acceptance and is loved by it audience, but more importantly, it is the story of the person who once claimed that he was hated and loved because of his heritage and how his heritage is a mixture of his Scottish, Irish and French descent and what people thought of him.", "X": null, "Y": 0, "idx": 320}
{"C": ". The huge storyline, the nicely detailed script, the evocative locations, the complex characters and the attention to the detail and the fact that one of the series is much more character driven than the others has been something I've noticed as I've gotten older and one of the things I thought was jarring as a middle age viewer is the variety of characters.", "X": null, "Y": 0, "idx": 321}
{"C": "y-somethings with the heart of gold have obviously never seen the lack of knowledge of their audiences, because they speak the language with astonishment and delight, telling its young world a story about a grown-up childs sad journey from the comfort of their own home into the world of the world's child, a brotherly comic adventure of the finest comic kind.", "X": null, "Y": 0, "idx": 322}
{"C": "it was on sale this week for only a few more days! Can i just say that, until now, the movie has been one of my favorite movies of all time...watch it if you haven't already, it's funny, touching, really REAL! What more could i say?......please? All the actors/actresses are very convincing and bring the film to life on stage....you can feel the emotion in their faces...", "X": null, "Y": 0, "idx": 323}
{"C": "and what an act that was for those who love him", "X": null, "Y": 0, "idx": 324}
{"C": "all its songs.I thought it was an excellent movie and now I remember why.Latin dancers in this movie were simply superb and you could tell that they had been prepared with a lot of effort.If you have to choose between Star Wars or Six Shooting Stars you should definitely watch ", "X": null, "Y": 0, "idx": 325}
{"C": "a serious way. While I know of some movies that aren't funny, like the Gentleman's agreement, or the Promised Land, this isn't one of them.", "X": null, "Y": 0, "idx": 326}
{"C": "slasher film: cool, twisty and sensual, bloody and heart-pounding. As the film goes along, it's hard not to get caught up in the fun of the events and to find yourself swept up in the dark world that the gang's terrors lead to. It's a shame that ", "X": null, "Y": 0, "idx": 327}
{"C": "a director, but also an admirable person. She can even make a film without everything that would make a good movie: interesting ideas, good actors, good filming, and good locations. The Director helped Francesca in making this film, and thanks to Francesca she has directed this film that's quite good and moving. The story is simple and clear.", "X": null, "Y": 0, "idx": 328}
{"C": "s to decamp to the sofa and settle in for an evening of entertaining whimsy. Wicked is a perfect match for that intent. Two strong, talented actors unleash their considerable talents to create two complex charactters from the mismatched hat and womanising reformed. Why, then, didn't they make this film before ", "X": null, "Y": 0, "idx": 329}
{"C": "are very good. The script moves so smoothly that it actually captivated me. I found it all believable and fully involving. I really didn't know that anything was really happening. I can't wait to see what has happened to Jessica when she gets to act for an English based company (not really what I expect her to do). Also, the performances are amazing.", "X": null, "Y": 0, "idx": 330}
{"C": "humanistic character is able to control her own self and suffer for it. the consequences of infidelity or worse of life can transform in just one moment. and of family love and its contortion, you will never guess, the dreamer and the doer. the life choices of the two of them, as they do each other, constitute their identity, their identity with humanity.", "X": null, "Y": 0, "idx": 331}
{"C": "Am Marshall, and although the film is about a computer programmer, his experiences in the field, and his expertise in problem solving is fantastic. He manages to unravel a puzzle that has puzzled many an American of my generation for decades.", "X": null, "Y": 0, "idx": 332}
{"C": "'s fun. And this is one of the few movies that scares the wits out of you. De Niro delivers the goods as a mad scientist with an envious, obsession-ridden obsession. We see several scenes where he desperately grabs anything from the living room and gets it while it's being used. Also the move is well-acted. Very enjoyable.", "X": null, "Y": 0, "idx": 333}
{"C": "better than it usually is. Brilliant performances and direction, smart-aleck humour aplenty. Intimate and warm. Wonderful to watch. 8/10. ", "X": null, "Y": 0, "idx": 334}
{"C": "Florida not too long ago with a full stomach, and my head was full of popcorn. I will always remember this film for being a perfect example of how to make a kids' movie that is truly child-friendly. The realism was uncanny. The tale of how the authors of the book met their sons turned out was fascinating. However, I would have liked to have seen more of the process of the novel being adapted for the screen.", "X": null, "Y": 0, "idx": 335}
{"C": "today. Good performances by all concerned - particularly those of Sophia Loren and Benedict Cumberbatch. The musical score was written by Walter Pidgeon and arranged by Walter Lloyd. This a stunning story of an unspoken love between a Cuban boy and a Cuban girl. One of the great summer movies. Don't miss it! And please, leave me a comment if you have seen it already.", "X": null, "Y": 0, "idx": 336}
{"C": ", but because it had something clever and poignant to say about everybody and everything - especially the movie industry, which I thought was fabulous.", "X": null, "Y": 0, "idx": 337}
{"C": "film which successfully (at least in the sense of documentary-like production values) presents two sides of a very illusory story, both involving human beings in a very realistic setting. Although many events in the film make virtually no sense, the performances of the actors are so real and accurate that the viewer can hardly tell which side is real and which one is a caricature.", "X": null, "Y": 0, "idx": 338}
{"C": "on the streets of New York. It was written, directed, produced, and narrated by Michael Connors. I found the best parts of this film to be Mr. C's moments with the ", "X": null, "Y": 0, "idx": 339}
{"C": "Lee is the most dangerous villain in the world. Oscar Levant is his cowardly informer, Tony Soprano is his vicious benevolent assassin, Che Guevara hamming up for his act of dissent, and the ever great John Wayne spouts the slogan 'we shall never quit, Sir, no matter what'.", "X": null, "Y": 0, "idx": 340}
{"C": "and the characters endearing and lovable. This is a pretty good movie. ", "X": null, "Y": 0, "idx": 341}
{"C": "year... It is as heart-wrenching as a mother's passion and love. It captures a real person, a real life, and it is frightening if you have not experienced it... The only way to describe this movie is to simply go and see it, or even listen to it. It is unreal... This is one of the most extraordinary films I have ever seen. I will never forget it... I don't think the ", "X": null, "Y": 0, "idx": 342}
{"C": "is based on real events and the movie makes you feel better for what is happening in the film ", "X": null, "Y": 0, "idx": 343}
{"C": "is a gorgeous and eloquent tribute to the cinema. It possesses everything that I can like in a film - there's poetic imagery, complex emotions and intelligent direction. The fact that some people find it difficult to accept that Lulu/Fallani could be the same guy from American Pie is just one example of the film's triumph.", "X": null, "Y": 0, "idx": 344}
{"C": "to the theatre. maybe the only outstanding film of its genre and certainly an outstandingally creative one. hugely original film, equally like the classic hollywood Bollywood flicks of yesteryear, he gets the details of Bollywood right and only on a few strands; gossip, beautiful sex, music and exotic locales are largely used, making the scenes seem very natural and even naturalistic.", "X": null, "Y": 0, "idx": 345}
{"C": "This is a complex and beautiful human story of living and love that is sometimes hard to get through because of how risqué it is. Judgment and cruelty, miscommunication and power struggles are the two things that dominate in a couple that live in the refugee camp where they await their ill fated escape. I just adore watching those tormenting days and the strong emotions.", "X": null, "Y": 0, "idx": 346}
{"C": "spans nearly half a century since the liars and creepers of King Lear. This film takes a dainty script (also with a very atypical title), mashes together a series of wonderfully quirky characters, and adds a slice of history to the mix, while making a most original movie ever to be seen on film.", "X": null, "Y": 0, "idx": 347}
{"C": "you feeling happy and hopeful all at once and is uplifting for anyone who needs to be reminded of what a good human being can do. I believe that this movie is a wonderful and moving love story about our own mortality and how we can lead a happy and meaningful life.", "X": null, "Y": 0, "idx": 348}
{"C": "a big holocaust campaign' and the sensitiveness of her performance and the dignity she brought to her poverty and helplessness, Nicholson manages to underline the fact that anything is possible.", "X": null, "Y": 0, "idx": 349}
{"C": "it is far more about the people in the story than anything else. It was no doubt that an award-winning film, however, that brought the story to life for so many, that it became immensely popular, and that hasn't changed.", "X": null, "Y": 0, "idx": 350}
{"C": "most understated character of the trilogy, is, without doubt, one of the best that has come of British cinema over the last 50 years, making the film really something to behold. A stand-out performance from Michael McKean, who certainly is the perfect compliment for Nicholson's Grand in High Places. Excellent television actor, well-written, excellent direction. Roy Moore - good. Interesting, dull story.", "X": null, "Y": 0, "idx": 351}
{"C": "a disaster, i was wrong, the characters were well written, the story line was solid, even the casting was very good, the guy who was playing the head of the FBI was very convincing, and a lot of the other actors played their parts very well as well. i also believe the effects in the movie are really good, as well as the storyline. I recommend this movie a ton to anybody who loves sci-fi/ fantasy/ horror movies.", "X": null, "Y": 0, "idx": 352}
{"C": "illiterate reader can't help but admire. It examines the nature of humanity in the face of disaster and takes us on a journey that leaves us pondering over the very lives we're about to lose and how a world that looks to be an utter disaster would be destroyed.", "X": null, "Y": 0, "idx": 353}
{"C": "'s hit show about two English constables on a honeymoon is fresh and readable. The film is not so much a product of its era, as a homage to it. Definitely, the film shows the comic genius of Laird Hamilton, as well as the nature of the post-WWII British service. The flashbacks to the time when Gordon Pyun was a policeman in London are worth seeing if only for his shoes.", "X": null, "Y": 0, "idx": 354}
{"C": "uplifting Hollywood comedy, a moving glimpse of a family in crisis through a big city hospital. And Mark Addy adds his usual stunning body double effect (his expressions summed up perfectly by Mark) but also to the movie with sexy songs and stunning scenery. Joe Pesci's character seems more intense, more melancholy, but, despite his understated performance, he is no weakling.", "X": null, "Y": 0, "idx": 355}
{"C": "film that my family and I enjoyed immensely. My wife especially enjoyed the brilliant use of colour and filming style. The acting was great and the films wit was in many ways genius. The film was such a pleasure to watch and despite its unbridled violence, the action was nevertheless restrained. It had a magnificent ending, that I found both moving and inspirational.", "X": null, "Y": 0, "idx": 356}
{"C": "although at times it is extremely predictable it does not spoil the beauty of the story which is very moving and sad.", "X": null, "Y": 0, "idx": 357}
{"C": "one he's been exposed to until this point, gives his real name, and when he's pulled over, or rather, has to be pulled over by a gang, he calls the cops and talks to his father. A person he's never met, and a person who looks like he hasn't seen a cat for a year, suddenly, comes to him, but, as his father says, ", "X": null, "Y": 0, "idx": 358}
{"C": "s for this movie, I'm sure that this one will have to be put on the big screen. It is a true movie and something you don't see enough of these days. There were a few unrealistic elements that I found disturbing, like the fact that some in the audience started to cry for many of the characters, and I couldn't see whether the tears came from the audience or the actors. This film definitely deserved better.", "X": null, "Y": 0, "idx": 359}
{"C": ", and sweeter than ever. the animation is fantastic and it manages to keep you laughing without making you cry. I can't wait for the sequel. it's going to be huge, with robots and robot dogs, and i am all over it. from the begining to the end. i cannot wait to see the sequels! and to see the cat getting his revenge. the music is good too.", "X": null, "Y": 0, "idx": 360}
{"C": "Brooklyn. At the time I was a young child and saw this New York's downtown hotels and guesthouses, I sat in awe watching all the sights, sounds, smells, and clamor of the staff. What little I knew of life there, I was captivated.", "X": null, "Y": 0, "idx": 361}
{"C": "things - acting, to me. you can do about a million other things - I got music to a million other places. and people still buy me things they wouldn't buy for themselves - it's not that I'm unmotivated but it's just that you can do about a million other things - it's just that you can be fantastic at any other thing - the music is perfect and creative and fun to do with.", "X": null, "Y": 0, "idx": 362}
{"C": "amazing and inspired stunt work, great performances by everyone, and even better effects. This movie is daring, and provocative in a way that you can't help but look into the eyes of the characters and wonder how they are feeling. I wish i had more of this kind of film coming out, perhaps i'll find something to amuse me as i watch this film. 10 out of 10.", "X": null, "Y": 0, "idx": 363}
{"C": "engrossing original stories, it has been forced to re-hash the ideas of The Jazz Singer as recorded in the famous film. It works as a stylized, realisticized version of a single week in 1936 and also an adequate portrait of the time and decade. The key is in the acting, the detail, the reaction to the news that radiates from Anderson's brassy, big-boned world of pianos and dancing.", "X": null, "Y": 0, "idx": 364}
{"C": "Chase. One of those movies that you buy ad infinitum on eBay, and then swear off...the pain and suffering of watching those pompous men put their not-so-charming girls into a microphone and use 'another woman' to paint them with. Alas, Alas, Anne Rule has passed (Lou Diamond Phillips died in 1958) and so I'm left with ", "X": null, "Y": 0, "idx": 365}
{"C": "on' and 'love story' themes in today's pop culture, which makes the teen experience of films like these look somewhat more wholesome. The pace of plot and characterization in this film is quite relaxed, and the fact that all of the characters are remarkably young, makes them seem not just more relatable, but pretty damn fun to watch, which should speak volumes for its appeal to young teens.", "X": null, "Y": 0, "idx": 366}
{"C": "the film to be appreciated by many viewers because of that, many wonderful things can be said about this film. Please, do not try to compare it with other films and movies, because of course, I was talking about this film as a movie and there are some flaws. The story does not show a nice and peaceful world. The drama is like the one in Thailand, that is centered around a beautiful big mother and her small daughter and husband.", "X": null, "Y": 0, "idx": 367}
{"C": "could come back and re-watch. I thought it was incredible. It took me back to my childhood with laughs and tears. I had been sick in bed for weeks before I saw this film. It was so good that I bought the DVD and gave it to my aunt. I can honestly say that the things I did remember from the film were almost as good, though some parts I wish I had not remembered.", "X": null, "Y": 0, "idx": 368}
{"C": "aries of the movement, the uncertainty of dreams and the difficulties in truly leaving the past behind, balancing ambition and grief in a way that allows us to view each new day with hope. And that's why I'm so happy to see this film being released on DVD. It deserves more exposure, and I think it will be a success. Nine stars.", "X": null, "Y": 0, "idx": 369}
{"C": "everything involving people being killed or dying is in trouble, the recent Victorians turn their attention to India and actually turn a blind eye. After that, the new gen or so living in the Palatial Gardens destroys everything and kills their guests with the help of a magnificent sword. Then the end... There is this sort of feeling that the screenplay is going to get very small and pedestrian.", "X": null, "Y": 0, "idx": 370}
{"C": "of Jennifer Aniston, Ellen Barkin, the Alexanders and Peggy as I have listened to many of their speeches. Love them or not, they are all brilliant performers and brilliant actresses. The work they've done over the years is invaluable as their life stories show that any love that has survived can be even more powerful than their most fervent dream.", "X": null, "Y": 0, "idx": 371}
{"C": "sequence and Peter O'Toole is perfect as the nearly invisible Christian bounty hunter. The supporting cast, despite being so ridiculously well acted, has a fine sense of comic timing. All in all, this is my favorite movie of all time! The idea that God exists, whether he be the Devil, Satan, a devil, the Devil's hand, God is still in the Bible, and the Devil can still be found in the Bible.", "X": null, "Y": 0, "idx": 372}
{"C": "zer and Jack Lombardo make a fine pair in their roles as the reluctant college buddies who meet at a bar one night and become lovers, destined to end up entwined in the mistress of a murderer, Dexter Kelley (Rock Hudson), who has become someone else's companion after being attracted to her in the last place.", "X": null, "Y": 0, "idx": 373}
{"C": "spoiled by the fast pace of the actions scenes, compared to the stories that were in the television. It was also a movie where Dr. Harris took a leaf from his previous movies and even a great storyline for as a director. All of which suggests that Dr. Harris, quite fortuitously, is a former presenter for the old movie talk show ", "X": null, "Y": 0, "idx": 374}
{"C": "have a very limited and shallow experience of the world, when it comes to the natural world, with what little of it remains. A few of us may never be able to imagine life before 2000, when everyone was using cell phones, when there was a space colony, the big telecommunications firm, the world wide web. Most of us would like to be alive now, in another day and age. We dream.", "X": null, "Y": 0, "idx": 375}
{"C": "73 (out of 100) Mark Clapton Watch it if you dare! From the start, the movie has a really strong flow, with everything perfectly in place: a clean, clear story, rich characters, and brilliant performances. A sure winner. Title (Brazil): Prismatic Paradise (Denis Vidal) 2011 - 98 min.", "X": null, "Y": 0, "idx": 376}
{"C": "the few movies that kept me awake and engaged as it brought people together from all walks of life for a few laughs and a few observations. The costumes and settings really make the movie for me. The performances of every character in the movie are amazing. The story is gripping and compelling. It is one of the best crime-comedy films I've seen in quite some time. Every plot twist will make you laugh. The characters really make you care.", "X": null, "Y": 0, "idx": 377}
{"C": "there was nothing much like it at the time. This was one of the reasons I was so excited that the Independent Filmmaker’s Guild presented this film for its premier on June 10th at the SRCC in Toronto.", "X": null, "Y": 0, "idx": 378}
{"C": "Two friendly full grown mothers work as high school teachers at a local middle school. One teaches a group of grade school children and the other works with an extraordinary type of adult, a dad who can only connect to us through the manner of his own young daughter who has just been taught by the teacher who he herself feels like she knows, and all the while really being entertained with the slightest touching and cornball moments with each student that she encounters on the way. ", "X": null, "Y": 0, "idx": 379}
{"C": "attempts to uncover his true personality were depressing, she could always tell that he did not see her as that. so it is almost painful watching a picture like this that makes you feel horrible about your life. <unk> It<unk> s almost like God<unk> s attention to the pains, the way you felt, made you put this movie on a shelf, in a boxes without caring, even without having a smile on your face.<unk> ", "X": null, "Y": 0, "idx": 380}
{"C": "artist's intense unease and desperation. the opening scene of a failed relationship between a curvy young man and a decrepit old man is heartbreaking. It is what gives the film an absolute edge. and it is a wonderful gesture to present these seemingly contradictory characters in the company of such a fantastic and original cast. black and white cinematography and beautiful locations and music.", "X": null, "Y": 0, "idx": 381}
{"C": "comedy offers a contemprary romp with enough history to appeal to any collector, and if in the mood for something a little heavier and gentler, stay after the movie and dine at the immensely overpriced restaurant that appears at the beginning of the film.", "X": null, "Y": 0, "idx": 382}
{"C": "film that possesses the subtlest and most astonishing blend of philosophical questions and implausible escapades that come along with James Cameron in his exploration of humanness. ", "X": null, "Y": 0, "idx": 383}
{"C": "your time and money. The combination of the hot springs and good hearted people are actually funny. The friendship is a great way to spend the movie. The only thing I didn't like was the ending. The dialogue is so bad, and they seem to be reading from a bag of air. Maybe they were trying to make a romantic comedy. I'd be willing to give it another chance.", "X": null, "Y": 0, "idx": 384}
{"C": "Spielberg takes one of the heaviest hitters in American cinema (the affable Fred Astaire, with his aching back and excruciating neck), and makes him look brilliant. The fact that the doctor-turned-comedian has turned into a Woody Allen clone only adds to the movie's charm. Not only is the audience easily entertained, but the food for thought is constantly tickling the table.", "X": null, "Y": 0, "idx": 385}
{"C": "ark and mean spiritedness about everything, including what should be done about the debt. and what we should do about these loans and other financial 'deals.' between the government and the institutions of the U.S., but as a statement of American exceptionalism - its fearlessness as opposed to timidity. it's a portrait of American power, and its ambitions.", "X": null, "Y": 0, "idx": 386}
{"C": "two most powerful things in a society. There are no hollywood symbols in the movie ", "X": null, "Y": 0, "idx": 387}
{"C": "one of the most enjoyable action movies ever made, but also one of the best films made. In particular, the bandaged women, and the lead character of Jaye (Sofie Lee), who must choose between what she wants to do in life and what she needs to do to receive her soul mate. No one would be surprised if the fact that her fiancee is a corpse is shocking - they are probably already into marriage.", "X": null, "Y": 0, "idx": 388}
{"C": "romeda mysteries is now on DVD, as well as the complete and masterful source material, and once again they give us a super version of the fascinating stories that have interested us for generations. i hope the series continues. well done. was searching for this gem for ages. but was disappointed to find that it had been released by the same company who had made the original series, so don't let that tempt you.", "X": null, "Y": 0, "idx": 389}
{"C": "work, that gives it the power of a live show. ", "X": null, "Y": 0, "idx": 390}
{"C": "budget rockers that will satiate the alternative rock aficionados and thrill the extreme-minded.", "X": null, "Y": 0, "idx": 391}
{"C": "as little Annabeth's mother was disabused when she gave birth to her, an old man's disease compelled her to take on a snatching attitude that can only be described as impossible to get behind. Her choice of men has reverberated through the generations with repercussions that reveal how conservative parents can truly be...", "X": null, "Y": 0, "idx": 392}
{"C": ", if not better than most movies about haunted houses. Most likely the main reason why people like this movie so much is because of its remarkable scenery and vivid animation. However, the very strong cast of truly talented actors and actresses does not easily lend itself to an overly clever, well-paced and super cute haunted house movie. For fans of horror movies with enough content and funny moments, this movie is your best bet.", "X": null, "Y": 0, "idx": 393}
{"C": "entertainment. With a brilliant screenplay by Nicholas Hytner and a fascinating set of characters, this film oozes with authenticity and poignancy. With such warm and engaging performances, it's a shame that it's too short. It would have been wonderful if the wonderful George Clooney had been given more screen time but instead he's given none.", "X": null, "Y": 0, "idx": 394}
{"C": "a heroine in her own right. My name is Sara Hopkins and I'm a senior majoring in Criminal Justice. I studied and worked with my hands at the Royal Scottish Academy of Dramatic Art where a lot of the best short-film makers (Moleman, Hockney, Olsen, Moore and Horne, among others) went to school.", "X": null, "Y": 0, "idx": 395}
{"C": "Is the End of the World,' which, he had a little trouble understanding and mainly figured he just had to be more of the intelligent type to get a time machine going on. It's a nice film, and you could probably buy a copy with a used rental library. I just might.", "X": null, "Y": 0, "idx": 396}
{"C": ". The drama is thrilling. Everyone seems to get a bit bored and its always nice to see something different. Not every movie is immediately great but for the most part, its worth watching. I wouldn't be able to watch this with my kids but my eight year old son and daughter-in-law loved it. The scenes between the middle aged women and son and daughter is great and the good music fits perfectly.", "X": null, "Y": 0, "idx": 397}
{"C": "of atmosphere, psychological disquisition, psychological torture, terror, despair, pain, hope and survival. The very definition of savagery.", "X": null, "Y": 0, "idx": 398}
{"C": "dotes that relate to it, this movie offers an unexpected, incisive view into the evocative individual stories of two seemingly completely different women. You walk away with a fresh appreciation for their perspective, a new appreciation for each other, a new appreciation for their roles in this film. It is a beautiful film, and a moving one.", "X": null, "Y": 0, "idx": 399}
{"C": "I saw this movie, which I believe was shot in King County on 19th Street (a Brooklyn mainline), at the Cineplex on Saturday night. On the ticket rack was a self-addressed, stamped envelope. I've seen a lot of movie theaters over the years and have seen most of the times people were looking at it and thinking of it. I guess it was time to film the next one.", "X": null, "Y": 0, "idx": 400}
{"C": "the later Greig era: footage of Croton Castle, Hillwood, Evansville, and a performance by Freemont, Winslow, McRae, and Deacon. This edition has sound, and some of the production numbers work and are delightful. Neal Stone has some stirring moments, including a moment where he builds a snowball in a cellar.", "X": null, "Y": 0, "idx": 401}
{"C": "- it just happens to focus on the wrong characters. There are some who have got a better chance at winning in a topless waffle contest than Amy Roberts. A girl, had she not got her pocket knife, or a gun, might have committed suicide for it.", "X": null, "Y": 0, "idx": 402}
{"C": "It is truly like a film, like a soft fairytale of what a movie can be. If a movie is easy on the eyes a quiet scene in the forest or even a classic of the post war era may be what you need to enjoy, and there are several that are in every film you see these days. Instead of a film, we should call it the first television special. Talk about old-fashioned.", "X": null, "Y": 0, "idx": 403}
{"C": "DVD extras include a fine commentary from Roger Ebert, directed by Sam Fuller, on ", "X": null, "Y": 0, "idx": 404}
{"C": "in movies. The climaxing scene is absolutely fantastic and stunning. This movie is one of the best epic serials of all time. Whoever made the movie has certainly left a huge impression on all the viewers of the internet. Unfortunately, this movie doesn't have an english dub so i guess this movie can only be watched in the uk. For those who loves manga i really think that you will enjoy this movie. Highly recommended.", "X": null, "Y": 0, "idx": 405}
{"C": "ages who still seem to get into it years after seeing the original A Bug's Life and are drawn into the more colorful and complex story. The characters are likable and well-developed and feature lots of songs, dancing, and wordplay that keeps them interested throughout.", "X": null, "Y": 0, "idx": 406}
{"C": "storyline was quite good and the acting in general, however, i still wouldn't recommend this film to anyone. its almost like an ordinary dance film. its fun to watch though and has some very nice people. i think it was worth a watch..!! some are angry about the DVD release.. but personally, i felt that this movie was the best i've seen, including ", "X": null, "Y": 0, "idx": 407}
{"C": "very moving story of an Armenian couple, both brought together by the death of their aging father who left them a lifetime of memories and death--and what it means to those who have lost a family member. Basically, the film is a man-bashing ", "X": null, "Y": 0, "idx": 408}
{"C": "no other actors so good, in fact. they were so good that I wouldn't hesitate to recommend 'Starry Night' to anyone who was looking for a fun night at the movies or a light lunch with friends. the story is so cute that you can't help but like the characters, which can be thought to be based on real people, the best part of this movie are the characters. though the ", "X": null, "Y": 0, "idx": 409}
{"C": "Betjeman is made all the better because the script doesn't fall far short of perfection. Actors have their lines perfect, diction is spot-on, and the pacing is perfect. Peter Falk is luminous as the patient writer-professor-comedienne of the working-class Philadelphia family.", "X": null, "Y": 0, "idx": 410}
{"C": "story of a boy who meets his destiny and cannot stop thinking about the woman he loves. The movie is filled with unexpected twists and turns and it is one of the best example that comedy genre can play on several levels. The actors play their roles with great precision. The young man has a strong sense of values and it makes his plot line a little more interesting and well-designed.", "X": null, "Y": 0, "idx": 411}
{"C": "everlastingly fascinating historical period that will be difficult to watch without passion. The film manages to draw us into the lives of two people whose stories make up the majority of the first chapter, who help to shape the lives of many others in the passage. Two brothers. One father, one mother. And what a vivid and beautiful family they have. Heartbreak, love, friendship, sorrow, dedication, love and abandon.", "X": null, "Y": 0, "idx": 412}
{"C": "-boxer story, and goes on to the usual post-warrior run of good guys vs. bad guys/evil guys vs. good guys, but always fun to watch. Go see this film and you'll go home with a smile. Not a great movie but a good one. Highly recommended.", "X": null, "Y": 0, "idx": 413}
{"C": "film, you'll really like to watch Fargo, it's charming, cute, entertaining, and highly enjoyable! The life story that unfolds here is a delight and it keeps you guessing all the way to the end! This is a very good film for the whole family and it has absolutely nothing to do with reality, whose real name is Jennifer Randall.", "X": null, "Y": 0, "idx": 414}
{"C": "' back to life - but makes a bloody good film, too. I also quite enjoyed the actors' performances - particularly the very well done Portman. The special effects in this movie, which is basically a ride through a ghetto environment (and a superb one at that, thanks to Tony Scott's masterful work) are truly beautiful, and a favourite with horror fans.", "X": null, "Y": 0, "idx": 415}
{"C": "br>*****EVERYBODY love for magic is something much bigger than just hearing the magic words. This movie is really something for everyone. Who was not blown away by the magic and vision of the movie, you'll never forget that because you have ", "X": null, "Y": 0, "idx": 416}
{"C": "about this movie is that it looks at a part of history that most people do not see (when they look at the Germans who dominated the world during World War Two). This is the truth. And we should all try to work with that truth instead of seeking to exploit it. The courage of those who fought the Nazis and the courage of those who worked to defeat it all, is part of what made Europe great.", "X": null, "Y": 0, "idx": 417}
{"C": "a few weeks ago. What a difference the digital pans and zooms have made to this movie which has run nearly two hours! Where some thought it was a half-way point, I think the 84 minutes does justice to the very unique storyline.This is a great example of big screen cinema at its best - and all thanks to a savvy director such as Steven Segal. In terms of big screen vs.", "X": null, "Y": 0, "idx": 418}
{"C": "at its own inspiration, Crash combines its own particular form of hilarity with the refreshingly un-systematic appreciation of the workings of a classic thriller. Experiment with a version of flashback that allows your imagination to roam, at the same time giving you a clear idea of what the movie is all about. Powerful and unforgettable.", "X": null, "Y": 0, "idx": 419}
{"C": "delightful surprise. the background scenery was wonderful, the acting is invigorating, and most of all it's true. my only complaint is that this movie was put out too late in the year, and we didn't see a second of the cartoon. who cares? they're already playing and that's all that matters. this is a nice movie for kids, not as good as the real Disney, but a nice movie to view for the family.", "X": null, "Y": 0, "idx": 420}
{"C": "the movie, all of them from what I understand were part of a school history project. As you will see if you watch the movie, this is really not the case. After my first review of this film and not too much the second, I was overwhelmed and almost laughed out loud. A fine cast makes the film work beautifully and you can tell that the actors all care deeply about the characters and the plot. I also liked the music score and the daytime television images were wonderful.", "X": null, "Y": 0, "idx": 421}
{"C": "IE! Recall all the happy moments and all the lost ones! And I loved it even more because it's such a touching comedy, and not very poppy or sweet... :) but you can tell that it was a touching time :) even if you do not particularly like porno, this is a very amusing movie, I actually think it was one of my all-time favourites.", "X": null, "Y": 0, "idx": 422}
{"C": "s why I give it a 9 out of 10 instead of a 5 because it is too ambitious for me. I think the two best actors in this film are Elisha Cook and Denzel Washington. I also think the direction is superb and the two greatest supporting actors in this film are Elizabeth Taylor and Reggie Dunlop. The script is very well crafted. Just enjoy it. Go see it and see if it fits your style.", "X": null, "Y": 0, "idx": 423}
{"C": "movie lover, especially those who like movies about the life of a Vietnam veteran. The small complexities of the main character's life show us this real man, that, like many people, didn't stand a chance in Vietnam, even though he's the only one in a sense who can feel sympathy for him. It shows the contrast between him and the slightly more optimistic, more caring character of all other peoples' attitudes.", "X": null, "Y": 0, "idx": 424}
{"C": "t just contain a dog-eat-dog plot and is actually funny, full of expressions, dance routines, quips, and sex. And i also find it to be original. We can even relate to the characters. The entertainment value is very high. And i recommend this movie to anyone, especially the ones who might find themselves at the end of their life.", "X": null, "Y": 0, "idx": 425}
{"C": "Walter Martin movies I have enjoyed. It has an excellent cast that includes John Lithgow, Janeen Reno, Jon Voight, and many more. Its also set in Los Angeles, so it offers the big city life as well as the small town feel. This movie delivers for what it's about -- people going to work, going to school, and figuring out how to get by, with all the pitfalls of this lifestyle.", "X": null, "Y": 0, "idx": 426}
{"C": "beautifully directed, intelligent, and funny story of two fading star souls finding love and each other. Los Angeles is the setting, and I hope their love will last. Wouldn't the viewer miss something if someone didn't leave them? The dream will live on. A must see for Singin' in the Rain lovers. ***Scream*** is a fresher take on Elvis' movies.", "X": null, "Y": 0, "idx": 427}
{"C": "about it on the net; it seemed to me to be an important piece of new artistic work. ", "X": null, "Y": 0, "idx": 428}
{"C": "me proud of being an American, which I haven't been in years. I've watched every bit of the movie dozens of times, and I've seen it with others, but this one was different, and I wouldn't recommend it to anybody else. It was a great gift to my brother for Father's Day, and it really touched my heart. I also have an affinity with the heroes. I was a fan of those comic books.", "X": null, "Y": 0, "idx": 429}
{"C": "and a new cast and crew in an attempt to give you a movie that will draw people in. Without much surprise, this movie is about four friends on opposite sides of the bedroom wall. Well at first the friends seem to be at loggerheads (although i think it is because of the casting and the presence of Matthau and Burton) but the friendships soon build up.", "X": null, "Y": 0, "idx": 430}
{"C": "th-century Roman Catholic ruler... The conception of a god is part of the nature of modern humanity, because man is inspired by the ", "X": null, "Y": 0, "idx": 431}
{"C": "unique game, but the way it was presented and how much it was executed was surprisingly elegant.The graphics were slick and cinematic (for the most part) and the 3D mode was simply amazing.The extra features on the DVD of the game were also a delight, largely because of a group of talented people at the Walt Disney Pictures who apparently knew some scripts and how to get the best from them.", "X": null, "Y": 0, "idx": 432}
{"C": "this movie. Most of the reviews focus on just the storyline, but I also like how it makes the audience think. Don't go see this film if you don't like deep-meat, stylish movies with screenplays full of action, suspense, and suspense, and very realistic acting. I think that the movie is shot beautifully and represents the big budget action movie of the 90s with a stellar cast and stunts.", "X": null, "Y": 0, "idx": 433}
{"C": "able to sit through. Chris Anka makes some good observations on the world of geekery and makes some outrageous and fascinating observations, all the while weaving them together with all his usual dry humor. His character Fred Allen is at the heart of the material, but also by turns engaging and at the same time unnerving. He drives away the writer with his fast ideas and with comic conviction. All the others start to wonder what has gone wrong with the once promising writer.", "X": null, "Y": 0, "idx": 434}
{"C": "appeal to audiences as much as this one does, but the part where the show shows the pains of war is well executed. all members of the crew are very gritty and i felt their pains all the way through. good stuff. well worth a look for all comedy fans. no idea why some people hated it though, but i guess i just did.", "X": null, "Y": 0, "idx": 435}
{"C": "and precision. As the story unfolds we can easily see the ingenuity and composure of the king of men. Absolutely brilliant. If only I could think up a good flaming chest that would pull off that wig. But I cannot imagine anyone do it better. We can all learn from Shakur. i especially like the scene when she's impaled by some window that she's deflected from.", "X": null, "Y": 0, "idx": 436}
{"C": "another uncredited F. Murray Abraham, and showing the work of a brilliant - if unreal - director. I absolutely loved it! Perfectly written, scripted, acted, evocative, and shot beautifully, it doesn't get better than this. Eighties-style movie staring a talented young cast (and perfect for TV as there are a couple of beautiful young women in it).", "X": null, "Y": 0, "idx": 437}
{"C": "on the writer/director's response I chose two. 1. The way it's packaged as a fairytale with the whole protagonist transported in a time machine and transported into the past based on what we already know is going on in real life 2. The approach to horror and the dreadful scenarios that must be overcome in order to survive the close encounters with the living dead 3. The actors portraying the cast in their performance.", "X": null, "Y": 0, "idx": 438}
{"C": "one of the best movies ever made. Not quite as brilliant as Citizen Kane or Throne of Blood, but well worth the effort. [note: goditar is for males only -- for females only please read first.] I first saw ", "X": null, "Y": 0, "idx": 439}
{"C": "way to punish people who can't stomach their working lives, as Coulter does in this totally real and totally believable portrayal of a high school grad, and also one who has lost her wife to leukemia, the (then) mighty queen of Hollywood. Audiences will be dismayed by some of the dialogue, and certainly the performances, which are based on the real people behind the events of ", "X": null, "Y": 0, "idx": 440}
{"C": "'t take itself too seriously and still has a story to tell. It has characters that matter and you care about them. It focuses on the relationships between the characters in the story. It has strong, believable dialogue and some excellent fight choreography that will make you look at the cinema with your eyes wide open. In addition, the music is pretty good too. Although it was not really consistent, but I liked the major players and the acting is good too.", "X": null, "Y": 0, "idx": 441}
{"C": "making reference to one of the most ironic statements of an American Idol victory: ", "X": null, "Y": 0, "idx": 442}
{"C": "to be the worst option in the world and there is help for those who need it..", "X": null, "Y": 0, "idx": 443}
{"C": "is pretty funny. It is a terrific prank film that pokes fun at the recent political events and the reaction from the outside world. The thing that appeals to me about this film is the way the comments are pointed out. The bloke that says something off-handed on their program not only didn't do it in a bad way, it was offensive.", "X": null, "Y": 0, "idx": 444}
{"C": "Stewart, Arthur Koestler - is the director's words to the audience about love. Susan Boyle, Joan Blondell, Lynne Pell, Barbara Stanwyck, and especially Eric Braeden, Swoosie Kurtz, Josh Lucas, Jack Black and Louis Kootman are all in love. On several occasions we see glimpses of arousal and laughter (e.g.", "X": null, "Y": 0, "idx": 445}
{"C": "teen farces with all their petty innuendoes were a diverting selection.... will the race get more than the usual four; and I just might start watching soccer matches again. I think the trend here will be to lower the standards, but we're all looking for high standards. This movie also featured several elements that might appeal to some but not to others.... songs are OK..", "X": null, "Y": 0, "idx": 446}
{"C": "agree on the last verse. But all the other lyrics are done for choirs, and so they have to pick a song that already has verse arranged for them in each of the other two canons. Some of the songs here are already arranged for choir, but haven't had lines arranged for the canons, and so had to edit the song to rhyme with the verses of the others.", "X": null, "Y": 0, "idx": 447}
{"C": "s greatest hero, Tom Cruise makes a return to the screen in The Great Gatsby. Through the tender, expertly done portrayal of Mickey Rourke (a dashing agent who smuggled a cure to his family for an incurable disease), Cruise creates a startlingly beautiful heroine that defies stereotypes.", "X": null, "Y": 0, "idx": 448}
{"C": "films of the year so far, even though it is the only film that had Kate Winslet in it (that they ever made.) Kate's in this film, just like in Jane Eyre. You just have to see it. Where she's in it, is one of the best and infamous scenes in film. I haven't read Jane Eyre but have read the book and she's one of my favorite fictional characters.", "X": null, "Y": 0, "idx": 449}
{"C": "nua Achebe, an Argentine writer and film director best known for his shorts (", "X": null, "Y": 0, "idx": 450}
{"C": "It is a thoroughly enjoyable movie. The cast is very good and the story is clever and engaging. In addition, there is enough sex and nudity to keep you interested and the women in it are pretty hot as well. John Ritter is in the film as a heterosexual, which is about right for him given the gender of his script.", "X": null, "Y": 0, "idx": 451}
{"C": "on everything because the standards of what is reasonable have already set high. What is different is the way you treat the circumstances in life.", "X": null, "Y": 0, "idx": 452}
{"C": "more highly than it has been. Sidney Lumet's comic genius is on display, making a clever and often hilarious action comedy. It's a film that defies all the parameters of storytelling, but that is all the better for it. If you love comic genius, action, comedic plot, and exquisite performances, then you'll love it. ", "X": null, "Y": 0, "idx": 453}
{"C": "to describe many things, from ballet music and Native American dance numbers, to recordings of soprano and alto solos by jazz pianists. Most of us know nothing about those genres. In speaking with ", "X": null, "Y": 0, "idx": 454}
{"C": "because it has such a low point in life (baby for four months, money,no meaning to life) & then it moves ahead and up.So after you enjoy the movie, you become more open & appreciative of the little that has gotten you through the years.I loved it.Last I looked, there were 15 million other people watching it and it is playing at Qobuz on DVD.", "X": null, "Y": 0, "idx": 455}
{"C": "acious show is the same who created 'Why Else?'. Let us thank him for that; and best of all, welcome him as well! Oh, and happy birthday to us all!!", "X": null, "Y": 0, "idx": 456}
{"C": "stereotypical characters and racially stereotyping, is nevertheless a very funny little movie. It's also a terrific follow-up to my very popular article on Mystery Science Theater 3000 (MST3K).", "X": null, "Y": 0, "idx": 457}
{"C": "good reputation and an entertaining mood and an erotica feel to it. The movie has one flaw which I could never overlook- it has a moral ambiguity in one scene which has a threat/adversity to it. Now that is a bad moment, because that is meant to be a positive element. But I still thought this movie was a good one.", "X": null, "Y": 0, "idx": 458}
{"C": "the Warhol legacy, or the aching loneliness of its revolutionary legacy. But the film is a powerfully poetic ode to the misery of the world, and of the man in it.", "X": null, "Y": 0, "idx": 459}
{"C": "though we live on a'real-estate' filled with mansions and condos, there's a lot of appeal here. It's the Manhattan you never knew existed in the broad, flat middle of nowhere, a city that was once nearly empty but is now exploding with apartments, offices and shops. Manhattan is a cinematic playground, a playground where camera attention and artistry matter.", "X": null, "Y": 0, "idx": 460}
{"C": "music,award winning.The cast is excellent: Kelly,Jon Heder,Robert Taylor,George Michael and Cindy Hill,featuring Paul Simon and Judy Garland,and an incredible performance by Patton Oswalt.The indie filmmakers of Catfish must be mentioned,their works truly deserve to be recognized for their contribution to the genre and the genre in general.", "X": null, "Y": 0, "idx": 461}
{"C": "so powerful. My sister and I would sit and watch this movie every year. It has changed my life. ", "X": null, "Y": 0, "idx": 462}
{"C": "never makes his victim feel alone. It's not about sophomoric comedy or tiny worlds, it's about eternal friendship. Any typical human being would fall in love with these two main characters in a heartbeat. They form a brotherhood of sorts, aided and abetted by good natured Dreyfuss. It's about past, present and future, freedom and a love that just keeps growing and growing.", "X": null, "Y": 0, "idx": 463}
{"C": "a sensational film in 1937 starring Selma Blair as one of the most memorable characters to ever appear in film. While it's not often that a romance about a TV disc jockey and a mistress is given a huge reception, director Victor Hanbury deserved it as much as any screenwriter, and this very entertaining film is proof that ", "X": null, "Y": 0, "idx": 464}
{"C": "s an American Pie movie, the new Stallone for us, but the wind/ocean splashes add a flavor of your own. I first saw this movie a few years back on TV, and you have to admit, the characters became more intriguing. It's a breezy, beautifully acted love story, where the two lead actors lay side by side, rather than constantly opposing each other.", "X": null, "Y": 0, "idx": 465}
{"C": "than this crappy remake of the Eddie Murphy movie, albeit aided by the fact it's so much longer. Critics have written it off as a waste of celluloid. It's too long, it's too slow, and it's probably dull. The movie was painfully slow. The scenes of Chapman doing his thing were simply not enjoyable.", "X": null, "Y": 1, "idx": 466}
{"C": "at least, when someone like Reed Hadley was the actor and writer and was capable of bringing the first story to the screen. or even the first book... which in the movie's current version, seem to be about a years-long-old-god, which if he had been alive to remember the events of his first book, one hopes, it would have been something that had some significance to the book.", "X": null, "Y": 1, "idx": 467}
{"C": "films which can contain fantastic action sequences and one or two decent special effects is no way to judge the quality of a project. The usual line that I hear from everyone from the San Francisco East Bay to Mexico City has been that the guns on the beach never shot someone, however, but that story is a standard one. The difference between ", "X": null, "Y": 1, "idx": 468}
{"C": "good actors. In some parts the film sounds like a sketch by a cartoonist that's never run on TV before. I would not rent the film, there are better films out there. The acting is amateurish and the comic situations are mostly unfunny and ludicrous. If i was in charge, i would shut off the electricity and fire in all the theatres.", "X": null, "Y": 1, "idx": 469}
{"C": "had been a proper high school comedy, we would have laughed ourselves into a corner. Why don't they just shot 'em in real-life? Obviously the acting is like someone hired from the anarchist video store. They can't act. This would be a comedy if it were real-life. I would have liked seeing those two contestants do a ", "X": null, "Y": 1, "idx": 470}
{"C": "ance, marital and sexual dysfunction, embarrassing star attempts, bellyaching and trivializing of ancient wisdom, gratuitous sex and marriage, nightmarish preoccupation with superhero schemes, gratuitous violence, stomach-turning slow-motion editing and apparent disconnectedness, seem as modern as the re-enactments in Mission: Impossible III, The Bourne Ultimatum and The Emperor's Club.", "X": null, "Y": 1, "idx": 471}
{"C": ", it's just awful compared to this crapfest. A mish-mash of miscast actors, choppy dialogue and pathetic attempts at ", "X": null, "Y": 1, "idx": 472}
{"C": "over-rated, predictable and not funny. The viewer can't connect the lines and could see a vapid and unfunny film before it, and it would be sad to be mistaken for a lame computer generated graphics to convey what it cannot see. Msnbc to allow the viewer to escape with its characters. Bland.", "X": null, "Y": 1, "idx": 473}
{"C": "ever seen in my life. in this film is a totally dumb, god-forsaken fake psychedelic trip down a murky, dusty, ancient road, where the sexy dame is trying to slash her male persuaders as he attempts to leave. the scenario and story is so far-fetched it reminds you of a kids drawing.", "X": null, "Y": 1, "idx": 474}
{"C": "gore-soaked reminder of the mindless terror one feels when crammed into a television set when something scary happens. what sort of sci-fi could possibly go wrong? - for those of you who haven't yet seen it - The Blob is on my top 10 most hated movies of all time, but this film was absolutely terrible.", "X": null, "Y": 1, "idx": 475}
{"C": "crocodile, turtle, whale and, with a little luck, hammerhead shark and a very nice camel, the donkey. that's all the good stuff you can add to this mediocre treatment of the classic novel by one of the masters of comic screenwriting, just to win a huge audience. do it.", "X": null, "Y": 1, "idx": 476}
{"C": "go, but this studio mess gives the supposed top 20 horror comedy genre absolutely nothing to recommend it. directors name is bernard nickleby, not the creators, they just let things slip by to the big screen. and that can only mean yelp is the way to go... the movie is really only bad in it's raw cut version. being a big fan of birns b.", "X": null, "Y": 1, "idx": 477}
{"C": "ghostly reflections has the same fascinating haunting quality as...the ending of the last Beatles' film but here the ghostly material is so opaque you may actually be shocked when you see the shiny SNES hard case (as I was) in the box of its DVD. a better performance in the original Beatles film would've resulted in the greatest hit of the year.", "X": null, "Y": 1, "idx": 478}
{"C": "the likes of whom only after it is certain that its destruction will occur. ", "X": null, "Y": 1, "idx": 479}
{"C": "linda turn the cabin into a diner where the veteran couple get help from three harried veterans, brash and brassy, who look like they've recently hung up their cigarettes and are leaving their cigars on the back porch to dry off. The film's two most noteworthy characters are Aubrey and Dan, who try hard but never succeed in mixing. Debra Winger's eccentric character is given just enough arc to keep the plot moving.", "X": null, "Y": 1, "idx": 480}
{"C": "language is shocking, and hardcore porn has been rendered tasteless. consider that mr. writer koestler has to cut out a great deal of the dialogue. I'm also tired of this movie. Maybe you didn't want to watch all the brilliant ten lines? You would be better off skipping this film. Hitchcock & Co got the biggest bang for their buck with this movie.", "X": null, "Y": 1, "idx": 481}
{"C": "film, which didn't hold up the second half : the penultimate act of a movie that should have made me sick.", "X": null, "Y": 1, "idx": 482}
{"C": "all about this one character, why should you give a damn about his social value, that's not funny, that's a kooky actor in search of the next Stephen Hawking. The actor is poor he behaves like a baby (much worse than these flats in his films), the dialogue is badly scripted and the characters seem to be trying to be more than they are.", "X": null, "Y": 1, "idx": 483}
{"C": "script more deadly than you think, what a waste of money! I like Michael Feldman but I don't see what people get so excited about this kind of a movie. It had much more potential and could be a lot better but the director got caught up in the drug obsession of a sloppy filmgoer and everything else about it is just too awful.", "X": null, "Y": 1, "idx": 484}
{"C": "be. It merely isn't very good, however - what it is good at is being bad. So bad that the most pleasant phrase in the English language has to be <unk> Shame on you.<unk>", "X": null, "Y": 1, "idx": 485}
{"C": "illogical that I did not know how to feel about it until I was turned off from watching it. The reason why the rest of the country was paying to see this is because its message was dug so deeply into my subconscious that I thought it was a really important message to share with the rest of the world. I wish I could describe to you in the few lines that I wrote about this film what I was really thinking. ", "X": null, "Y": 1, "idx": 486}
{"C": "ubbed into Spanish without even the help of subtitles. It's awfully preachy and crass and preachy, and devoid of any logic whatsoever. But it's a crass, funny, and pretty entertaining flick, and (like many of the others) has some great effects. There's the gonzo horror aspect of the monster-infested basement.", "X": null, "Y": 1, "idx": 487}
{"C": "dying flower it may last only a short while and then it's gone into the ether. But at least a film might as well die a death - there's nothing worth watching and for that you get five bullets. Snippets of narration, all the musical scores blare from hell and the acting is dreadful.", "X": null, "Y": 1, "idx": 488}
{"C": "garbage coming out of the era of John Ford and have a scene that would deserve an Oscar nomination.", "X": null, "Y": 1, "idx": 489}
{"C": "gangly and dumb-but-soft, if they're not chopped up into sections which are easy to figure out, then they probably were from a cartoon. (The thing that took me the most time to read, was this list of the various'spies' and 'plots' in the film, and that's the reason it took so long to read the back cover of this book.", "X": null, "Y": 1, "idx": 490}
{"C": "satirical look at life in the hot sauce capital of the world, ", "X": null, "Y": 1, "idx": 491}
{"C": "out of a disposable generic horror title based on a very bad remake.", "X": null, "Y": 1, "idx": 492}
{"C": "film is so strong that I didn't care about most of the characters except for the annoying foreigners and the creepy regulars. There's a touch of spooky danger to the proceedings, but those elements are kept to a minimum. The problem is the acting is very poor, a third actor just adds an extra touch of dread to the proceedings.", "X": null, "Y": 1, "idx": 493}
{"C": "offer and all the sadistic machinations of the US drug lord amidst an oppressive social and economic history of suffering have left this grossly unnecessary movie heavy on social commentary that may have been worthy of a television drama. Why do these dogs even bother with dialogue??..... It screams cheap and loses it on special effects which detract from the grittiness of the story.", "X": null, "Y": 1, "idx": 494}
{"C": "geeky love story because its monsters are gross and its characters are so ugly that you think it was filmed in a dark cave (funny, i can't help it)but in all seriousness it's a weird, disturbing, and mostly unintentionally hilarious debacle.", "X": null, "Y": 1, "idx": 495}
{"C": "come close to even stiflingly intense. This is a film that when directed to kids should be broadcast on HBO. My kids laughed through most of the film and the actors played their parts with more vigor than we saw in earlier reviews - and that is after more than three hours. Many moments felt padded out, with no real reason to care about the characters or why they were doing what they did.", "X": null, "Y": 1, "idx": 496}
{"C": "? slumming and scrooching is just as much a symptom of unhelpful and even distracting comedy as an excruciatingly boring script, for one thing. do not waste your time. if you do waste your time, go back to the bar and watch ", "X": null, "Y": 1, "idx": 497}
{"C": "from there. Nothing else to talk about. This sucked. Don't think I'm expecting a hit on its return, but man... is it a bad one. I'm giving this one a 5 but it was so bad, it earned a 2 only because it had the potential of being something extraordinary. It might have been a hit if it had been produced by someone with a sense of direction and writing, but as it was ", "X": null, "Y": 1, "idx": 498}
{"C": "ppy, and simply pitiful. its one big idiotic fight sequence, and nearly 60 minutes of utter boredom. the 'experts' seem to believe that the only people who can make good films are those who have already made one. as a result, the makers of this, ", "X": null, "Y": 1, "idx": 499}
{"C": "the viewer wonders how can such a talented actor such as Hugo Weaving, Stephen Rea, Megan Fox or J. T. Walsh have some such little talents.The absolute worst thing about this movie was the costuming of the heroes.It consists of a hundred people in suits who fight and shout over nothing.I was even disgusted by the makeup that was used on one of the main characters.", "X": null, "Y": 1, "idx": 500}
{"C": "lot are all in this class of bad movies but it can't be used to describe that badly done one. There's a clue somewhere that someone has some quick cash in the bank, but who? The problem with Hamlet is that you feel so bad for the actors playing Hamlet that you just want to get it over with as quickly as possible.", "X": null, "Y": 1, "idx": 501}
{"C": "except that the actors, who are no doubt well engrossed in their material, seem too fresh for their character, too lively, too wide a window of opportunity... not really here and yet, because everyone here seems to know what's good, it gives everything a certain success... only because, again, there's not too much room for creativity...", "X": null, "Y": 1, "idx": 502}
{"C": "The Great Depression just don't cut it. The comedy was bland, not very funny at all. The cast was very believable, but it's not a funny story, there was no suspense whatsoever. It was a dreary dull story, with many empty moments. The script was good, but it didn't add up. All in all I gave it 2 out of 10 because the narration by Anita Strindberg was good.", "X": null, "Y": 1, "idx": 503}
{"C": "you don't want out of a film, and nothing about a film that doesn't even deserve a 4/ rating. Three big stars is one thing, but to provide what they got is pretty much meaningless for me.", "X": null, "Y": 1, "idx": 504}
{"C": "Mr. Hill could not make a movie with this low budget. All I can say is ", "X": null, "Y": 1, "idx": 505}
{"C": "are really cute. the nice guy is annoying and dumb. the real bad guy is just stupid.", "X": null, "Y": 1, "idx": 506}
{"C": "fact a far cry from some of the early Romanian movies that were made in the 1960s. This is one of those movies that is so bad that it's good. Why? It looks so bad, it is so bad. The name is getting into some sort of a comical run around, it has the whole feel of a bad B film, no, no, no, it's worse than that.", "X": null, "Y": 1, "idx": 507}
{"C": "an emotional journey in favour of the supposed hot rod scenes. ", "X": null, "Y": 1, "idx": 508}
{"C": "and locations, and to the look of most of the film, but this isn't enough to overcome this film's relative lack of energy, punch, or originality. Unless you happen to be a demographically diverse fan of oafish vampires or a cult of oafs who are terrified of nocturnal sex, you might be happy to just not waste your time on this one.", "X": null, "Y": 1, "idx": 509}
{"C": "d think that had they left out the soundtrack to the actual classics, they'd have chosen to suck up the time for a dilapidated script, recycled special effects and even a botched attempt at convincing historical accuracy. No, it was directed to a group of wildly out of touch movie producers, who also wanted to support Mr. Moore's bid to become the best American director ever.", "X": null, "Y": 1, "idx": 510}
{"C": "some of the jokes were out of place, some of the humor was too forced and worst of all the teleprompter was way too loud and cheap looking. it was so silly it was like watching a 6 year old ramble on tv. this movie was like watching a 3 year old on TV. it is as horrible as i thought it was. get your f***ing mind out of here.", "X": null, "Y": 1, "idx": 511}
{"C": "good and bad that which passes for film, the writer-director of Dark Game (which was also written by Raul Julia), provides some campy, sweet, and simple entertainment, but he squanders the opportunity to make his director's film stick out.", "X": null, "Y": 1, "idx": 512}
{"C": ". When you make a movie about an average guy and a psychopathic cult, you have to think about the worst parts of the movie. This movie has no good parts, and the best part is when the cult leader is a psycho killer. This movie makes me feel sick. One woman says she has never seen such a bad movie.", "X": null, "Y": 1, "idx": 513}
{"C": "unker that has a cardboard tin hat on and talks with an alien accent.", "X": null, "Y": 1, "idx": 514}
{"C": "was hailed as a kind of cult classic. It is not, but it's one of the most despicable of the decade. I find it hilarious that the original cast of the film, of all actors, John Wayne, was given this very screen role. Wayne's imbecilic performance is cringeworthy. I give it two and a half stars.", "X": null, "Y": 1, "idx": 515}
{"C": "hideously shallow, the dialogue is silly, the camerawork is deeply amateurish, the dialog is inept. You want to feel so disgusted that you'll have the urge to yell at the screen, you won't. For those that saw it (even if not to the end), it's as if they had seen nothing but a week of zeppelin flatulence.", "X": null, "Y": 1, "idx": 516}
{"C": "i wasted three hours of my life to watch this ", "X": null, "Y": 1, "idx": 517}
{"C": "the dialogue is terrible, but otherwise the movie doesn't go down well with critics. The budget was obviously low. I wouldn't go as far as saying that the actors weren't good, but their performances were below-average. I know I won't be watching the DVD.... There's nothing really shocking about it, but there's nothing really special about it. I guess I don't like aliens that well....", "X": null, "Y": 1, "idx": 518}
{"C": "movie about a drooling, glass-smoking fellow with cancer (who yells about how much his hotdogs are costing him) who is supposed to be in a motorcycle accident, and then turns around to try to find someone else to kiss.", "X": null, "Y": 1, "idx": 519}
{"C": "'t live up to what it wants to be. It is like nothing else. If you have had a chance to see it in a theatre, I advise you to go. If you haven't yet, yea you should! Although I agree with me of the view of the producers. I would agree of the director, what this is.", "X": null, "Y": 1, "idx": 520}
{"C": ", but ultimately these auteurs have too much already and there's no sense of where to go next. The fact that this movie was made in 1984 hardly contributes to the fact that it is no longer a gem. It's certainly only a half-eaten one. The worst thing about the film is that there's nothing funny about it.", "X": null, "Y": 1, "idx": 521}
{"C": "ve seen in my life, this one is a showcase for the equally wooden hands of every director working today (writer-director, actors, producers)...this one just ranks with the worst of the lot. The acting is terrible, the story is bad, and the effects.......well, I just don't care. I just found the acting to be lacking in any way. I think it's because the actors were running on caffeine throughout this entire project.", "X": null, "Y": 1, "idx": 522}
{"C": "was terrible and its narrative style lacked substance. Characters are stereotypes, the plot was pedestrian and the entire movie was badly acted and directed. The only good moment in the entire film was when John Saxon (Michael Caine) is forced to give up his life of crime and kill off his drug dealer boyfriend. The part in which he killed them was improbable and the villains played no character.", "X": null, "Y": 1, "idx": 523}
{"C": "a hit and makes women wonder why they even bother to go out. you should go to the theater and not waste your time on this trash. in the process of making this pretentious, stupid, and unfunny slam-dunk, director Adam C.", "X": null, "Y": 1, "idx": 524}
{"C": "is the movie to see. Prompted by artist Paul McCartney, Michael Jackson, John Lennon and Quincy Jones, it seems as though the genre had finally been cleared of its nasty reputation. A handful of talented musicians turn out in front of the camera to perform their performances, which include some great choir songs. Sadly this is the end of it.", "X": null, "Y": 1, "idx": 525}
{"C": "If you can watch it without drooling, you may not even notice the flimsy gore and ridiculous gags. This is a good example of why even a good series and director can be wrong about a series that has been dragged on for three seasons. It feels like they are playing with the audience. Ultimately, it's about a dozen different people that fall into this category.", "X": null, "Y": 1, "idx": 526}
{"C": "EL ISN'T ENOUGH TO GO THRU THIS...... (at least not in the minds of most members of the audience who were lucky enough to snag a ticket.", "X": null, "Y": 1, "idx": 527}
{"C": "the worst films that I have ever seen. It has an overlong running time, is slow to develop a plot and never really does anything with it. Like i said, there isn't much plot and the only thing that seems to happen in the movie is noises around people. This isn't a bad thing. I just don't like it. I thought that it was much better than Ocean's 11. Too bad.", "X": null, "Y": 1, "idx": 528}
{"C": "and worst of the summer blockbusters, plus the only definite plus is that it is shot in Technicolor. The sets and special effects are also a joke. Why would a director even attempt to build an intricate prop, much less a continuous background, underwater for scenes that will never come out in a film?? This is the MAIN OFFENSE of ", "X": null, "Y": 1, "idx": 529}
{"C": "is depressing and dull. It's like indulging in a slice of popcorn fare - only this time, it's as dark as the well-armed truck it is locked in. Sure, it's ", "X": null, "Y": 1, "idx": 530}
{"C": "the product of an idea borrowed from an old Kodak flick. I can't think of any good reason to pay $12 for this at Best Buy or anywhere. There's nothing in it. There's nothing special to look at, nothing interesting or original, and nothing to enjoy. Why? Because its own genre is bound to have very little of that. Only one redeeming quality is the picture-perfect sex scenes. There are tons of them.", "X": null, "Y": 1, "idx": 531}
{"C": "cable and it was a revelation. A beautiful young woman is run over by a bus and seems to be in a horrific car accident. She is also the victim of a road accident and will die in an abyss of death. This sounds pretty grim, but it isn't. The ominous resounds of a crashing bus echo in the background as a camera rolls.", "X": null, "Y": 1, "idx": 532}
{"C": ", the dialogues which are seen more than the dialogues themselves that creates it. Even when a cameraman catches them in script or scripted shots he becomes an exhibitor. A movie in its own right is never able to mirror what it has seen. The narration by a dying Toni Collette is one of the few positive points.", "X": null, "Y": 1, "idx": 533}
{"C": "Michael Apted died in the Navy of course, maybe thats why this movie makes you think. but that makes it look like a cheap college movie, and I bet everyone else did too.the weirdest part of the movie is the fact that their is a cop that overhears something and goes and checks it out. you think he might have seen something of this movie because we get the coy look from him.", "X": null, "Y": 1, "idx": 534}
{"C": "I wasted time watching this wretched retread of a movie. This movie reminded me of Stephen Hawking's famous writing of ", "X": null, "Y": 1, "idx": 535}
{"C": ", but thought I'd only stop there. This is by far the worst movie I've ever seen. The acting is abominable, the plot is pathetic, the dialog dreadful. And who was the big character who appeared in this movie? We need more people like this. he may be one of the few actors who can actually act, but he's awful and he's annoying.", "X": null, "Y": 1, "idx": 536}
{"C": "as tedious as the writers and director. Most of the dialogue sounds like something a scholar would say to his doctor in some obscure medical school: a German student in Spain is trying to explain to him Latin while other students just sit in the classroom, telling him what to do. That is where it stops, and makes the story sound like a Norwegian expressionist film from a 100 years ago.", "X": null, "Y": 1, "idx": 537}
{"C": "'a mutant who does not know how to use a computer.' can you say stupid? ", "X": null, "Y": 1, "idx": 538}
{"C": "hopelessly boring, misogynist, stereotyped and phony effort by oscar nominees david spade and leonardo dicaprio, a catatonic vignette of an acting career with nothing memorable about it", "X": null, "Y": 1, "idx": 539}
{"C": "only film to bring me to tears. The acting, the dialog and the blood were terrible. How this film is as good as other contemporary favorites based on true stories is beyond me. Not that this is a bad film. But the scriptwriter could have done better. The acting is nonexistent and the plot makes little sense. If you are a fan of art, history, country music, or a true-life story, then you will appreciate this film.", "X": null, "Y": 1, "idx": 540}
{"C": "(a bit unintentionally hilarious since the main character is used as a metal head impostor) and/or is associated with sex as his real talents are unrealized and the problem is that even the impostor hair is mostly ridiculous and rather dull....until the last 20 minutes when the ending is pointed out to us....", "X": null, "Y": 1, "idx": 541}
{"C": "rehashed jokes, it ain't so great a guilty pleasure -- which is probably what a lot of moviegoers will feel when they see it....think ", "X": null, "Y": 1, "idx": 542}
{"C": "is a cinematic imitation of 'Tinker Tailor Soldier Spy', satirized by 'Syfy Show's' 'Smallville' was a profound disappointment. Instead, when you saw the real show it was so different, funnier, and appealing that you felt disdain for ", "X": null, "Y": 1, "idx": 543}
{"C": "- this movie is far more tedious and dreary than the rest of the summer offerings on HBO or other cable channels... ", "X": null, "Y": 1, "idx": 544}
{"C": "mill wheel that did his awful movies: he's cast, where he needs to be, in roles of no real dramatic value, his audience all assumes it's him, he gets laughs for a certain twee feel-good factor, and people look up to him as a role model, but most of the time it's not him; he's the villain in the worst sort of way.", "X": null, "Y": 1, "idx": 545}
{"C": "for TV movie that it is... this is nothing new... it would've been better to just cut and paste the (now) familiar writing, dialogue, pacing, tone... but this is one sloppy love story that doesn't have enough plot to make it worth viewing.", "X": null, "Y": 1, "idx": 546}
{"C": "s something going on, and the viewer probably won't care. The leading lady is beautiful but for the entire film, she just cannot seem to stop clamoring for attention and being tried, tested, and judged.", "X": null, "Y": 1, "idx": 547}
{"C": "vegas' and'mau et le port', and they defy bad acting or direction. they are utterly unbelievable, and ultimately half-genuine. the director seems to have had a script for an adventure storyline he could have written himself. i imagine he was mad at the producers of 'london meets la vegas', because he must have thought they were overacting and wasting actors.", "X": null, "Y": 1, "idx": 548}
{"C": "movie should consider this book a must-read for all American history-and public-school students.", "X": null, "Y": 1, "idx": 549}
{"C": ", his simple and wide-eyed expression just like the ones you find in the newspapers, and that is the bottom-line when you see the Sphinx at the end of the movie - although the audience would have liked to know if the characters would leave the castle and never return.", "X": null, "Y": 1, "idx": 550}
{"C": "more like an advert for speed than a comedy. True, the plot was muddled but didn't lack for ideas, which in the end resulted in much better writing and acting than the clichés that were used, so watchers of this film should remember that no matter how bad it may be, there are good things to be had. Reviewers feared that the movie was more of a ghost story rather than a comedy.", "X": null, "Y": 1, "idx": 551}
{"C": "This Kind of Women has the potential to be a hilarious TV movie, however, it is sadly not. First of all, it features a bad act. Second of all, it features poor acting from actors who clearly thought they were in a Comedy Central show. Third of all, it is plainly a slam-bang script with laughable dialogue.", "X": null, "Y": 1, "idx": 552}
{"C": "acted. Characters are so undeveloped that they're barely recognizable as flesh-and-blood people. I mean, really, there's only some skinny guys running around and a couple of Asian girls (which shouldn't have been in a Christian movie) who look like a gay pastor and a Puerto Rican guy who's trying to get over the fact that he's dying of tuberculosis.", "X": null, "Y": 1, "idx": 553}
{"C": ", it was judged to have gone beyond what a foreign film deserved, for the sake of international acceptance, however it did not deserve. It was a simple slow moving sanitized snooze fest. The likes of ", "X": null, "Y": 1, "idx": 554}
{"C": "to Archie's Special Edition, I left the theater. Most of the party guests left after the first 10 minutes, they were not entertained. Even the cast seemed upset that the movie was over, they had given up in the theater and I knew why, the show had become painfully boring. The actors were good though, there was a lot of eye candy but they couldn't save this show. Nobody would pay to watch it if the plot had not been so poor.", "X": null, "Y": 1, "idx": 555}
{"C": "reality have found what they are looking for in the world, has confirmed the greatness of racism in this country. And they've left us in the lurch with this film - a rotten, brutal, vicious farce of prejudices, races and globalization, in which the only characters you care about are those already in the movie - and that theirs are clever enough to remember how to get out of every situation.", "X": null, "Y": 1, "idx": 556}
{"C": "films I have ever seen. All about love, right? Haunting visions of wintry cold North and Antarctic landscapes bleakly juxtaposed with a self-indulgent, self-important fantasy about love and youth that frequently drags and offers very little to look at in its attempts to provide some kind of meaningful story. ", "X": null, "Y": 1, "idx": 557}
{"C": "reviewer, Darkside, was that it took a poignant plot - centered around corrupt cops and an even more confused lead character - and made it look much worse than it was... Darkside is really a lot of tedious bureaucracy and silly human drama... There is just not enough there to keep me interested and the plot threads are poorly developed... A major disappointing here is how close Darkside is to being a standard series.", "X": null, "Y": 1, "idx": 558}
{"C": "a fatal trend...the script lacks detail and the dialog is full of mincing mumbling... A miserable excuse for a petty king's ribbing. The killer is very strange, he wears a turban and says things that could only be done by Hitler's beleaguered communists. As far as the story goes, the movie makes you look at your watch.", "X": null, "Y": 1, "idx": 559}
{"C": "best science fiction/fantasy movie ever made. A lot of the dubbing is creepy and sometimes crude, especially when there is a mumbled ", "X": null, "Y": 1, "idx": 560}
{"C": "the worst fantasy movie i have ever seen. the acting is horrible, the script and directing were laughably muddled, i have no idea how mike littlehead acted, the actors themselves are shaky and for real, the only difference between a pre-school thing and a stage play was the pov changes.", "X": null, "Y": 1, "idx": 561}
{"C": "art house movies, and every other of those kinds of movies was bad. This ", "X": null, "Y": 1, "idx": 562}
{"C": "worthy. the writing is rubbish, it makes you want to slam the DVD button, it makes you want to look at the DVD menu and hit one of the very, very few legal options that are available for the 80's, and the musical score is utterly laughable. It's a very big production with a big company who obviously wanted to make money off of it.", "X": null, "Y": 1, "idx": 563}
{"C": "out on its own wordlessly foggy finish. its refreshingly plump brass ball ends in a belated swan song for the romantic genre.", "X": null, "Y": 1, "idx": 564}
{"C": "be in my top 3 list for worst. Don't bother watching. If it weren't for the amazing cast then maybe i would have watched it but it was the worst ever! I do not care what the other actors think I will be watching, I lost all respect for the cast. Damn this movie sucks.", "X": null, "Y": 1, "idx": 565}
{"C": "eves seems oddly detached, as if they really don't care about his characters at all.", "X": null, "Y": 1, "idx": 566}
{"C": "because as a fan of both Andy Goldsworthy and Mary Shelley I think she should have quit in the first 10 minutes. As a fan of either actresses work I did not enjoy this movie and did not find it very well done. The special effects were poor, so if you have never seen a musical play (as I did) you may not understand.", "X": null, "Y": 1, "idx": 567}
{"C": "fans try to bring up the final fight scene in the documentary -- is that even one of them? ", "X": null, "Y": 1, "idx": 568}
{"C": "like fish sauce, and consists of segments from the anastasia films that they have made. This ", "X": null, "Y": 1, "idx": 569}
{"C": "<unk> But as <unk> the critic says <unk> in the best way. <unk> And this is where <unk> G.E.U.R.L. <unk> is going wrong.", "X": null, "Y": 1, "idx": 570}
{"C": "ringing signals of its decade... with the bursts of muted colour that show up, instead of the sharp contrasts which sometimes detract from this kind of film.... it's the same director, with the same actors - a dead script... a kind of German d<unk>scussion....", "X": null, "Y": 1, "idx": 571}
{"C": "horrible movie, not just awful, but utterly disastrous. Not only are the characters uninteresting, the script is abysmal, and the acting is truly atrocious (especially given the budget), but the cinematography is...let's be honest, the quality of cinematography in this film is just plain terrible. But wait a minute, that's not all: it has a whole list of other ", "X": null, "Y": 1, "idx": 572}
{"C": "herself at jennifer aniston s last cell phone call, and had a fucking blast with rob ross and janine foster.", "X": null, "Y": 1, "idx": 573}
{"C": "this film. Bad luck with that. The director does nothing but spend all his time showing the genius of John Waters and his minions in creating such things as the first Devils Ball. Actually, most of the movie just dragged on to show the extreme beauty of a woman. In some parts, I found myself writing, ", "X": null, "Y": 1, "idx": 574}
{"C": "plot, and cheap production values that make me want to say ", "X": null, "Y": 1, "idx": 575}
{"C": "'Palm Beach's less inept in the directing category and to Tom Mankiewicz's 'Warror Knight's best actor is a bit insulting. The 'Air of Stars' is 'just a glimpse,' but it gets the job done.", "X": null, "Y": 1, "idx": 576}
{"C": "-fifteenth-century version of Whoville and Blackadder, is insulting. The novel focuses on a widowed father and his son, the latter growing up and aspiring to literary greatness.", "X": null, "Y": 1, "idx": 577}
{"C": "'t think of a better way to describe this movie than that. I agree, Jo. It does start and end well, but the lull between them is so oddly prolonged that it makes you long for a decent <unk>60s episode of Cheers or another melodrama of that sort.", "X": null, "Y": 1, "idx": 578}
{"C": "restaurant and expect to have a pleasant experience because it just doesn't ", "X": null, "Y": 1, "idx": 579}
{"C": "d, overblown, over-indulgent, over-kill sci-fi evocation of the Italian Romantic period.. the film is about a girl who decides she wants to make a movie about a mad scientist, and more.. you will find a 100 words that will describe this film..(and that is only 15 words of the 90 page review...", "X": null, "Y": 1, "idx": 580}
{"C": "That Jack Built, was a reasonably entertaining low budget movie that fortunately got critical acclaim largely because it was good enough to entice a ratings run that saw it in excess of 10 million theaters in just two weeks. Even though the movie contains no nudity (a shame since it is a very funny piece), the setting is and subject matter is extremely poor.", "X": null, "Y": 1, "idx": 581}
{"C": "forgettable films of the year... it seems no one knew how to sell it to cinemas or television stations, so it ended up making no money at all, and some of the cast were left with nothing to do, with the exception of replace their wardrobe, or an old MTV look... with their appendages tied around their waists... and...", "X": null, "Y": 1, "idx": 582}
{"C": "ns of red-hot razzle-dazzle and nonsensical nonsense and gettin' married they are divorced and kicked out. then there was the unbelievable version that the writer/director/producer/actors used to inflate their stars (when speaking of the musical numbers, only one of them really shows up at all in my movie review of ", "X": null, "Y": 1, "idx": 583}
{"C": "something that isn't quite up to par. It's full of clichés, slow to develop and worst of all involving annoying Britney Spears morphing into an older lady... you'd do better to see the movie itself. The only thing better than this deranged travesty of film making is being familiar with the idiosyncrasies of cat behavior.", "X": null, "Y": 1, "idx": 584}
{"C": "one. what can i say it sucks for a comedy, its not that funny as any other movie, its pathetic and repetitive i wouldnt waste my time on this movie. they spent only 105 minutes making this movie and that was a good thing...", "X": null, "Y": 1, "idx": 585}
{"C": ". Without the... chemistry between the actors, the story and direction would seem to be pointing toward an endless procession of clichéd happy endings... as would have been the case in ", "X": null, "Y": 1, "idx": 586}
{"C": "vainly interesting thought is to blur all boundaries between it and its offspring. Unlike the proverbial ", "X": null, "Y": 1, "idx": 587}
{"C": "million, the public could have saved themselves some cash if they were subject to only 80 minutes of up-close-and-personal with the corporation's controversial president and executive director. In fact, the main reason you can't think of to see this movie is that the theater is completely sold out of good seats. Or maybe they were just in the very minority; maybe it's just the screenplay which seemed like a recycled effort from the numerous Hollywood gangster films.", "X": null, "Y": 1, "idx": 588}
{"C": "full of redundancies. It isn't even all that funny, the story is shoddy, the film is boring and empty. We have to drive in to Hollywood and hope for something better. Disney, please out you are ", "X": null, "Y": 1, "idx": 589}
{"C": "obnoxious political views of its antagonist, who, despite some scraggly ", "X": null, "Y": 1, "idx": 590}
{"C": "miss the underlying points of naive adolescent rebellion and alienation, and to offer scant resolution to the suffering brought on by ", "X": null, "Y": 1, "idx": 591}
{"C": "in voices that are very distinct from those of their real-life counterparts. While the real Fred Willard probably hated this movie, many of his true-life fans might have loved it if it had been a little more workable in terms of plot. It is a truly dreadful movie. It doesn't tell us who the bad guy is, we only see a bunch of people--guys who, like Fred, get shot.", "X": null, "Y": 1, "idx": 592}
{"C": "do not develop or come off. There are no tensions to the plot, the film looks and feels like an overgrown remake of Friday Night Lights. The characters and the plot have been done before many times, in better films. So there's no point to making a remake. The plot is the same, the dialog is the same, the characters are the same, you get the idea. It's just embarrassing. A big fat mess, with nothing to do.", "X": null, "Y": 1, "idx": 593}
{"C": "on a novel (Switched On: The Strange Case of Jane Dalloway, The Shirling Garden Murder Case).", "X": null, "Y": 1, "idx": 594}
{"C": "...constant drum beats! This movie is so clichéd that the most original idea could be offensive. The wardrobe alone is a little less than astute, and the acting is just so terribly overwrought and overdone that I got the feeling of the film's writer-director abandoning the script.", "X": null, "Y": 1, "idx": 595}
{"C": "man dreams he is a Henry V legend, and then gets eaten by the bad guy. This is a collection of cheesy songs, all of them his own compositions, that make him look like a werewolf, and that he could just as well be one, or even one of the more charismatic slavers from the movies. ", "X": null, "Y": 1, "idx": 596}
{"C": "anti-drug movie, but it's also bad filmmaking - superficial and self-indulgent, which is why it garnered a 1 in the 'Netflix Guide'. Director Shack tells the scriptwriter to do everything in his power to hit every emotion in the audience with every shot, but the viewer can't help but become frightened. Surely director Shack did his research.", "X": null, "Y": 1, "idx": 597}
{"C": "wishy-washy excuse to admire & document the mad genius of David Lynch & his crew. i guess he's the only writer who gave all his money to this pompous and rotten-endowed charade of a movie.", "X": null, "Y": 1, "idx": 598}
{"C": "ing genre for films in this one, which just ended of the summer and not even the year is worth mentioning. A reboot of the movie which became a network television hit and although some good idea it didn't come into the original form. The storyline doesn't make sense, nor is it exciting. I haven't had the chance to read the book that everyone wrote about but the director seems to have it.", "X": null, "Y": 1, "idx": 599}
